{
  "chapter_number": "Chapter 193",
  "title": "Utopia",
  "short_summary": "Crocodile desires the ultimate weapon Pluton, Nami finally defeats Miss Doublefinger, and Zoro begins his battle with Mr. 1.\n",
  "long_summary": "Remembering Usopp's words, Nami begins to unleash her ultimate attack, but Miss Doublefinger points out Nami's leg injury, also attacking her with Sea Urchin Sting, but Nami barely blocks the attack, further injuring her leg. Nami comments that the amount of pain she is suffering is nothing compared to the amount of pain Vivi is going through. Nami finally unleashes her Tornado Tempo, but two plastic doves attached to wire come out of the Clima-Tact, much to Nami's shock and disappointment, thinking it was another toy. However, the doves and the wires attach to Miss Doublefinger and become tangled, spinning her at a rapid rate and forcing her many meters back with great force, knocking her through a building. The force also knocks Nami to the ground. With Miss Doublefinger defeated, Nami emerges as the victor.\nBack at the palace of Alubarna, Crocodile explains that the ancient weapon of Pluton is strong enough to destroy an entire island without a trace, and its location is somewhere in the kingdom. With this weapon, Crocodile can establish the world's leading military power. While Vivi wonders if such a weapon is really in this country, Crocodile reveals his plan to bring all pirates under his rule and even surpass the government itself. Cobra questions why he knows that name, and he also questions if such a weapon is even located in this country. While Crocodile expected as much, he also mentions how the bulk of the royal army are in the city square, where there will be a massive explosion in 30 minutes: he has hidden a bomb with a blast diameter of 5 km. Calculating that the rebel army will make their way through by then, Crocodile sarcastically tells Vivi that her wish of stopping the conflict will come true, as both the rebel and royal army will be blown up. An enraged Vivi asks Crocodile just what her people have done to him, while Crocodile asks Cobra where the poneglyph is located. Cobra, having lost hope, agreed to guide Crocodile to it, but Chaka angrily tells Vivi he can no longer hold back his fury.\nMeanwhile, in northern Alubarna, Zoro is in a heated battle with Mr. 1. Equipping his third sword, Zoro attacks with Santoryu: Ushi Bari, but Mr. 1 uses Spider to harden his body, emerging from the attack unscathed. Zoro deduces that Mr. 1's body is as hard as steel, and if Zoro cannot learn to cut through steel, then he cannot deal any damage. Zoro, removing his cloth, tells Mr. 1 he is unlucky, as he has been waiting for a chance to \"ascend to the next level\", and also mentions when he (Zoro) is done with him, he will be a man who can even cut through steel.\n\n"
}