{
  "chapter_number": "Chapter 18",
  "title": "The Pirate Buggy the Clown",
  "short_summary": "With all the other pirates defeated, Buggy and Luffy prepare to fight. Luffy asks about Buggy's connection to Shanks, but Buggy mocks him. Each fighter's ability gives them an advantage over the other, and onlookers become too afraid to enter such a dangerous battle. Finally Buggy lands a hit on Luffy's hat, enraging the young pirate. Realizing whose hat it is, Buggy begins to target it specifically, and reveals he was a comrade of Shanks. Luffy refuses to believe this, and lands a powerful strike in return.\n",
  "long_summary": "Buggy confirms the \"Red-Hair\" he mentioned was Shanks. Luffy demands he tell him where Shanks is. Buggy implies he may know where Shanks is, but Luffy calls him an idiot for the way he said it. Buggy loses his temper, asking him if he can reflect knives, only for Luffy to automatically confirm he cannot.\nWith that, Buggy attacks, and Luffy jumps to avoid him. Seeing Luffy in the air, Buggy points out that Luffy is now helpless as he cannot fly like Buggy. However, when he attacks, Luffy stretches his arm to a lampost and pulls himself out of the way. As Buggy's attack flies past, Luffy throws a long punch at Buggy, who dodges and tells Luffy that his power is also his weakness, and that he has now left himself open. He fails to notice that Luffy's punch has kept going, and that he has got hold of a windows ledge.  He uses the ledge to launch himself into another attack, which Buggy dodges again.\nLuffy crashes into the ruins of a house behind him. After stealing the treasure, Nami watches the fight from a distance. Some of Buggy's crew decide to pretend to still be unconscious, rather than risk being killed if they get involved in the fight. Buggy launches another attack, sending out his arm holding three knives. Luffy grabs it, but Buggy separates his hand from the attacking arm to land the strike anyway. Luffy dodges, but is struck in the side of the face by one of the knives. The blow then pierces Luffy's straw hat. \nBuggy mocks Luffy, thinking he is upset by his face being cut. Luffy reveals he is instead angry, because that last attack damaged his hat. Seeing Luffy call the hat his treasure, Buggy pulls his hand back towards him, with the hat run through by his knives. As Buggy holds the hat up, Luffy remembers the promise he made on the hat and runs after it. When he hears Luffy saying the hat belonged to Shanks, Buggy throws it to the ground, and explains he was once friends with Shanks. After Buggy spits on the hat, Luffy refuses to hear Buggy compare himself to Shanks, and throws a furious punch. Buggy separates his head while laughing, but Luffy instead hits him in the stomach.\n\n"
}