{
  "chapter_number": "Chapter 20",
  "title": "The Way of the Thief",
  "short_summary": "Just as Buggy is about to strike Nami, he suddenly collapses in pain, due to Luffy striking his lower body. Nami claims that the treasure is now hers, angering Buggy and provoking him to split into pieces and attack again. However, Luffy notices a flaw in Buggy's ability - while his body parts can fly, his feet remain on the ground. He distracts Buggy long enough for Nami to get away. As Buggy tries to reassemble his body to attack Luffy, he discovers that Nami has tied up his body parts, and he is only able to reassemble his limbs and his head. Luffy sends him flying with Gomu Gomu no Bazooka.\n",
  "long_summary": "Nami is being chased by Buggy's top half for stealing his treasure. Just as he is about to reach her, Luffy notices that his lower half has not moved at all, and kicks him between the legs. As Buggy hits the ground in pain, Luffy reminds him who he is fighting. Luffy tells Nami to abandon her treasures and run, but Nami refuses, claiming that since she stole it, the treasure is now hers. Buggy gets angry upon hearing this, but Nami reasons that she hasn't done anything bad enough to be told off by a pirate.\nBuggy separates himself further, launching parts of himself at Nami. Luffy notices that his feet cannot fly and picks one of them up. As Buggy continues to chase Nami, Luffy tickles his foot and hits it on the ground, causing Buggy pain and discomfort and distracting him from attacking Nami. Nami swings the bag of treasure around to strike Buggy, but Buggy grabs the bag. With both of them refusing to let go, Buggy attempts to strike Nami with his knives. As he is poised to attack, Luffy kicks him in the head, knocking him into the bag and ripping it.\nWith Buggy momentarily incapacitated, Luffy grabs the map of the Grand Line. Buggy gets up and attempt to reform his body, but he realizes that he has only assembled with his hands, feet and head, since Nami has tied up the rest of his body parts. With Buggy realizing that he is defeated, Luffy lands a blow and sends him into the sky.\n\n"
}