{
  "chapter_number": "Chapter 98",
  "title": "Dark Clouds",
  "short_summary": "While he is standing at the top of Roger's execution platform, Luffy is addressed by a mysterious beautiful lady who claims to know him. It is in fact Alvida, who has been metamorphosed after eating a Devil Fruit. She has teamed up with the Buggy Pirates who also make their appearance in order to take their revenge. Cabaji succeeds in catching Luffy and immobilizes his head in preparation to his execution.\n",
  "long_summary": "Sanji becomes interested in an elephant trunk tuna fish from the South Blue and he decides he wants to buy it. Usopp finds some cheap eggs to buy and Nami is in a store buying some clothes. Nami notes that the weather is changing and that it will rain soon. Meanwhile, Luffy is standing in the execution platform where the greatest pirate Gold Roger died, he is so amazed of the view. An officer tells Luffy to get down off the platform. He reasons it belongs to the World Government but is soon smashed by Alvida.\nAlvida, now looking different since the last time Luffy met her, tells Luffy that he is the only man ever punching her and that she wants him for being a strong man. Though, Luffy cannot remember who she is. The Loguetown officers want to arrest Alvida for hurting a World Government officer however, an explosion takes down the officers and Alvida shows her Devil Fruit power when a projectile piece of the fountain slides off her skin. Buggy shows up and reveals to Luffy that the now beautiful lady is in fact Alvida, much to the confusion of Luffy.\nAlvida confirms that she is now the Devil Fruit user of the Sube Sube no Mi and her skin cannot be scarred. Alvida reveals the alliance that she has with Buggy the Clown because they share the same goal—finishing Luffy. Buggy blames Luffy for the adventure he had to go through without his crew as little Buggy. Cabaji traps Luffy in the execution platform foreshadowing Gold Roger's last moments.\nMeanwhile, in the Marine base, Captain Smoker of the marines is informed about the chaos being caused by the pirates at the execution platform. He orders the Marines to close all the roads that lead to the execution platform and to surround the port. Soon, Tashigi, sergeant of the Marines meets up with Smoker and they head to the execution platform.\nIn the meantime, the rest of the Straw Hats are concerned about the feeling in the air. Sanji tells the rest that he saw a lion with a guy wearing a teddy bear hat. Zoro on the other hand, is wondering where the townspeople are located and Nami is worried about the weather. They are looking for Luffy in the execution platform.\nThe marines receive a report of three wanted pirates in the execution platform, one being Alvida the Iron Mace, the other being Buggy the Clown, and finally Luffy. Smoker has never heard of Luffy but he thinks that it could be a tough job.\nBack in the platform, Luffy is not really concerned about his own execution going as far as wanting to scratch his nose. Much in shock to the rest of the Straw Hats when they notice that Luffy is about to be executed.\n\n"
}