{
  "chapter_number": "Chapter 180",
  "title": "Arabasta Animal Land",
  "short_summary": "Miss All Sunday saves Luffy and ask Pell to heal him. Meanwhile, the other Straw Hats are near Alubarna, thanks to various Arabasta animals' help.\n",
  "long_summary": "Luffy thinks back to the final words Crocodile spoke before he was thrown in the quicksand, and tries to escape, but the sands start to drag him down again. Luckily, he is pulled up by Ms. All-Sunday's Hana Hana powers.\nAfter Luffy thanks her for saving him, she asks him why those with D. in their names fight on. As he is clueless, she drops the subject, but the sudden appearance of Pell catches her attention. Ignoring his threats, she suggests that he aids Luffy and tells him that Vivi is going towards Alubarna, before riding off on a F-Wani. Then, Luffy grabs Pell and proclaims that he is hungry.\nMeanwhile, in Nanohana, it is finally revealed that Igaram survived back in Whisky Peak, and that he has to hurry in order to stop the civil war. As the rebels ride towards Alubarna, the sandstorm that Crocodile created has reached Yuba. Before it hits the city, Toto yells at it, saying that it can never break Yuba down.\nMeanwhile, Usopp is shocked to learn that Hasami cannot cross the Sandora river, as his breed of crabs cannot travel in water. Luckily, Chopper remembers that Hasami is fond of female dancers, which Nami is dressed as. So, to motivate Hasami (much to the joy of Sanji and Matsuge), Nami reveals her dancer's outfit. This makes sure that Hasami enters a whole new level of speed which seems to be enough to traverse the river, but sadly, it is not enough.\nLeaving Hasami behind, the crew is forced to traverse by foot, which will take at least one day. To make matters worse, they encounter a Sandora catfish, which attempts to eat the lot of them. Luckily, they are saved by the Kung Fu Dugongs. Apparently, they did so because since they are Luffy's subordinates (as he defeated them some chapters ago), and presumed that the Straw-Hats were so as well. This allows the Straw-Hats to traverse the rest of the river riding on the knocked-out catfish while the Dugong's drag it across.\nWhen they reach the other side of the river, they are saddened by the fact that without Hasami, it will be impossible to get to Alubarna in time, even with Matsuge (who can only carry two persons, preferably female). However, they are saved by the timely appearance of Karoo and the Super Spot-Billed Duck Troops.\nAt the western gate of Alubarna, the remaining Baroque Works agents are discussing the force they are dealing with, considering that the Straw-Hats managed to defeat six of their agents, not including Miss Wednesday. However, they all agree on the fact that the only thing that really matters is that Vivi must be eliminated.\n\n"
}