{
  "chapter_number": "Chapter 32",
  "title": "Disaster",
  "short_summary": "Sham, having stolen two of Zoro's swords, throws them onto the ground. When Zoro attempts to attack him, Sham appears to be hit but then manages to pin Zoro down, revealing that he was never cut at all. Buchi then jumps into the air and attempts to hit Zoro with Cat Pound, but Zoro escapes. Buchi and Sham attack Zoro relentlessly, forcing Zoro to defend himself. Usopp attempts to help, but Zoro takes the attack in order to keep the focus of the attack on himself. Buchi and Sham, seeing the opportunity, cut open Zoro's chest. Nami runs to retrieve Zoro's swords, but Jango stops her by throwing his disk at her. The disk cuts her shoulder, wounding her. Kuro appears at the top of the slope, shocking the Black Cat Pirates.\n",
  "long_summary": "Zoro demands Sham hand over his swords, but Sham refuses. Sham tosses Zoro's swords aside so he can fight Zoro, which annoys Zoro deeply. Zoro cuts Sham, believing Sham is finished, Zoro heads for his swords only to find Sham has survived on the account of the fact all Zoro managed to cut was his shirt because Sham is really skinny. Buchi enters the fight as Sham holds Zoro against the ground. Zoro manages to toss Sham aside and barely dodge the attack; the ground breaks where Buchi impacts it.\nZoro realizes that he has to fight with one sword against the pair and there is nothing he can do, and he also notes if Buchi hits him with that technique, he will break every bone in his body. The pair strike at Zoro in a fury of cat scratches, and Zoro can only defend against the pair for now. Usopp fires his slingshot in an attempt to aid Zoro, but Zoro takes the damage, leaving himself to be hit by Buchi. Nami angrily tells Usopp off for his failed attempt, but Usopp tells Zoro took the hit on purpose. Zoro yells on them that if they hit the pair, the Nyaban brothers will go after them instead.\nNami attempts to get Zoro's swords for him, however as she approaches so does Jango and he slashes her side with his ring. Suddenly, Jango gets a bad feeling come over him and the Nyaban brothers both become incredibly frightened. On top of the slope stands Kuro. Kuro demands to know why dawn has passed and his plan is not in motion.\n\n"
}