{
  "chapter_number": "Chapter 64",
  "title": "The Mighty Battle Spear",
  "short_summary": "Don Krieg brandishes his strongest weapon, the Great Battle Spear, which he uses to seemingly dominate Luffy. However, Luffy manages to break the tip of it.\n",
  "long_summary": "Don Krieg is knocked down once again by Luffy. This creates severe anguish amongst his crew members, as Don Krieg has always gone out of a battle unscathed. However, when one crewmate states that he believes Luffy to actually be stronger than Krieg, he arises, telling them to shut up before combining his shoulder plates together to form his \"Great Battle Spear\", which he slams into the ground next to Luffy, creating an explosion.\nThe crew members are finally rejoicing as they see Krieg's secret weapon, as he discards his cape and comments that it's way stronger than the stakes he fired at Luffy earlier. While Luffy wonders how the spear made an explosion, Krieg swings it again, sending Luffy flying over the ocean, but luckily, he stretches towards a platform floating. However, due to the fact that he has lost lots of blood thanks to Krieg, and that the platform he's standing on is unstable, he soon falls to his knees.\nNow, the crew members are talking amongst themselves about Krieg's weapon, which apparently creates explosions depending on how powerful the blow is. Krieg continues his assault on Luffy, who is dodging for his life. The crew members are now discussing Krieg's massive strength, as the lance weighs approximately 1 ton, yet Krieg can swing it around with only one arm.\nFinally, Luffy loses balance and jumps over Krieg's blow, but this makes him wide open for an attack. However, just in the nick of time, Luffy grabs the lance before it can hit him. Enraged, Krieg slams the lance into the ground, forcing Luffy to let go. Krieg proceeds to ram his lance into Luffy, who grabs the tip, but Krieg merely whips it around, creating an explosion which sends Luffy flying. As Krieg swings again, Luffy is hit head-on. Krieg then proceeds to tell that him that he is stronger than Luffy.\nHowever, Luffy answers by slamming his foot into the ground, breaking the spear's tip, much to Krieg's confusion and horror. Luffy tells him that he hit the tip 5 times, and that with the wide area they have landed in, Luffy can defeat him.\n\n"
}