{
  "chapter_number": "Chapter 81",
  "title": "Tears",
  "short_summary": "After Arlong has Nezumi steal the money Nami saved up to purchase Cocoyasi Village's freedom, she agrees to save up the money again from scratch. However, the villagers have had enough, and rise up against Arlong despite Nami's pleas. Luffy then comes upon Nami, and she breaks down, asking for his help to defeat Arlong. Luffy and the Straw Hats readily oblige, and Luffy breaks into Arlong Park as he confronts Arlong.\n",
  "long_summary": "On the Marine ship docked outside Cocoyasi Village, Nezumi gleefully examines the money he stole from Nami, laughing at her stupidity to work for Arlong for her freedom this long. Meanwhile, Nami confronts Arlong in Arlong Park over her money being stolen, and Arlong acts as though Nezumi stealing it was out of his control, saying Nami will just have to start saving 100,000,000 again from scratch. He reminds her that if she tries to run away, he will kill the residents of Cocoyasi Village, and Nami remembers Genzo telling her that they had kept this threat secret to her in case she wanted to run away. Nami breaks free and runs out of Arlong Park, followed by Arlong's jeering. Back in Cocoyasi Village, a furious Genzo tells the villagers to prepare to take up arms and fight the Arlong Pirates, while Nami is desperately running back to stop them, as she knows they'll die if they fight, and that would be the end of everything. Genzo tells the villagers that they promised each other eight years ago that they would endure the fish-men's cruelty as long as it took for Nami to buy back the village, but they can no longer keep living under these conditions if Arlong has no intention of ever letting them go. However, he shouts that they'll never forgive the fish-men for toying around with Nami's good heart, and all the villagers agree with him, stating that they are more than ready to fight, and have been for eight years. However, Nami reaches them and tries to assure them that she is readily willing to save up the money again, even saying it would be easier this time. The villagers are shocked and deeply moved by her efforts. In Arlong Park, Chew laughingly comments that Arlong can be pretty heartless, with Arlong replying that he's not just going to let a navigator of Nami's ability get away from him. However Arlong replies he isn't completely heartless and that he will let Nami go eventually, but only after she has made a map of the entire world, as he and the other fish-men roar with laughter upon realizing that will take decades.\nMeanwhile, Genzo does not listen to Nami's assurances, telling her that she knows it would be in vain. He embraces her, commending her for the efforts she has made to liberate them, which almost moves Nami to tears. Genzo then tells her to leave the village, and Nojiko backs him up, encouraging her sister to go and pursue her dream. Now desperate, Nami pulls out a dagger, declaring that she does not wish to see any of them hurt again, and telling them they'll die, but Genzo displays his dedication by grabbing the dagger, cutting his hand in the process, and the villagers say their hearts are set. Genzo shouts at Nami to get out of the way, and the villagers race past her toward Arlong Park, declaring their will to fight even if it is likely they will lose, leaving Nami kneeling in the middle of the street. Driven to her breaking point by rage, grief and despair, Nami grabs the dagger and begins to psychotically stab herself in the shoulder where her tattoo is, repeatedly screaming Arlong's name as tears run down her face. However, Luffy comes and grabs Nami's arm before she can harm herself further. Keeping her back to him, Nami tells Luffy that he doesn't know anything about what's happening here, and that she already told him to leave the island because this has nothing to do with him, throwing a few handfuls of dirt in his direction. Luffy acknowledges both these points, but he doesn't move or say anything further. Nami finally breaks down in tears, turns to face Luffy, and begs him to help her. Luffy responds by silently putting his straw hat on her head, before he walks forward and declares extremely loudly that he will help. Nami is shocked to have the straw hat on her head, knowing Luffy's attachment to it, and is moved to fresh tears, as well as when she watches Luffy walk toward the rest of his crewmates, who were waiting just ahead and tells them to come with him, to which they immediately agree. Meanwhile, the villagers have reached Arlong Park, only to find a battered and bloodied Johnny and Yosaku sitting in front of the gate. The pair mentions how they heard Nami's backstory from the woods, and ashamed at having doubted her character, went to confront the Arlong Pirates, but were defeated. The two bounty hunters do not intend to let the villagers pass them, as they have no chance of winning, and instead are waiting for another group of men, to the villagers' confusion. Inside Arlong Park, Arlong wonders if Johnny and Yosaku were part of Zoro's crew, and Kuroobi doubts it, saying they were too weak for that. Just then, Luffy punches the gate off its hinges and asks which of the fish-men is Arlong, much to Arlong's shock and chagrin.\n\n"
}