{
  "chapter_number": "Chapter 118",
  "title": "Someone's Out There",
  "short_summary": "Due to a belief that the Straw Hats were responsible for the special rum he drank, a fight between Dorry and Luffy broke out, with Luffy easily defeating Dorry due to his injuries. Luffy believes neither Brogy nor his crew would resort to dirty tactics and believes there may be a third party involved. Elsewhere, Miss Valentine and Mr. 5, the two disgraced baroque works agents, enter a wax house where they are greeted by Mr. 3. He informs them of their job to capture the two giants Dorry and Brogy as they both have bounties of 100,000,000 back from when they were still pirates. It is also revealed that it was Mr. 3 who placed the bomb in the rum. Outside, the middle volcano erupts, signaling another duel between the two giants.\n",
  "long_summary": "Dorry believes that the Straw Hats betrayed him and attacks Luffy. Vivi tries to convince him that they didn't know who put the explosive in the barrel. She tells him to stay put because his body is damaged enough. Dorry tries to slash him with his sword, but Luffy evades the attack. He jumps in front of Dorry's face and prepares a punch, but Dorry knocks him with his shield. Luffy uses his rubber body to grab a tree from the forest and launches himself and evades another one of Dorry's sword attacks. He then uses Gomu Gomu no Rocket to launch himself towards Dorry and nearly knocks him out. Dorry steps on him and realizes that Luffy is a Devil Fruit user and that he was careless and falls unconscious. Luffy gets out of the dirt. Vivi said that she thinks Dorry will be alright and that Luffy did the right thing because otherwise he wouldn't have calmed down. Luffy is pissed off, and said that it couldn't be the other giant or one of his crew mates that placed the explosive in the barrel. He said that he believes that someone besides his crew and the giants are on the island.\nSomewhere else a dinosaur tries to bite something white and destroys his teeth. The dinosaur is confused staying in front of a wax house.Mr. 5 orders the dinosaur to move and Miss Valentine uses 10000 KG Press to knock it out. After that they enter the wax house. Inside it, Mr. 3 and Miss Goldenweek were waiting. Mr. 3 was drinking tea while Miss Goldenweek was sleeping. Mr. 5 compliments Mr. 3 for his ability to make an instant hideout in the middle of the jungle. He asks that they let him and his partner complete the mission since it is still theirs. Miss Valentine said that they won't make the same mistake twice. Mr. 3 mocks the Mr. 5 pair by saying that they failed because they are weak not because they made a mistake. Miss Valentine stated that they failed because they had no idea that the princess would have pirate escorts. Mr. 3 mocks them because saying that they are resorting to childish excuses. He said that they are professionals and that losing to their opponent is as shameful as revealing their organization existence to the general public. Mr. 3 continues, saying that the missions they undertake must be accomplished perfectly with no mistakes. As a second chance, he offers them 30% of the pay from the job because they managed to tail the targets to Little Garden. He states that if the Mr. 5 pair still don't want him to interfere he needs to take some actions so that the 2 will not interfere with him again. Mr. 3 offers them black tea, telling them there is a fortuitous opportunity for them on the island, an opportunity to make a huge sum of money. Mr. 3 shows them the bounty posters of Dorry and Brogy and thanks them for the chance to come on the island. He explains that those wanted posters are from 100 years ago, telling them that there was once a group of giant pirates who pillaged town after town and terrified the entire world. He continues saying that the group was called the Warrior Giant Pirates and the captains were the ones known as Dorry the Blue Ogre and Brogy the Red Ogre, but their names faded into legends. Mr. 3 said that the 2 were still alive and their bounties were not called off either. He revealed that their 2 bounties were worth 100,000,000 each, in short 200,000,000. Mr. 5 and Miss Valentine are surprised at hearing the immense amount of money they could make. Mr. 3 tells them that if they are going to succeed in their mission and also bring 200,000,000 their promotions are guaranteed. Mr. 5 understand the reason why Mr. 3 placed the bomb inside the rum barrels. Mr. 3 said that they would stand no chance to fight them head-on and tells them to follow his commands. Mr. 3 said that with a little scheming even a mountain can be leveled down to the ground.\nMeanwhile, the volcano erupts again and Brogy is prepared for battle. Usopp worries about the injuries he received, but Brogy tells him that both he and Dorry were injured in the previous battle, and that making such excuses in a relentless fight to the death would only tarnish one's honor.\nDorry struggles to step up and fight and Vivi tries to stop him warning him that he might die from his injuries if he fights. Dorry states that he vows to give a fight worthy of Elbaf's honor.\n\n"
}