{
  "chapter_number": "Chapter 125",
  "title": "Candle Champion",
  "short_summary": "Time is running out for Luffy in his quest to free Zoro, Nami, and Vivi, and Mr. 3 tries to finish him off by creating a powerful wax armor. However, despite Mr. 5 and Miss Valentine trying to stop them, Usopp and Karoo manage to wrap a rope covered in oil around Mr. 3's candelabra, and Luffy uses Mr. 3's burning hair to set it ablaze and try to melt the wax. Meanwhile, Sanji discovers a house made of wax.\n",
  "long_summary": "Sanji notes that he has waited on the Going Merry for a while now, and so decides to go look and see what is going on. As he calls out for Nami and Vivi, he notices a house made out of wax. Meanwhile, Mr. 5 and Miss Valentine tell the angry Luffy to accept the death of his friends. Mr. 3 then creates a massive suit of wax armor around his body, which he calls the \"Candle Champion\", and he prepares to finish off Luffy. Mr. 3 wants Miss Goldenweek to paint his suit, but she declines, and Luffy is distracted as he stares in awe at the Candle Champion. After Usopp yells at him, Luffy attempts to attack, but his punch is easily batted away by Mr. 3's giant wax fist. Mr. 3 unleashes several punches at Luffy, who tries to respond by kicking him in the face, but Mr. 3 shields himself from the kick.\nUsopp then realizes that they can use fire to melt Mr. 3's candle wax, and tells this to Luffy. However, Mr. 3 reveals that Zoro, Nami, and Vivi's hearts will stop in 30 seconds due to their wax encasement. Usopp attempts to free them by shooting a fire bullet, but Mr. 5 shoots him with an explosive bullet. Luffy attempts to attack Mr. 5, but is pounded into the ground by Mr. 3, and as Usopp tries handing Karoo a rope, Miss Valentine confronts him. She sits on Usopp and steadily increases her weight, and Mr. 5 shoots at Karoo as the duck runs off with the rope. Luffy manages to get to Mr. 3's head and pulls on his hair, intending to use the flame at the end of it to free his friends. Usopp tells Luffy to burn Karoo's rope, which is covered in oil and is now wrapped around the candelabra. Luffy then slams Mr. 3 headfirst onto the end of the rope in front of him.\n\n"
}