{
  "chapter_number": "Chapter 129",
  "title": "Straight Ahead!!!",
  "short_summary": "After defeating Mr. 3 and finding a way to head towards Arabasta, the Straw Hats have one last obstacle to cross: a giant goldfish who blocks the exit of the island. However, the Elbaf warriors offer their help and ask the crew to go straight ahead. While they are being eaten by the fish, the giants release a powerful attack which pierces the monster from end to end, providing a straight exit for the Merry as promised. The ship is sent flying and Usopp and Luffy (who were the only having faith) cry out of joy. After their farewell, the giants remember the old days through a flashback.\n",
  "long_summary": "The Straw Hats set sail from Little Garden but are quickly confronted by an island devouring goldfish. Nami demands they maneuver away from the beast but recalling the giant's words, Usopp and Luffy continue to sail the ship straight as commanded—into the mouth of the beast. The giants, viewing this scene from Little Garden, remember the last time they met an island devouring sea beast. The giant duo, in unison, throw their weapons at the beast. They create a powerful attack that frees the Straw Hats from the beast's stomach.\nDorry and Brogy then recall how the 100-year duel had started with them. Many years ago, the two ruled Elbaf. When they both returned home with two large sea creatures, they were asked whose was larger. They immediately began an argument and spent years attempting to settle the wage on who caught the larger fish. The mountains that appeared on the island, once zoomed out, are revealed to be the bones of the sea beasts they had caught in year's past.\nIn the present, the giants began feeling nostalgic but they heard the eruption of a volcano signaling another duel time. Meanwhile back on the Going Merry, Usopp promises to one day visit Elbaf, while Nami asks Vivi to navigate for a while. Sanji serves lunch to everyone while Zoro continues to train as he feels he's grown weak from lack of practice.\nElsewhere in Arabasta, Mr. 2 prepares to leave for Little Garden and feels bothered having to waste his time.\nOn the Going Merry, Nami collapses with a fever.\n\n"
}