{
  "chapter_number": "Chapter 181",
  "title": "Super Spot-Billed Duck Quiz",
  "short_summary": "The Baroque Works top agents are waiting for the Straw Hat Pirates to prevent Vivi from encountering the rebels. Suddenly they spot all 6 members of the Super Spot-Billed Duck Troops running toward Alubarna. Unable to know which one is Vivi, they have to split to go after them. But the Straw Hats' strategy was not that simple as each member have disguised themselves.\n",
  "long_summary": "The battle between the rebels and royal guards is about to begin with each side getting ready to fight one another as the rebels are just 30 minutes away from Alubarna on horseback. Chaka instructs the royal guards not to let any of the rebels enter the city, ordering them to protect all the gates in every direction.\nOutside Alubarna, the Baroque Works' agents are waiting for Vivi, as they are ordered to kill her so that she would not be able to interpose on Crocodile's plan. Suddenly, Mr. 4 spots 6 members of the Super Spot-Billed Duck Troops approaching them, each carrying members of the Straw Hat Pirates. Miss Merry Christmas wonders why there are 6 of them, as they only have information on 4 pirates (Luffy, Zoro, Nami, Usopp). Miss Doublefinger points out that they have another member named Mr. Prince, and with Vivi, the number is accurate. Mr. 1 reminds them that the number does not matter, as they are only after Vivi. The agents are trying to pinpoint which of the ducks are carrying Vivi, however they cannot figure this out, due to each person wearing the same cloaks. At the same time, Mr. 2 notices that the rebels have almost reached the city, they have to do something quick so that Vivi does not meet up with Koza.\nMr. 4 fires an exploding baseball at the Straw Hats but his bomb are ineffective against the ducks' speed, who start to split into small groups of 2. Mr. 4 and Miss Merry Christmas chase after the pair who went south. Usopp fires his Flame Star at Mr. 1, who blocks it with his hand while two more ducks head west. Mr. 2 is ran over by two ducks who head southwest. Mr. 1 and Miss Doublefinger chase the pair that went west, and Mr. 2 chased the pair that went southwest. Unfortunately, the agents are deceived, the six ducks who were rode by Zoro and Nami (who are facing Mr. 1 and Miss Doublefinger), Chopper and Sanji (who are facing Mr. 4 and Miss Merry Christmas), Usopp and Matsuge (who are facing Mr. 2) were decoys.\nVivi, who stayed behind and had been hiding alongside Karoo, was waiting for the path to be clear, thanking the others for acting as decoys. With nobody left in their way, Vivi and Karoo can now catch up with the rebels.\n\n"
}