{
  "chapter_number": "Chapter 57",
  "title": "If You Have a Dream",
  "short_summary": "Sanji's flashback: Sanji's ship is attacked by Zeff and his crew. Suddenly a storm comes up and Sanji goes overboard due to a massive wave. Against all expectation, Zeff jumps into the sea to save him. A few days after the storm, they find themselves stranded at sea on a barren, inhospitable rock.\n",
  "long_summary": "9 years ago, a cruise ship was attacked by pirates, fresh from their journey to the Grand Line. They are the fearsome Cook Pirates captained by the chef pirate Zeff. The two captains meet, and hardly a second passes after the cruise ship captain asks their demands when Zeff commands his men to take everything of value. After pillaging, they bring back their spoils to the deck, in order to transfer it to their ship. Zeff notices something amiss with one of the bags that his underling set down, and he commands him to stop. The pirate knows he has been caught stealing food from the bag, and he starts to make excuses, but Zeff delivers a megaton force kick and sends him across the deck. Zeff reiterates that you should never touch someone else's food. Meanwhile, Sanji does not accept this fate and has decided to bravely attack the pirates with his cooking knives. He is easily beaten but does not surrender. The young boy does not want to die, until he has realized his dream to find All Blue. Upon hearing this, Zeff has a pensive look on his face, as if he is considering Sanji, but all the other pirates burst into raucous laughter, stating that such a place does not exist, even on the Grand Line.\nWith the storm getting stronger, Zeff orders his men back to their ship. But a large wave catches Sanji and he is thrown overboard. Immediately, Zeff snaps a mast off with a kick and grabs it while he jumps in to save him, against his better judgment. Unfortunately, an even bigger wave smashes both ships to pieces, and all is in chaos as the storm goes on.\nAfter a few days, Sanji wakes up on a large rock, deserted at sea. He sees that he only has Zeff for a companion, and starts when he realizes the possible threat. After being kicked though, it is evident that he is in no condition to move so fast. Sanji asks about his ship, and Zeff guesses that there were no survivors. The wreckage of his own ship around him indicates that no one is likely to have made it. They have no choice but to wait for rescue, which they both know is unlikely, due to their precarious situation. He informs Sanji that the storm was two days ago, and they were washed up on this barren rock, stranded with no resources whatsoever. They still maintain their rivalrous banter, but Zeff at least deigns to give him a portion of some food that washed up with them. Sanji complains at how much bigger Zeff's portion is, but he only says that he needs more since he is bigger. Sanji isn't at all happy about this, but Zeff has complete control of the situation, and without this food, they face the horrible possibility of having to resort to cannibalism. Zeff tells him to stay on one side of the island, while he goes to the other, so they have a greater chance of spotting a ship.\nNow alone, Sanji watches the sun setting over the ocean. He is very hungry and turns to look at his food supply, but thinks on what Zeff said earlier: Normally, it would be enough food for five days, but as chefs, they should be able to make it last longer. He hangs his head, starving but determined to stick it out. On the other side, Zeff holds a boulder aloft, and through a piece of wood clenched in his teeth, he says determinedly that this is the end of \"Red Leg\" Zeff. He brings the rock down on his leg, severing it just below the right knee. \n\n"
}