{
  "chapter_number": "Chapter 126",
  "title": "Instinct",
  "short_summary": "Zoro, Nami, and Vivi are freed from Mr. 3's candelabra, and Nami and Vivi defeat Miss Valentine while Zoro defeats Mr. 5 with Usopp's help. Meanwhile, Luffy and Karoo chase Mr. 3 into the woods, where Mr. 3 creates wax duplicates of himself in order to attack Luffy by surprise. However, Luffy immediately manages to attack the real Mr. 3 entirely out of instinct, and Karoo attacks the terrified Miss Goldenweek.\n",
  "long_summary": "Thanks to Usopp and Karoo's rope, Luffy manages to set Mr. 3's candelabra ablaze with the agent's flaming hair. Mr. 3's Candle Champion starts melting as well, and he runs off into the woods with Karoo chasing him. Mr. 5 and Miss Valentine are left enraged, and Miss Valentine flips up into the air as she prepares to finish off Usopp with a 10,000 kilogram axe kick. However, Nami and Vivi attack Miss Valentine with their weapons as they emerge from the fire, having been freed by it. Mr. 5 aims his gun at them, and Usopp seemingly shoots an Exploding Star at him. Mr. 5 eats it to try to neutralize it, but Usopp reveals that it was actually a hot sauce shot. Mr. 5 struggles to handle the sauce, and decides to kill the Straw Hats by blowing himself up as he wraps himself around Usopp. However, Zoro then emerges from the fire and cuts Mr. 5, defeating him. Brogy, having freed himself from Dorry's sword being implanted into his hand, then approaches the Straw Hats, noting that there are two enemies yet to be defeated.\nMeanwhile, Luffy and Karoo chase after Mr. 3, only to come to a clearing filled with duplicates of the agent. Mr. 3 asks if Luffy knows which of him is real, saying a fighter who relies on instinct like him could not figure it out. As he talks to Luffy, the real Mr. 3 starts sneaking up on him from behind, readying a knife to stab him. However, Luffy immediately kicks the real Mr. 3 in the face, saying he knew which one he was based on instinct. Karoo then spots Miss Goldenweek peeking at the scene from a distant tree, and starts chasing after her to her terror.\nAt Mr. 3's house, Sanji realizes he needs to stop drinking tea and resume looking for Nami. However, as he heads out he hears a Den Den Mushi ringing inside a basket. He answers it, acting like a restaurant. The person on the other end is in no mood for his antics, and thinking Sanji is Mr. 3, asks for a report. Sanji asks who he is, to which the person replies that he is Mr. 0.\n\n"
}