{
  "chapter_number": "Chapter 96",
  "title": "Greatest Evil of the East",
  "short_summary": "After taking back their navigator, the Straw Hats are making a stop in Loguetown before heading to the Grand Line. In this town, Roger was executed, starting the age of pirates. Luffy decides to see for himself the execution platform while the others go shopping. On his way, Zoro bumps into an awkward Marine girl who is the spitting image of Kuina.\n",
  "long_summary": "Nami argues that the newspaper, and everything else, has become expensive. In the meantime, Usopp develops a new chili marble to blind opponents. Luffy bumps into Usopp, causing him to spill the chili in his eyes. Luffy attempts to eat an orange from Nami's tree but Sanji defends the tree from Luffy. Zoro, on the other hand, is resting. The ship heads towards the Grand Line.\nMeanwhile, at Marine HQ, Lieutenant Brannew is reviewing every East Blue pirate's bounty. Every pirate with a high bounty in East Blue has been defeated by Monkey D. Luffy. Brannew shows Luffy's first bounty of 30,000,000. The Marines are gathered to make a vow of righteousness and justice in the sea.\nBack to the ship, Luffy is proud of his first bounty poster but Nami is afraid that everybody will try to kill. Usopp is also proud of his captain's bounty poster because the back of his head is shown. They decide it's time to head for the Grand Line. When Zoro sees an island, Nami informs them it is Loguetown, \"the city of the beginning and the end\", where the legendary Gold Roger was born and executed. When the crew arrives on the island, Luffy decides to head to the execution platform, Sanji looks for food, Usopp wants to buy some tools and Zoro thinks of buying something, which leaves Nami offering to lend him some money with 300% interest.\nWhile Zoro walks around the town, he sees a girl getting picked on because they cannot fulfill their dream to go to the Grand Line. The girl, being a swordswoman, quickly finishes them off but drops her glasses in the process. Zoro is impressed by her skills and helps her find her glasses. When the girl thanks him, Zoro stares in shock, as she is the splitting image of his long dead friend, Kuina.\nIn the meantime, on an isolated island, Mihawk is looking for someone. That someone is soon revealed to be Shanks, The Red Hair captain of Red Hair Pirates. Mihawk informs Shanks about Luffy's first bounty poster and that he remembered a story that he told him once about a kid in a little village. Shanks, eager to meet Luffy again, throws a party to celebrate Luffy's arrival and first bounty.\nMeanwhile in Luffy's hometown, Foosha Village, everybody is happy because Luffy is infamous. The villagers wonder if he is going to become a great pirate from the village. The mayor of the village, however, is not really happy of the outcome, saying that it is Luffy's dream or destiny.\n\n"
}