{
  "chapter_number": "Chapter 25",
  "title": "800 Lies",
  "short_summary": "Kaya convinces Usopp to leave before he attacks Klahadore anymore, and Luffy and the others leave soon after. Depressed at what has happened, Kaya refuses to eat or speak, causing Klahadore to explain his motivations for protecting Kaya in an attempt to cheer her up. Zoro and Nami lose Luffy, and Tamanegi tells them about a strange man walking backwards. The strange man shows up and reveals himself to be a hypnotist; but his attempt to prove it results in putting both the Usopp Pirates and himself to sleep. At the cliff, Luffy catches up to Usopp, and they talk about Usopp's father, Yasopp. Their reminiscing is cut short when Luffy notices Klahadore and the hypnotist down on the beach, discussing their plan to assassinate Kaya.\n",
  "long_summary": "Klahadore continues to insult Usopp despite being knocked down, insisting although he is not a pirate his father's blood still makes him resort to violence when he is insulted. The butler asks Usopp if he is only after Kaya's money, but before he lands another punch, Kaya begs Usopp to stop. As Usopp lets the butler go, Klahadore warns him about never returning to the mansion, and Usopp angrily agrees. The Usopp Pirates and Luffy insult Usopp for giving in so easily; as they are told to leave, the four try to go after the butler, but are held back by Zoro and Nami.\nIn the mansion. Kaya refuses to eat her meal, miserably explaining she does not want it. Her butler insists she eat so as to not disappoint the chefs. Kaya tells him he should not have insulted Usopp, and Klahadore explains that she should have faith in him, since he has worked for her for three years after losing his job on the ship he worked for. He explains he could not bear to carry the burden of failing his former employer, Kaya's father, who saved his life.\nNear the village, Nami, Zoro, Ninjin, and Piiman are sitting on a fence, and Nami wonders where Luffy got to. When Zoro explains he went looking for Usopp, the members of Usopp's Pirates explain Usopp will be at the coast. Tamanegi is missing, but Ninjin and Piiman tell them he always goes away and comes back overreacting about something. Immediately afterwards, Tamanegi runs towards them, shouting about a man walking backwards, only for the others to accuse him of lying. Shortly afterwards, the hypnotist Jango shows up, walking backwards. Jango is asked to show the three children his hypnotist tricks, but when he does it results in both him and the Usopp pirates falling asleep.\nAt the coast, Usopp sits alone on the cliff staring out to sea. Luffy appears in front of him suddenly, hanging upside down out of the tree Usopp is sitting under. Luffy asks him if his father was called Yasopp, astonishing Usopp before he asks how he knew. Luffy explains how he met him when he was young, in Foosha Village. Yasopp was his favorite member of the Red Hair Pirates, and Luffy is sure he is still be with Shanks even now. Usopp cannot believe his father is with Shanks.\nIn a flashback to Luffy's youth when he met Shanks and his crew, Yasopp demonstrates his sharp-shooting skills to Luffy by shooting an apple off a barrel. Later at the local bar, Yasopp begins to tell Luffy about his son his age. When Luffy has heard enough and is getting bored, a glass is placed on his head by Yasopp, who taps it. Yasopp stands up and calls to the other that the Jolly Roger had called him to piracy, with the rest of the crew responding by throwing their hands in the air in approval.\nBack in the present. Usopp explains he is proud of his father and he would gladly return to the mansion, despite his pride, if the butler apologized. Luffy notices that Klahadore is on the beach below them with another man, Jango. Jango confirms to the butler that the plan to murder the mansion owner is ready.\n\n"
}