{
  "chapter_number": "Chapter 99",
  "title": "Luffy Died",
  "short_summary": "When Luffy is about to be beheaded by Buggy, he claims as his last words that he will be the next pirate king and smiles while accepting his fate. This makes a big impression on Smoker who remembers Roger's execution at the same place, 22 years ago.\n",
  "long_summary": "Buggy shouts that Luffy has upset him and therefore, he needs to be executed. He orders his pirates to create chaos in Loguetown for those who dare interfere. Luffy unaware that he is the one that's going to be executed tells Buggy that it's the first time he will see a real execution. Buggy tells the townspeople that they will see the live execution of Monkey D. Luffy.\nMeanwhile, Nami tells Usopp that a storm is headed to the island and that it is more important than Luffy's execution.\nBack at the Straw Hats' ship, Mohji and Richie prepare to set fire at the ship has a backup plan if Luffy and his crew tries to escape.\nThe Marines are not sure what to do, as the pirates are fighting each other. Smoker tells the marines to let them fight each other; that way, they will have the strength to capture both Alvida and Buggy as soon as they cut Luffy's head off.\nBack at the platform, Luffy tells Buggy to let him go; however, Buggy states that if somebody tries to help Luffy, they will execute them. Luffy shouts that he will become the Pirate King shocking everybody present at the execution platform. Buggy is about to cut Luffy's head off when Zoro and Sanji show up to save Luffy. Smoker and Tashigi are surprised to hear that Pirate Hunter Zoro belongs in the same crew of Luffy. Zoro and Sanji start fighting the Buggy and Alvida Alliance to quickly destroy the stake of the platform. Luffy, apparently saying his last words to his crew because he will not survive the execution, smiles and accepts his fate. Shocked, Smoker recalls Gold Roger's execution 22 years ago.\nSuddenly, lightning strikes Buggy when he was about to kill Luffy. With the execution platform now destroyed, Luffy stands up and recognizes that he is indeed a lucky man. Everybody at the platform are confused about what just happened. Luffy, Zoro and Sanji quickly run for it knowing the marines are surrounding the area.\nSmoker asks Tashigi if she has ever seen somebody laugh at the execution platform knowing they will die. He remembers Gold Roger being the only one laughing right before his death. Realizing Luffy is escaping, he orders the first unit to take care of them, however, their gunpowder is wet because of the sudden storm, leaving the port free for them to escape. Smoker in anger decide to capture Luffy even if it's the last thing he can do.\n\n"
}