{
  "chapter_number": "Chapter 101",
  "title": "Reverse Mountain",
  "short_summary": "The Straw Hats are finally ready to enter Grand Line. Thanks to the map they stole from Buggy, Nami understands that they have to reach a point called Reverse Mountain, a mountain crossing the Red Line where the current of the four seas diverge into the Grand Line. After a scary encounter with the giant Sea Kings of the Calm Belt, they finally reach the cliffs of the Red Line and the narrow entrance of the canal that will help them climb Reverse Mountain. Despite the storm and the heavy currents, they succeed and sail toward the sea at full speed.\n",
  "long_summary": "Luffy thinks the light from the light house should not disappear, claiming it is an emergency as they could become lost. Nami reminds Luffy why she is the navigator, remembering the way to the Grand Line is her job. Later, Nami reveals to the rest of the Straw hats that the entrance to the Grand Line is Reverse Mountain on the Red Line. They are confused as they believe it to be impossible to climb a mountain with a ship. Zoro wonders if the map is accurate as she stole it from Buggy. Luffy, on the other hand, is excited to go to that \"magic\" mountain. Zoro suggests entering the Grand Line from the south, shocking Luffy. The captain explains that they must enter from the mountain because it is \"cool\", much to Nami's disgust.\nSuddenly the weather calms down, surprising Nami. She explains that they need to head towards the storm in order to arrive at the entrance. Soon, she realizes that they are in the Calm Belt and that they are in trouble because there is no wind. Nami, nervous about the outcome, orders everybody to row, prompting Usopp to remind her that it is not a rowboat. Nami explains that the Grand Line is surrounded by two seas. They are in the Calm Belt which is a sea without any wind or currents.\nThe ship shakes, confusing everybody that it might be an earthquake. Soon, the crew realizes that they are surrounded by sea kings. After a moment with the sea kings, the crew is back to the storm, Nami reminding Zoro why they need to use the entrance, Zoro now agreeing with her.\nNami then understands why they have to head for the mountain, explaining that the waves from the four seas gather there to create a stream. The stream would push the mountain's canal and when the water has reached the mountain's peak it will push back to the Grand Line. The only problem is controlling the rudder to avoid sinking. Luffy, on the other hand, does not understand and Sanji is amazed by Nami's navigation skills.\nAfter awhile, they see a big shadow ahead. They realize it is the Red Line surrounded by fog. Sanji and Usopp take hold of the rudder. While turning the heavy rudder to avoid getting off route, it accidentally breaks. Luffy has no choice but to transform into a rubber balloon to avoid hitting the gate. After a brief moment of suspense, the crew is finally back in track, cheering for their accomplishment.\nThe crew amazed by the wonders of nature, they soon see the Grand Line.\n\n"
}