{
  "chapter_number": "Chapter 34",
  "title": "Klahadore the Butler",
  "short_summary": "Luffy awakens, but the battle is suspended by the appearance of Kaya. Kuro does not want to negotiate as he believes he needs to kill Kaya to live a peaceful life, and as revenge for the boring years he had to endure.\n",
  "long_summary": "Trying to wake up Luffy, Nami just steps on his face as Jango's weapon comes flying through the air towards her. Luffy wakes up, angry Nami stepped on his face, and the ring goes into the back of his head. Kuro is angry because he thought Luffy was already dead. Luffy stops the ring from cutting deep into his skull by stomping his feet hard against the ground. To the horror of the Black Cat Pirates, Luffy takes the ring out of his head and acts as if it was nothing, just saying that it hurt and he wants to know who threw it. The Black Cat Pirates then realize there is no way they can beat him in the 5 minutes Kuro gave them.\nLuffy yells at Nami, thinking it was her who threw the ring. But then he sees her bleeding shoulder. Nami tells him to get the fight over and done with, that it is a battle they cannot afford to loose. Luffy's attention turns to Kuro. Kuro tells his former crew that they now have 3 minutes left to kill Luffy, Zoro, Nami and Usopp. The crew state they know they cannot keep to such a short deadline even with Jango and Buchi at their aid.\nAs Buchi is ordered to go after Zoro while Jango takes on Luffy, attention is drawn behind Kuro. Kaya has arrived to speak to Klahadore. Usopp is horrified she came here. Kuro is surprised to see her here, Kaya explains Merry told her the truth. As Kuro speaks, Kaya begins to realize this is indeed not the Klahadore she knew. She apologizes to Usopp for not believing him. Usopp is angry she did not run away, but Kaya asks him why he is fighting for the village when the other villagers ran him out of town.\nShe then offers Kuro all her fortune if he leaves the village. Kuro steps in and explains it is not treasure alone he seeks, but also a peaceful life. For the last past three years he has built up a reputation with the villagers, he has created a peaceful life and the incident involving his former crew and her will are all part of the scheme. Usopp tells Kaya to run now that she has spoken to him, but instead she pulls out a gun on him, Kaya demands him to leave.\nKuro comments that she has become \"stronger\" over the last three years. He then recollects the events of the last three years with her, the things they did together but then as a change of tone he calls the events \"stupid things\" and tells her straight he has done everything for her today, the day she dies. Kaya drops the gun as Kuro goes on about enduring the boring days in the past three years. Usopp is angry that Kuro is betraying Kaya's feelings. Usopp attempts to attack Kuro, but Kuro dodges the attack. As Kuro goes to strike Usopp as revenge for hitting him earlier, Luffy intervenes. Luffy punches him and swears Kuro will have a bad day since he hates being punched.\n\n"
}