{
  "chapter_number": "Chapter 145",
  "title": "Inherited Will",
  "short_summary": "Dr. Hiriluk falls into Wapol's trap. He delivers a speech about death and commits suicide. Chopper arrives and attacks Wapol in anger, but Dalton intercedes. Dalton defies Wapol by letting Chopper escape as he was inspired by the creatures determination.\n",
  "long_summary": "Dr. Hiriluk arrives at the castle in order to cure the Isshi-20 only for Wapol to reveal that it was a trap in order to capture the rebellious doctor. While Wapol laughs at and taunts the doctor, Dalton questions why the doctor came to such an obvious trap. Chess and Kuromarimo laugh alongside their king while Wapol's troops aim at the doctor. Instead of breaking down, Hiriluk drops to his knees, thankful that the Isshi-20 are fine. Dalton is extremely shocked. Hiriluk refuses to be shot by the king's soldiers, saying that he will die soon.\nChopper is shown running in an attempt to stop Hiriluk, who is making a speech about his death, stating that he will only die when he is forgotten. He begins to pour himself a drink when he notices that Dalton is crying. He shares the fake doctor's pain for this sick country. Hiriluk explains that he has lived happily and that his task is accomplished: the country will be cured, by those who remember him if not by him. He then downs the drink, which was a dangerously explosive substance, committing suicide.\nChopper arrives to find Hiriluk's hat float to the ground, the only remaining part of the deceased doctor. Wapol laughs at the doctor's death, angering Chopper and causing the reindeer to charge. While he is targeted by the soldiers who see him as a monster, Dalton interposes and begs him to depart. Since he is too weak to even defend himself, Dalton says to Chopper not to end up as another sacrifice for this country. Annoyed by Dalton's reaction who let the 'monster' escape despite his orders to kill him and his clear defiance towards him, Wapol threatens the guard chief of what would happen if he made him \"really annoyed\" as the two prepare to fight.\nMeanwhile, Chopper has reached Dr. Kureha's house, raising Hiriluk's flag. He asks her to help him become a doctor who will be able to cure every disease in the world.\nBack at the castle, Wapol has defeated Dalton and tries to negotiate with the guard chief. Dalton denies the request, stating that he will not stop until peace has returned to the country. Dalton only laughs and says that he is the most powerful person.\nThe flashback ends, returning to a scene where Luffy punches Wapol in the face.\n\n"
}