{
  "chapter_number": "Chapter 15",
  "title": "Gong",
  "short_summary": "Despite his courage, the mayor is no match against Buggy, but Luffy arrives in time to save him. With Nami going to search for treasure, Luffy knocks the mayor unconscious to keep him from getting in the way, as he and Zoro prepare to fight the Buggy Pirates.\n",
  "long_summary": "Boodle challenges Buggy over the matter of the town. While the crew laugh, Cabaji, Buggy's staff offers to deal with the mayor himself and leaps into the air to strike him down. Buggy steps in and tells Cabaji to back off, as the mayor challenged him directly. Boodle's claim that the town is his treasure amuses Buggy, who only views gold and silver as treasure.\nBuggy splits his right arm off and sends it flying towards the mayor, grabbing him by the throat and lifting him off the ground. Trying to get Buggy off him, Boodle strikes at his throat where the hand is holding it. He struggles for air while Buggy gloats that, after this town, he plans on heading out into the Grand Line and stealing all the treasures there. Boodles's efforts amuse him, but Luffy appears in time to save the man and pulls the hand off Boodle's neck.\nBuggy re-attaches his hand as Nami tells Zoro and Luffy to fight, while she grabs the Grand Line map and any treasures she can find nearby. The mayor is displeased about seeing Luffy and the others, as he wanted to fight Buggy on his own. Luffy however renders the mayor unconscious with a punch (much to Nami's shock), in order to make sure he is safe and does not get in the way.\nLuffy then calls out to Buggy, shouting \"Hey, big nose!\" to provoke him. Because of his reputation of overreacting to anything related to his nose, Buggy's crew, Zoro and Nami are all horrified. Buggy then demands that his crew load another Buggy Ball into the cannon, while Zoro and Nami flee for cover. Launching the powerful cannonball towards Luffy, the rubber man blows himself up like a balloon and shoots the cannonball straight back at the Buggy Pirates.\n\n"
}