{
  "chapter_number": "Chapter 45",
  "title": "Before the Storm",
  "short_summary": "Sanji refuses to leave the restaurant to become a pirate. Gin departs to rejoin his crew.\n",
  "long_summary": "Luffy offers his amazement that Gin's meal saved him from death, and asks Sanji to join his crew. After introductions are made, Sanji tells Luffy that Zeff used to be a pirate himself, and the Baratie is the old man's treasure. On top of that, all the other cooks are pirate-types themselves. In a restaurant frequented by pirates, they are perfect for the job, but the waiters could not handle the fighting and quit. Luffy realizes that's why Zeff wanted him to work for a year, and repeats his offer to Sanji. Sanji refuses, and will not say why. Gin, a pirate for Don Krieg, asks what Luffy's plans to do, and Luffy tells him his goal of finding One Piece. Gin warns Luffy to not enter the Grand Line, despite not knowing that much about it himself.\nIn the kitchen, the other cooks warn Patty that his treatment to Gin might attract Don Krieg. What makes Krieg so fearsome is that his 'crew' consists of 5,000 men, divided into fifty crews. Patty is not scared, however, and says that giving the pirate free food would have an adverse effect on the paying customers. The fighting cooks of the Baratie have chased off attacking pirates before, and if they do not like it they can quit. Fellow cook Carne points out that's what he told the waiters. Before the argument could turn physical, Zeff shows up to quell the violence.\nOutside, Luffy and Sanji bid farewell to Gin, who sails off. When Zeff appears to call the boys back to work, Sanji sends the plate he served Gin's meal on overboard, removing any 'proof'.\nIn the kitchen, Luffy declares that he's now Chore-Boy, and after breaking several dishes, is told by Patty to wait on customers. In the dining hall, Luffy is furious to find his crew and Nami relaxing while he's stuck working. Sanji then appears and proclaims his love to Nami, poetically lamenting the 'obstacles' between them. Zeff shows up out of nowhere and says that Sanji can go be a pirate, he's not needed at the Baratie.\nElsewhere, Gin has made it back to the crew he originally belonged to, and tells his boss, Don Krieg, that he can take the crew to the Baratie.\n\n"
}