{
  "chapter_number": "Chapter 9",
  "title": "The Devil Girl",
  "short_summary": "Nami attempts to team up with Luffy. The Buggy Pirates try to find the map she stole, but when they return to Buggy empty-handed, he shoots one with his cannon. Nami takes Luffy into a house and she explains to him the situation and who Buggy is. Luffy asks her if she wants to join his crew; she refuses. Luffy explains to her why his straw hat is a treasure. Nami says that the thing she hates most are pirates. They leave the house and go to search for Buggy, but Nami tricks Luffy, ties him up with a rope, and brings him to Buggy to broker a deal. Zoro arrives at the village.\n",
  "long_summary": "Nami invites Luffy to join her, claiming to be a thief who steals from pirates. Nami asks Luffy what is so important about his hat that made him mad when Buggy's crew touched it, wondering if it had jewels or a treasure map inside.\nOn the roof of a bar, Buggy is dealing with one of his crew members after Nami got away. Buggy mishears him, thinking that he said something about his nose being strange. The man is raised into the air via Buggy's Devil Fruit powers; Buggy orders the rest of the crew to put a cannon to the man and fire. With the man killed by cannon fire, Buggy orders everyone to search the town for the thief and any treasure to be found.\nIn a house elsewhere, Nami asks Luffy about his crew's numbers. After knowing they were only two, she explains to Luffy who Buggy is and why the town is empty, as the populace is sheltering. She warns Luffy that Buggy is fond of using his cannon and that he once destroyed a whole town because a boy made fun of his nose. Nami gets fed up with Luffy's short attention span and tendency to ignore her.\nNami reveals her quest to gather 100,000,000 and buy a village. She begins to talk about the plan she has for the Grand Line map she stole: she will go there and steal from all the famous pirates in that ocean, who she thinks must possess more treasure. Nami confirms she is a navigator and Luffy is excited about her joining in his adventure; however, when he tells her he is a pirate, she changes her mind. Nami reiterates her suspicion about the straw hat Luffy carries, thinking there must be a treasure map inside. Luffy tells her about the symbolic value of the hat, as it was given to him by his friend, to whom he swore he'd create a pirate crew. Nami explains she hates pirates the most, only liking mikan and money. However, as she now knows that Luffy does not have treasure or much intelligence, she suddenly has an idea. She agrees to join him if he comes with her to see Buggy. However, she takes some rope with her and as they approach his hideout, Nami ties Luffy up with it.\nBuggy is telling off his crew who believe they are about to be killed for not being able to find the thief who stole their map. They explain that, in their perception, with the thief, Nami, there was her boss, Luffy, who was the reason they couldn't retrieve the map. Just then Nami and Luffy enter the scene, to Buggy's surprise. Nami hands over Luffy, claiming she had an argument with her boss, and decides to pretend to join Buggy's crew, handing over the map she stole. Luffy is imprisoned in a cage.\nElsewhere, Zoro arrives at the island with the pirates he encountered on the way, who explain that their crew is raiding the village at the moment. Zoro decides to meet Buggy to gather information about Luffy.\n\n"
}