{
  "chapter_number": "Chapter 37",
  "title": "The Pirate \"Kuro of a Hundred Plans\"",
  "short_summary": "Luffy and Kuro begin their fight, and Kuro gains the upper hand at first. As his crewmates start to cheer him on, Kuro berates them. He then remembers when he decided to give up pirating, as the Marines were constantly chasing him. When Kuro had been at the height of his fame, he had faked his own death by making someone else turn himself in as Captain Kuro. Kuro attacks Luffy again, but Luffy breaks his claws on one hand with a rock and tells Kuro about his desire to become the Pirate King.\n",
  "long_summary": "The battle between Kuro and Luffy begins, and Luffy is unable to gain an upper hand against Kuro as he is too quick and agile. After a few punches, Kuro lands on Luffy's arm and heads straight for him. Luffy gets a kick to the face for his efforts and is knocked away. The Black Cat Pirates cheer Captain Kuro on, but Kuro reminds them that they should not be calling him that anymore.\nKuro flashbacks to 3 years ago. On board his ship, where he has summoned Jango. He announced his desire to give up being a pirate and told Jango he could be captain. His crew informed him a Marine ship had been spotted, which Kuro commented was the third time this week. Jango pointed out, that after they defeat the Marines they would become more famous, which Kuro confirmed that Jango is correct on that much so he would stop being Kuro. When Jango laughed since the Marines would chase him to death, Kuro announced he would kill himself.\nOn deck a crew member asked if he should fire the cannons, Kuro stated that he should just lower a small boat and then head towards the Marine ship alone. When all was silent, the crew prepared the cannons, believing Kuro is dead. However upon investigating the ship, they found Kuro had killed all the Marines onboard himself. Kuro started his plan by approaching a Marine who happened to be alive and stepped on his jaw to break it. To Kuro's amazement, the Marine talked back even with a broken jaw. Since the Marine spoke back, Kuro announced he could be the one to take the great Captain Kuro back alive.\nDressing up a member of the crew to look like Kuro, Jango hypnotized the unfortunate crew member into believing he was Kuro. Then the Marine was hypnotized into believing he had captured Kuro. The pair sail away and Kuro smiled as he watched, knowing soon the world would believe Kuro was dead and he could begin the rest of his plan.\nIn the present, Kuro asks Luffy if now he knows what he wants. Kuro once again attacks Luffy, Luffy reacts by shoving a rock in one of Kuro's Cat Claws, then he turns with the rock in his hands and snaps the Claw's blades. Luffy then says to Kuro  he shouldn't have been a pirate to begin with if he didn't want the fame that follows with it. Luffy then goes on about his own plan to become Pirate King.\n\n"
}