{
  "chapter_number": "Chapter 104",
  "title": "Cape Promise",
  "short_summary": "Crocus helps the Straw Hats to exit the whale. He tells them that he is a doctor and that he modified Laboon so that he can treat him from the inside. He also explains the reason why the whale hits his forehead on the Red Line wall. Laboon believes his old crew will return as they had promised. Crocus knows they are most likely dead. He has told the whale already but Laboon does not want to listen. Luffy pulls out the Going Merry's mast and fights with Laboon. Everybody thinks Luffy is out of his mind, but Luffy's actions become clear when he stops the fight and makes a new promise with Laboon; they are both strong and cannot decide the winner yet. Luffy will conquer the Grand Line and come back so that they can finish their fight.\n",
  "long_summary": "The Straw Hats are amazed at the construction that Crocus has done inside Laboon. Crocus reveals that he used to be a doctor and has worked in a clinic and a ship. This prompts Luffy to ask him to join his crew as a doctor, but Crocus refuses, saying that he is too old.\nAfter exiting Laboon, the crew wonders what to do with miss Wednesday and Mr. 9. Crocus tells them to dump them into the ocean, which they do. When Luffy asks who these guys are, they realize that such a pirate crew could be useful to their organization, and decide to leave after warning them to prepare themselves, and threatening Crocus that they will be back for the whale soon.\nAs Luffy begins to wonder where Laboon's crew is located, Sanji tells him that they are most likely dead. Crocus tells them that they did not die but merely abandoned their quest as well as Laboon, fearing the vast dangers of the Grand Line. Usopp ponders about how the promise made to Laboon was so casually forfeited. He then goes on about how he tried to explain the situation to Laboon, but Laboon wouldn't believe any of his words and that's when he began his habit of ramming his head against the red line.\nLuffy, having listened to the story, decides to do something seemingly odd. He breaks the mast right off Going Merry. He then runs on top of Laboon's head and nails him with it. The whale, screaming in pain, immediately retaliates. Laboon crushes his head, with Luffy on it, on the rocks. After a brief fight, Luffy declares the match a tie, which will have to be sorted out in the future. Thus, Luffy made a new promise with Laboon to meet again, after they have sailed around the Grand Line, to settle their fight once and for all. Luffy's move made everyone rejoice and gave Laboon a new reason to keep on living.\n\n"
}