{
  "chapter_number": "Chapter 142",
  "title": "Skull and Sakura",
  "short_summary": "Six years ago, Hiriluk discovered the reindeer he found could talk, and named him Tony Tony Chopper. Meanwhile, Royal Army Commander Dalton expressed concern about the state of the country, recalling his time at the Levely where Wapol's immature actions contrasted with the mature gracefulness of the ten-year-old Nefertari Vivi. Hiriluk wished to cure the people of Drum Island of all their sicknesses, including the ones in their hearts, and Chopper decided to help him despite his wishes. They worked together for a year, but after Chopper was fully healed, Hiriluk forced him back to the wild.\n",
  "long_summary": "Three days after rescuing him, Hiriluk found out the reindeer could talk. He wondered why he had been silent, and the reindeer said that talking would make the doctor hate him, since he was shot the last time he talked. Hiriluk saw no issue with the reindeer talking, and the two of them were forced to evacuate outside when one of Hiriluk's chemical containers exploded. Hiriluk was happy to see that the reindeer was fine after the explosion, and named him Tony Tony Chopper for his strong horns that could bring down a tree. Chopper liked the name.\nAs Wapol rode down the mountain wondering what new laws he would make, Royal Army Commander Dalton met with Chess and Kuromarimo, who noted he was acting weird since coming back from the global conference Levely. Dalton wondered if their kingdom would be the same with a growing inequality between the royals and the people, but Chess and Kuromarimo failed to see an issue. They claimed that Wapol's stricter method of ruling was for the good of the country, but Dalton told them about one girl he had met at the Levely. In Mary Geoise where it was held, King Thalassa Lucas had held up a picture of the Revolutionary Dragon, warning that he would be a great danger to the world in five to six years. Wapol blew him off, failing to see any danger to his kingdom. King Nefertari Cobra of Arabasta reprimanded Wapol for his selfishness, and after the meeting, Wapol struck his young daughter Vivi under the guise of an accidental bump. Igaram became enraged, but Vivi stopped him, claiming responsibility for the altercation. Dalton was greatly impressed with the young princess' poise in such a volatile event, and overheard in shame from around the corner as Vivi cried when alone with Igaram. Back on Drum Island, however, Chess and Kuromarimo thought little of this action, telling Dalton not to mix emotion with policies.\nAs Hiriluk experimented with chemicals, he told Chopper not to hate the people on the island for casting them out, saying they had a sickness in their hearts. He told Chopper about a thief from the far west, who went around looking for a cure for his heart ailment. Doctors could not provide a cure, so he went wandering around until he came to a mountain. There, he saw beautiful cherry blossoms, and a doctor later found that his ailment was completely cured. Hiriluk believed that there was no disease that could not be cured, and declared that he would stand with his Jolly Roger to fight every disease that threatened the people in the country. Chopper was intrigued by the Jolly Roger, and Hiriluk said it was a symbol of faith, encouraging him to some day get out to other parts of the world and see how small his problem really was. Hiriluk told Chopper to get back home to keep recovering while he treated patients, but Chopper wanted to assist him. They overheard that a patient needed medicine from a mushroom, but were promptly chased away after trying to give him lizard eyes. Hiriluk and Chopper were run off by everyone they tried to help, and one time the former kicked the latter into the mob to serve as a decoy. After almost dying, Chopper returned to Hiriluk's base. He was angry at the doctor, but Hiriluk insisted that Chopper should have never followed him on his missions. However, he gave Chopper a pink top hat as an apology, which caused the reindeer to tear up. Hiriluk and Chopper did everything together for a year, until Chopper was finally cured. Hiriluk had no intention of taking care of him, and Chopper pleaded to stay with the doctor, but Hiriluk shot at him and told him to never come back again. As Chopper ran off, Hiriluk sobbed and hoped the reindeer would forgive him.\n\n"
}