{
  "chapter_number": "Chapter 148",
  "title": "Unbreakable",
  "short_summary": "Usopp sees Dalton's determination and volunteers to carry him to the castle. However, Zoro interrupts and takes Dalton off his back due to Usopp being too weak. The villagers inform them of a ropeway to the castle and claim they can fix it in 30 minutes.\n",
  "long_summary": "In his determination, Usopp tries to carry Dalton up to the castle, even though Dalton says that he will not be able to. Usopp states that he can do it, and that since Dalton wants to fight for his country, he will not let him down. Zoro, however, merely picks up Dalton and easily starts to carry him, much to Usopp's chagrin. Usopp is frustrated that Zoro is stealing the glory, but the villagers state that it will take them 30 minutes to fix up a rope for a lift up the mountain, which would be faster. One of the villagers states that there are no ropes left to use, but another one states that they found a white rope tied to a tree near Gyasta, which was near where Dr. Kureha last visited.\nOn top of the mountain, Wapol wonders about the true meaning of the pirate flag and states that it is a stupid decoration for pirates. Luffy insults him, saying that the flag is not something that you can underestimate. Wapol becomes infuriated and states that since he is the king, he does not have to bow down to a flag, and moves to destroy the flag along with Luffy. Wapol fires a cannonball at the flag, but Luffy takes the hit, stating that the flag is a symbol of faith and that it will never be broken. Chessmarimo is amazed, and Luffy states that although he does not know who the flag belongs to, it is a symbol of life that no one should play around with its usage.\nLuffy yells that people like Wapol have no right to destroy the flag and laughs about it, making Chopper remember Dr. Hiriluk's description of pirates being great. Luffy tells Chopper that he is going to beat up Wapol and his troops, and asks Chopper what he is going to do. Wapol yells that if they want to protect the flag, they will both die together with it, prompting Sanji to rush towards Wapol. However, Dr. Kureha states that Sanji's spine is dislocated and knocks him to the ground, preventing him from fighting. Wapol laughs, saying he will destroy them all, but has to have Chessmarimo block a blow from an infuriated Chopper. Luffy tells Chopper to beat them up, and plants the flag in the top of the tower as Sanji lays injured in the snow.\nBack on the ground, Chessmarimo states that Chopper will not be allowed to lay a finger on Wapol, stating that Chopper is a strange creature who was rumored to be a snow monster. He continues, saying that Chopper has no friends and is still defending the kingdom, but Chopper states that as long as Hiriluk's flag is there, then he will still fight. Luffy then shoots down from the mountain, saying that he is Chopper's friend, and tells Chopper to take care of Chessmarimo while Luffy fights Wapol. Chopper states that he is not confused anymore, while Dr. Kureha prevents Sanji from getting up, saying that even she cannot stop Chopper when he is serious. Chopper, meanwhile states that his name was given to him by the greatest doctor in the world, and that while Hiriluk forgave them, he will not let them pass for laughing at Hiriluk's death. Chessmarimo states that they will not forgive Chopper, who unveils a small, black Rumble Ball.\n\n"
}