{
  "chapter_number": "Chapter 4",
  "title": "Marine Captain \"Axe-Hand Morgan\"",
  "short_summary": "Luffy again goes to see Zoro to invite him to his crew, and Zoro refuses. Luffy decides that if he gets Zoro's swords back from Helmeppo, then he can make Zoro join before he gives them back, so he rushes off to retrieve them. Meanwhile, Morgan, the captain of the Marine base, is having his men lift a giant statue of himself, which Luffy inadvertently destroys while trying to get the swords back. Morgan, infuriated, orders his men to capture Luffy so that he can kill him.\n",
  "long_summary": "Helmeppo is angry at Luffy for hitting him. Koby can barely hold Luffy back and the townsfolk are in awe at Luffy's actions. Helmeppo is dragged away by two Marines, claiming Luffy will die for hitting him. Rika is pulled away by Ririka, her mother, but Rika defends Luffy and Zoro as good men. Luffy tells Koby he is going to speak to Zoro again.\nBack at the Marine base, one of the Marines reports to Morgan that the amount of offering from the townsfolk is decreasing. Morgan is unable to accept that they are poor, seeing it as a sign that the townsfolk are disrespecting him. Just then, Helmeppo bursts in and tells his father that he wants someone killed.\nLuffy arrives to talk to Zoro about him joining his crew. He makes a deal with Zoro without his consent that if he gets him his swords, he must join his crew.\nOn the roof, a statue of Morgan is being raised. Helmeppo is still demanding that Morgan kill Luffy; however, he is hit for giving Morgan an order. Morgan mentions that he heard a little girl snuck into the base earlier. He orders Lieutenant Junior Grade Rokkaku to go find and kill her for disrespecting him. When the Marine refuses, he is hit. Morgan then claims he will do it himself, and gives the order to raise the statue.\nOn ground level, while Luffy is trying to find a Marine to get Zoro's swords, he hears someone on the roof. On the roof, Seaman Recruit Ukkari knocks the statue against part of the building on the roof. Luffy launches himself up onto the roof via \"Gomu Gomu no Rocket\". As the Marine is about to be punished for knocking the statue, Luffy flies by, grabbing some of the ropes on the statue because he has taken off into the air too fast. To the horror of everyone there, the statue breaks.\nMorgan suddenly bursts out Luffy's death sentence and Helmeppo points out that Luffy was the one he wanted his father to kill in the first place. Then Luffy drags Helmeppo into the base building to find Zoro's swords, while one of the Marines spots Koby untying Zoro. Morgan becomes paranoid because he thinks the townsfolk are turning on him. Koby reveals to Zoro his desire to become a Marine who is just, as well as Luffy's dream of becoming Pirate King. While Zoro shows surprise for Luffy's ambition, Koby is suddenly shot. This causes Zoro to threateningly glance at the roof of the Marine base.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Morgan",
    "Rokkaku",
    "Ukkari",
    "Helmeppo",
    "Rika",
    "Ririka",
    "Koby",
    "Roronoa Zoro"
  ],
  "ssum_frequencies": [
    [
      "to",
      6
    ],
    [
      "he",
      5
    ],
    [
      "luffy",
      4
    ],
    [
      "zoro",
      3
    ],
    [
      "his",
      3
    ],
    [
      "back",
      3
    ],
    [
      "the",
      3
    ],
    [
      "him",
      2
    ],
    [
      "that",
      2
    ],
    [
      "swords",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      31
    ],
    [
      "to",
      17
    ],
    [
      "is",
      14
    ],
    [
      "he",
      14
    ],
    [
      "luffy",
      12
    ],
    [
      "of",
      9
    ],
    [
      "morgan",
      9
    ],
    [
      "zoro",
      8
    ],
    [
      "that",
      8
    ],
    [
      "him",
      7
    ],
    [
      "his",
      7
    ],
    [
      "on",
      7
    ],
    [
      "helmeppo",
      6
    ],
    [
      "for",
      6
    ],
    [
      "and",
      6
    ],
    [
      "marine",
      6
    ],
    [
      "a",
      6
    ],
    [
      "roof",
      6
    ],
    [
      "statue",
      6
    ],
    [
      "koby",
      5
    ]
  ]
}