{
  "chapter_number": "Chapter 48",
  "title": "Leave That Path Alone",
  "short_summary": "Don Krieg is surprised to learn that Zeff is alive. Knowing that Zeff is an infamous former pirate who journeyed to the Grand Line and returned safely, Don Krieg inquires about the journal Zeff maintained while traveling. When Zeff refuses to hand over the journal, Don Krieg announces his intention to steal the journal along with the ship. The Baratie chefs shout that they are ready to protect their restaurant, while Luffy challenges Don Krieg to a fight, exclaiming that he will become the Pirate King. Angered, Don Krieg takes the food back to his subordinates and gives the Baratie chefs and the Straw Hats an ultimatum: either surrender the ship along with Zeff's journal or be killed by him when he returns. After Don Krieg leaves, Gin reveals that Hawk-Eye is responsible for decimating Krieg's fleet. Upon hearing this, Zoro shows a shocked expression.\n",
  "long_summary": "Don Krieg is surprised to learn that Zeff is alive. Zeff replies nonchalantly to Don Krieg that it has nothing to do with him, whether he is dead or alive, and that he is living as a cook now. Krieg is amused and comments that, from his point of view, Zeff is not living as a chef by choice, but because it is the only thing he can do. Zeff is angered but does not say a word.\nKrieg then proceeds to tell the story of Red Leg Zeff, a once-infamous pirate who refused to use his hands in battle as he was a master of kicking. His destructive kicks could pulverize bedrock and leave a clear imprint on steel. He was both the chef and captain of his own crew, and he obtained his epithet, Red Leg, from his legs being dyed in the blood of his enemies after a fight. According to rumors, Zeff was supposed to have died in a shipwreck. Krieg deduces that Zeff only managed to survive the shipwreck by sacrificing his leg. Therefore, Krieg concludes that Zeff is unable to fight anymore, forcing him to retire as a pirate and become the chef of the Baratie. Sanji is visibly shocked upon hearing the story, but Zeff acts indifferent, saying that he still has his hands, which allows him to cook.\nZeff questions what Krieg is getting at, and Krieg replies that since Zeff once traveled to the Grand Line and returned safely, he must have a log of this journey and that he wants it for his future journeys. Luffy shows excitement upon hearing about the chef's expedition to the Grand Line. Confidently, Zeff confirms that he does indeed have a log but refuses to hand it over since he sees it as a memento of his former life.\nFrustrated, Krieg declares that he will then have to take Zeff's log by force. Krieg acknowledges that he came back from the Grand Line defeated, but claims this is only due to a lack of information. Upon stating this, Krieg again declares that he will steal Zeff's log, along with the Baratie. This angers the Baratie chefs, and they declare that they will not let Krieg take their home from them. The chefs advance towards Krieg but get pushed back by his attacks. Krieg laughs and claims that once he gets Zeff's log, he will reassemble his pirate fleet and then find The One Piece in order to become the greatest pirate of the era. This causes Luffy to stand up and challenge Krieg, worrying the Baratie chefs. Luffy states that he will become the Pirate King. Zoro, sitting next to Usopp at a table, casually asks Luffy if he needs a hand. Luffy says that there is no need, as he can handle it himself. Krieg laughs at Luffy's small crew and tells Luffy to stop messing around. Krieg tells Luffy that even with his fleet of 50 ships carrying a crew of over 5,000 people, they were wiped out in a week, which Krieg still claims is due to a lack of information. This intrigues Zoro but terrifies Usopp.\nAs Krieg demands food for his crewmates, the Baratie chefs clearly deny him. Weakened by the past experience and struggle, Zeff hands over the food for Krieg's crew. Krieg then leaves the restaurant to feed his starving crew and gives everyone an ultimatum: either hand over Zeff's log and the Baratie ship, or they will all die. Claiming ignorance, Gin apologizes to Sanji, but Zeff dismisses the need for an apology. The Baratie chefs accuse Zeff of siding with Sanji, the man they insist is trying to destroy the restaurant. The head chef silences them, justifying Sanji's actions by asking if any member of the staff has ever experienced starvation. After the situation is controlled, the ultimatum leaves the chefs in a dilemma: either fight or run away. They end up deciding to protect the Baratie, as it is the only place where they all feel accepted. Meanwhile, Gin tries to discourage opposition. Sanji explains to Gin that, even if he feeds anyone who is starving, the enemies of the Baratie are already fed, so he will not hesitate.\nLuffy sits next to Usopp and Zoro and asks if his crewmates also approve of Sanji, but Usopp is exclusively terrified about the imminent attack. After Luffy asks Gin about his knowledge of the Grand Line, Gin tells them of the fierceness of the ocean, especially after the crew was almost annihilated by just one man. This revelation causes a commotion in the restaurant. Furthermore, when Gin discloses that the one responsible for his crew's demise is Dracule Mihawk, Zoro appears alarmed.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Usopp",
    "Krieg",
    "Gin",
    "Buggy (cover)",
    "Zeff",
    "Sanji",
    "Patty",
    "Carne",
    "Gaimon (cover)",
    "Cocox (cover)",
    "Usagihebi (cover)",
    "Lionbuta (cover)",
    "Kirinkodanuki (cover)"
  ],
  "ssum_frequencies": [
    [
      "the",
      11
    ],
    [
      "to",
      7
    ],
    [
      "don",
      6
    ],
    [
      "krieg",
      6
    ],
    [
      "that",
      5
    ],
    [
      "is",
      4
    ],
    [
      "zeff",
      4
    ],
    [
      "journal",
      4
    ],
    [
      "and",
      3
    ],
    [
      "an",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      45
    ],
    [
      "to",
      28
    ],
    [
      "he",
      21
    ],
    [
      "krieg",
      20
    ],
    [
      "is",
      20
    ],
    [
      "that",
      20
    ],
    [
      "a",
      20
    ],
    [
      "of",
      20
    ],
    [
      "and",
      19
    ],
    [
      "his",
      19
    ],
    [
      "zeff",
      15
    ],
    [
      "but",
      9
    ],
    [
      "baratie",
      9
    ],
    [
      "luffy",
      9
    ],
    [
      "as",
      8
    ],
    [
      "it",
      7
    ],
    [
      "by",
      7
    ],
    [
      "in",
      7
    ],
    [
      "this",
      7
    ],
    [
      "chefs",
      7
    ]
  ]
}