{
  "chapter_number": "Chapter 62",
  "title": "MH5",
  "short_summary": "Don Krieg is disappointed with Gin's decision to disobey him and refuse to kill Sanji. He decides to kill Gin, his own commander, through his poison gas MH5. Luffy and Sanji attempt to convince Gin that his captain is not worth his life. However, Gin accept his fate as a failure. He has betrayed his captain and feels he deserves to die. When Don Krieg launches the poison bomb, Luffy steals two masks and tosses them to Sanji and Gin. When he realizes that there is none for him left, one is miraculously landing next to him.\n",
  "long_summary": "Don Krieg is disappointed with Gin because he disobeys his order to kill Sanji. Before that, Gin was the person he trusted the most. Krieg sees excess in Gin's personality that will win in the battlefield. Gin says he will always respect and admire Krieg. However, he cannot kill Sanji and requests to let the Baratie go free. Krieg becomes angered at Gin's gall. The Krieg Pirates remain confused about what happened to Gin.\nKrieg prepares to shoot his MH5 bomb. All of Krieg's crew pull out their masks to survive. Krieg demotes Gin and asks him to throw away his mask. The Don Krieg Pirates cannot believe that Krieg would kill Gin. Gin was very loyal, such as when the crew hazed from Fullbody, Gin went alone to the ships of the Marine and masqueraded as captain. Gin always sacrificed himself to save Krieg and he did anything to win, that's why people called him \"Demon\".\nMeanwhile, Luffy attempts to stop Krieg, but fails. Luffy takes back his step and announces he will save Gin from Krieg. But Gin still believes in Krieg as his commander and throws away his mask as he was commanded. Krieg shoots the MH5. The Baratie cooks escape by diving underwater and Krieg's crew uses their masks to protect themselves from the poison gas.\nThinking quick, Luffy takes two masks away from some of Krieg's pirates. He gives the masks to Sanji and Gin. When Luffy wants to take a mask for himself, no masks remain. Suddenly, he spots a mask as the MH5 activates and places it on his face. After 5 minutes, the gas dissipates and Gin is revealed to have not worn his mask. Luffy realizes that Gin selflessly gave him his mask.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Richie (cover)",
    "Krieg",
    "Gin",
    "Zeff",
    "Sanji",
    "Patty",
    "Carne",
    "Kumate Tribe (cover)"
  ],
  "ssum_frequencies": [
    [
      "to",
      7
    ],
    [
      "his",
      6
    ],
    [
      "and",
      5
    ],
    [
      "is",
      4
    ],
    [
      "he",
      4
    ],
    [
      "gin",
      4
    ],
    [
      "him",
      3
    ],
    [
      "sanji",
      3
    ],
    [
      "don",
      2
    ],
    [
      "krieg",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      15
    ],
    [
      "krieg",
      14
    ],
    [
      "gin",
      14
    ],
    [
      "to",
      14
    ],
    [
      "and",
      11
    ],
    [
      "he",
      9
    ],
    [
      "his",
      9
    ],
    [
      "mask",
      6
    ],
    [
      "masks",
      5
    ],
    [
      "as",
      5
    ],
    [
      "luffy",
      5
    ],
    [
      "that",
      4
    ],
    [
      "from",
      4
    ],
    [
      "kill",
      3
    ],
    [
      "sanji",
      3
    ],
    [
      "was",
      3
    ],
    [
      "in",
      3
    ],
    [
      "will",
      3
    ],
    [
      "pirates",
      3
    ],
    [
      "mh5",
      3
    ]
  ]
}