{
  "chapter_number": "Chapter 130",
  "title": "Maximum Speed",
  "short_summary": "Nami suffers from a strong fever. The Straw Hats grown concerned as they have no doctor on-board besides Nami.\n",
  "long_summary": "Sanji continues to worry about Nami's health, while Vivi believes she has come down with a climate sickness. Vivi then asks if their is anyone on board with any medical knowledge and the crew points to Nami. Luffy suggests that some meat might make her better, but Sanji tells him that although a nutritious meal would do her some good it will not heal her of her sickness. Sanji then goes on to explain that he puts in more work into preparing Nami's food then any of the men, which does not bother Luffy as the meals are still excellent.\nVivi comments that Nami's fever has risen again to 40 degrees Celsius (104 Fahrenheit). Usopp suggests that they find a doctor for her in Arabasta. Vivi points out that it will take another week to get there. Luffy asks what it is like being sick, which none of the crew members know the answer as they have never become sick before. Vivi is shocked at this and lets them know that a 40 degree fever is very painful and that Nami could die. Everyone is shocked and immediately begins to panic and run around the room.\nNami then wakes up and tells Vivi about a newspaper. Vivi reads about the ongoing situation in Arabasta and how it does not look good. Nami then tells the crew that she is fine and goes to navigate the ship, which has been neglected as Zoro was in charge of navigation. She tells him he can't navigate by following a cloud and urges them to head portside, to the south.\nLuffy then checks Nami's temperature with his hand and is burnt, but Nami once again brushes off his concern. Vivi then asks that the ship get to Arabasta as fast as possible—and that the fastest way possible is to get Nami medical treatment first.\nA cyclone then suddenly forms right in the path they had avoided by Nami's instinct. Vivi is impressed with her ability to feel the weather.\nA day later Zoro spots a man walking a top of the water.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Jango (cover)",
    "Piiman (cover)",
    "Ninjin (cover)",
    "Tamanegi (cover)",
    "Nefertari Vivi",
    "Karoo",
    "Crocodile (shadowed)"
  ],
  "ssum_frequencies": [
    [
      "nami",
      2
    ],
    [
      "suffers",
      1
    ],
    [
      "from",
      1
    ],
    [
      "a",
      1
    ],
    [
      "strong",
      1
    ],
    [
      "fever",
      1
    ],
    [
      "the",
      1
    ],
    [
      "straw",
      1
    ],
    [
      "hats",
      1
    ],
    [
      "grown",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      15
    ],
    [
      "to",
      12
    ],
    [
      "that",
      11
    ],
    [
      "a",
      10
    ],
    [
      "and",
      10
    ],
    [
      "vivi",
      9
    ],
    [
      "is",
      9
    ],
    [
      "then",
      8
    ],
    [
      "nami",
      6
    ],
    [
      "her",
      6
    ],
    [
      "namis",
      5
    ],
    [
      "of",
      5
    ],
    [
      "in",
      5
    ],
    [
      "as",
      5
    ],
    [
      "with",
      4
    ],
    [
      "luffy",
      4
    ],
    [
      "tells",
      4
    ],
    [
      "it",
      4
    ],
    [
      "sanji",
      3
    ],
    [
      "about",
      3
    ]
  ]
}