{
  "chapter_number": "Chapter 119",
  "title": "Makeshift",
  "short_summary": "Dorry goes to resume his fight with Brogy despite his injuries. Mr. 3, Miss Goldenweek, and Mr. 5 set in motion their plan to kill Dorry and lure the Straw Hats into a trap, and Zoro and Nami are caught by duplicates of their crewmates. Vivi correctly deduces that Baroque Works agents have come after them, and Mr. 3 interferes in Dorry and Brogy's fight, giving Brogy an opportunity to finish Dorry off.\n",
  "long_summary": "Usopp encourages Brogy as he heads to fight Dorry again, and Nami decides to go back to the ship to meet back up with everyone. Usopp says he is unable to fight off all the dinosaurs on the way back, but promises to one day become a proud warrior of the seas, and Nami decides to instead go and see Luffy at Dorry's campsite. Meanwhile, Dorry puts the entire mountain on top of Luffy, preventing the pirate from stopping him from fighting. He states that he cannot avoid this fight no matter how injured he is, as his god wills it. Luffy is unable to understand being willing to die for a god in an unfair fight, but Dorry says that Luffy does not understand the highest honor of Elbaf. Dorry and Brogy then confront each other, and Vivi is surprised by how invested Luffy is in Dorry's safety despite only having just met the giant.\nMeanwhile, Mr. 3, Miss Goldenweek, and Mr. 5 conspire against their enemies. With the Straw Hats in chaos due to the exploding rum, the Baroque Works agents prepare to take out Dorry first, before luring the Straw Hats into a trap. Mr. 3 has pictures of Luffy, Zoro, Nami, and Vivi. Zoro is lost after hunting a triceratops when he thinks he sees Nami leaning against a nearby tree. However, the figure that looks like Nami does not make a sound, and smirks. The real Nami is running away from a dinosaur with Usopp, and she sees a duplicate of Luffy leaning on a tree. She goes up to it, and screams after seeing what it really is. Usopp hears her screams, and panics due to being unable to see her. He runs out of the woods to Luffy and Vivi, saying that Nami was eaten by the dinosaur. He admits that he did not look to check due to his fear of the dinosaurs, and Vivi wonders if Baroque Works sent someone here after them. She and Luffy suspect that they may have rigged the rum, and Usopp is aghast when he finds out about Dorry's injury. Dorry is currently only at a slight disadvantage as he fights Brogy, but Mr. 3 decides to interfere. He creates a slippery white substance under Dorry's foot that causes him to slip, leaving him open for Brogy to hit him.\n\n"
}