{
  "chapter_number": "Chapter 170",
  "title": "It Begins",
  "short_summary": "After defeating the Baroque Works Billions, Pell tries to save Vivi who is attacked by Miss All Sunday. But he is no match against her Hana Hana no Mi powers. After defeating the Guard captain, Miss All Sunday forces the Arabasta princess to come with her at Crocodile's hideout.\n",
  "long_summary": "Miss All Sunday confronts Vivi and Pell, and is promptly attacked by Vivi for killing Igaram but to no avail. Miss All Sunday then \"impales\" Vivi with her hand, which enrages Pell and he attacks but it is no use against Miss All Sunday's devil fruit ability. She then explains that she ate the Hana Hana no Mi a devil fruit which grants her the ability to sprout limbs, she then says that she has no more time to waste on him which angers Pell and he attacks but it is useless and he goes down easily. When Vivi arrives at Crocodile's lair she attacks him but due to his devil fruit ability granted to him by the Suna Suna no Mi the attack goes right through him. He then remarks it is time for the plan to begin, which Miss All Sunday confirms as it is past seven o'clock.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Jango (cover)",
    "Smoker",
    "Fullbody (cover)",
    "Nefertari Vivi",
    "Pell",
    "Crocodile",
    "Miss All Sunday"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "after",
      2
    ],
    [
      "defeating",
      2
    ],
    [
      "to",
      2
    ],
    [
      "is",
      2
    ],
    [
      "miss",
      2
    ],
    [
      "all",
      2
    ],
    [
      "sunday",
      2
    ],
    [
      "no",
      2
    ],
    [
      "her",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      6
    ],
    [
      "and",
      5
    ],
    [
      "is",
      5
    ],
    [
      "no",
      5
    ],
    [
      "she",
      5
    ],
    [
      "the",
      5
    ],
    [
      "miss",
      4
    ],
    [
      "all",
      4
    ],
    [
      "vivi",
      4
    ],
    [
      "but",
      4
    ],
    [
      "then",
      4
    ],
    [
      "which",
      4
    ],
    [
      "he",
      4
    ],
    [
      "it",
      4
    ],
    [
      "him",
      4
    ],
    [
      "sunday",
      3
    ],
    [
      "pell",
      3
    ],
    [
      "attacks",
      3
    ],
    [
      "devil",
      3
    ],
    [
      "fruit",
      3
    ]
  ]
}