{
  "chapter_number": "Chapter 92",
  "title": "Happiness",
  "short_summary": "Luffy manages to successfully counter Arlong's attacks and pummels the fish-man, but Arlong only enters an enraged state and attacks with his sword Kiribachi. Luffy and Arlong's fight takes them into the cartography room inside the main building, and Luffy becomes enraged when Arlong talks about using Nami for his personal gain.\n",
  "long_summary": "Luffy goads Arlong to come out of the pool despite the beatings the fish-man gave him, and Arlong laughs at Luffy's tenacity, wondering if Luffy realized that running away is futile. Usopp yells at Luffy to hide, saying that he'll die if Arlong lands a direct hit on him. However, Luffy makes a shield by horizontally stretching the fingers of his left hand, and Johnny and Yosaku wonder what Luffy is thinking with that. Arlong goes twice as fast as last time as he swims toward Luffy, aiming to skewer his heart, and he sends Luffy flying as he hits him directly, to Johnny and Yosaku's horror. However, Luffy barely manages to stop Arlong's nose from striking him by using his finger shield to block the fish-man's face, and bounces away from Arlong onto the wall of the main building. Luffy tells Arlong that that attack won't work on him anymore, however Arlong catches Luffy by surprise as he jumps up from the collision site (although Luffy just says he got lucky), and leaps at the Straw Hat again in midair. Luffy responds by stretching his fingers to form a net, which catches Arlong, and Luffy then stomps Arlong's chest and sends him crashing into the ground below.\nThe onlookers rejoice, and Luffy wonders if Arlong is dead, but Arlong's eyes quickly reopen and they are now intense and wild looking. Genzo and Nojiko are unnerved by the sight, and even Nami says that she has never seen his eyes like that before. Sanji notes that they are the same eyes a Sea King has when it goes berserk, and that Luffy's attack just enraged him. Arlong grabs Luffy by the head and slams him into the foot of the building before charging at him. Luffy barely manages to jump over Arlong's punch, but as Arlong punches through the wall of the building, he grabs a giant Zanbato named Kiribachi and pulls it out. Arlong swings Kiribachi at Luffy, and Luffy dodges, but the sword plants itself into the building and allows Arlong to flip and pursue Luffy up the main building. Arlong manages to corner Luffy on an upper level, and Luffy leaps into a window as the fish-man attacks.\nArlong climbs into the room, and Luffy wonders what all the papers around him are. Arlong replies that these are maps that Nami has spent the last eight years drawing, and he praises Nami's ability, but Luffy notes that the pen on Nami's desk is encrusted in blood. Arlong holds Luffy's head between two of Kiribachi's blades as he says that there is no greater happiness for Nami than to make maps for the fish-men to use to conquer the world, and asks Luffy if he could use her any more effectively. In response, Luffy grabs onto one of Kiribachi's blades, rendering Arlong unable to move his sword. Luffy shatters the tooth-like blade with his bare hand, growing angry about Arlong using Nami like a tool.\n\n"
}