{
  "chapter_number": "Chapter 152",
  "title": "Full Moon",
  "short_summary": "Luffy is thanked by Dalton for defeating Wapol and saving their country. Luffy persuades Chopper to join the Straw Hats and succeeds in making Chopper a part of the crew.\n",
  "long_summary": "Thanks to the lift, everybody is able to join the castle. Understanding the situation, Dalton thanks Luffy for helping his country. Dr. Kureha asks that the wounded people are put into the castle, including Nami and Sanji who are desperately trying to hide from her.\nUsopp, when he sees Chopper. He calls out loud that he is a monster and Chopper flees from the persecution he is used to from being different. Luffy becomes angry since he wanted to present him as the new crew member. Luffy tries to run after him and the poor reindeer becomes even more afraid.\nIn the castle, Kureha has taken care of Dalton, Sanji and Nami. She asks the guard chief if he knows where the key is to the weapon room. Nami, who stole the key from Wapol previously, understands that she can make profit of this key and gives it to the doctor. As a reward, she will not have to pay for the treatment and Kureha will not oppose to their departure.\nWhen the night comes, Luffy is still looking for Chopper, as to ask him to join the crew. When Chopper says that he would like to but he cannot because he is a monster, Luffy yells at him they do not care.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Tony Tony Chopper",
    "Dalton",
    "Kureha",
    "Nefertari Vivi",
    "Karoo (cover)"
  ],
  "ssum_frequencies": [
    [
      "luffy",
      2
    ],
    [
      "and",
      2
    ],
    [
      "chopper",
      2
    ],
    [
      "the",
      2
    ],
    [
      "is",
      1
    ],
    [
      "thanked",
      1
    ],
    [
      "by",
      1
    ],
    [
      "dalton",
      1
    ],
    [
      "for",
      1
    ],
    [
      "defeating",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      17
    ],
    [
      "to",
      13
    ],
    [
      "he",
      9
    ],
    [
      "is",
      6
    ],
    [
      "and",
      6
    ],
    [
      "luffy",
      5
    ],
    [
      "that",
      4
    ],
    [
      "from",
      4
    ],
    [
      "chopper",
      4
    ],
    [
      "him",
      4
    ],
    [
      "castle",
      3
    ],
    [
      "for",
      3
    ],
    [
      "kureha",
      3
    ],
    [
      "nami",
      3
    ],
    [
      "when",
      3
    ],
    [
      "a",
      3
    ],
    [
      "as",
      3
    ],
    [
      "she",
      3
    ],
    [
      "key",
      3
    ],
    [
      "not",
      3
    ]
  ]
}