{
  "chapter_number": "Chapter 173",
  "title": "Bananawani",
  "short_summary": "The fighting will begin in 8 hours, while Crocodile leaves and puts the key to the cage in the Banadile feeding area, and one of them eats it, Crocodile then leaves with the warning that the room will flood in an hour. Luffy then asks that Vivi free them so that he may defeat Crocodile, and as Crocodile and Miss All Sunday leave they receive a phone call from a mysterious stranger.\n",
  "long_summary": "Before leaving, Crocodile explains to Vivi about the solutions she has got: either she tries to reach the rebels which is impossible in the time that remains now or she tries to save her friends which is also very hard because he threw the key of the cell into the Bananawani pool where one of them ate it. Moreover the building will self destruct in a short time. To make her despair even more, he reveals that he was the responsible of the sandstorm that came one after the others to Yuba oasis and mocks Toto's stupidity. This angers Luffy, causing him to beg Vivi to help them so that he can beat Crocodile. However, the destruction mechanism made the water level in the Bananawani's pool increase. The Bananawani come out of the pool one after the other and start to hunt Vivi who barely escapes these powerful animals.\nMeanwhile Crocodile receives a phone call, from the Den Den Mushi he uses to contact the Billions. The voice and the speech of the person speaking reminds him of a certain previous conversation.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji (voice only)",
    "Smoker",
    "Nefertari Vivi",
    "Toto (flashback)",
    "Crocodile",
    "Miss All Sunday"
  ],
  "ssum_frequencies": [
    [
      "the",
      6
    ],
    [
      "crocodile",
      4
    ],
    [
      "and",
      4
    ],
    [
      "in",
      3
    ],
    [
      "that",
      3
    ],
    [
      "will",
      2
    ],
    [
      "leaves",
      2
    ],
    [
      "them",
      2
    ],
    [
      "then",
      2
    ],
    [
      "a",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      21
    ],
    [
      "to",
      9
    ],
    [
      "of",
      6
    ],
    [
      "he",
      5
    ],
    [
      "that",
      4
    ],
    [
      "crocodile",
      3
    ],
    [
      "vivi",
      3
    ],
    [
      "she",
      3
    ],
    [
      "in",
      3
    ],
    [
      "pool",
      3
    ],
    [
      "one",
      3
    ],
    [
      "a",
      3
    ],
    [
      "and",
      3
    ],
    [
      "tries",
      2
    ],
    [
      "which",
      2
    ],
    [
      "is",
      2
    ],
    [
      "time",
      2
    ],
    [
      "her",
      2
    ],
    [
      "bananawani",
      2
    ],
    [
      "them",
      2
    ]
  ]
}