{
  "chapter_number": "Chapter 47",
  "title": "Pirate Fleet Admiral \"Don Krieg\"",
  "short_summary": "As the Baratie's regular customers flee, Don Krieg claims the restaurant ship, pretending his own is messed up. He then asks for the chefs to feed his crew who are currently starving. As he did previously for Gin and Krieg, Sanji agrees to his request for food, but the other chefs see that as a betrayal. Patty knocks Sanji down, and tries to attack Krieg by launching a canon bullet. When the smoke clears, Krieg is revealed to have been wearing armor underneath his clothes. Undaunted, the chefs try to rush Krieg only be forced back by the gun barrels on Krieg's armor. Krieg threatens the chefs to obey him when Zeff arrives with a pack of food sufficient for 100 men. Then he reveals the reason for the pirates pitiful state - they are survivors from the Grand Line. Krieg on the other hand is shocked, that Red Leg Zeff is still alive.\n",
  "long_summary": "The chefs of the Baratie begin to flee, believing there to be no hope for survival. Gin begs for Krieg to stop what he is doing, because Krieg had promised him earlier that he would not hurt anybody at the restaurant. Krieg elaborates on his statement, saying he needs the new ship because his old one is worn out. He begins to tell them about his crew and how they are all starving or critically wounded. He demands that the chefs make his crew food at once, but the chefs refuse. Krieg gets mad, but suddenly, Sanji stands up and begins to head to the kitchen.\nThe chefs of the Baratie pull out their guns and point them at Sanji, telling him they will not let him make food for any more pirates. Sanji explains that he must do it because it is his duty as a chef. Patty takes matters into his own hands and knocks Sanji down and tells him he cannot allow him to become involved in the matter. Patty then pulls out his meatball cannon and fires it at Krieg. The chefs believe him to be defeated, but Krieg gets back up and shoots all the chefs with his pricks.\nKrieg states that he is the strongest and that those who defy him must die. He begins to brag about his suit of armor, weapons, and battle experience. He demands they follow his orders due to his extensive and violent past. Suddenly, Zeff appears with a bag of food and hands it to Krieg. The chefs begin to complain, but Zeff then explains that the Krieg Pirates are nothing more than defeated warriors of the grand line. The chefs are shocked to hear this, and Krieg realizes who Zeff really is; Red-Leg Zeff.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Krieg",
    "Gin",
    "Buggy (cover)",
    "Zeff",
    "Sanji",
    "Patty",
    "Carne",
    "Gaimon (cover)",
    "Cocox (cover)",
    "Usagihebi (cover)",
    "Lionbuta (cover)",
    "Kirinkodanuki (cover)"
  ],
  "ssum_frequencies": [
    [
      "the",
      12
    ],
    [
      "krieg",
      7
    ],
    [
      "to",
      6
    ],
    [
      "for",
      5
    ],
    [
      "his",
      4
    ],
    [
      "is",
      4
    ],
    [
      "chefs",
      4
    ],
    [
      "as",
      3
    ],
    [
      "he",
      3
    ],
    [
      "a",
      3
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      17
    ],
    [
      "to",
      13
    ],
    [
      "and",
      12
    ],
    [
      "his",
      11
    ],
    [
      "krieg",
      10
    ],
    [
      "he",
      10
    ],
    [
      "chefs",
      8
    ],
    [
      "him",
      7
    ],
    [
      "that",
      6
    ],
    [
      "of",
      5
    ],
    [
      "is",
      5
    ],
    [
      "at",
      4
    ],
    [
      "but",
      4
    ],
    [
      "sanji",
      4
    ],
    [
      "it",
      4
    ],
    [
      "zeff",
      4
    ],
    [
      "for",
      3
    ],
    [
      "because",
      3
    ],
    [
      "out",
      3
    ],
    [
      "begins",
      3
    ]
  ]
}