{
  "chapter_number": "Chapter 56",
  "title": "I Refuse",
  "short_summary": "Sanji decides to sacrifice himself in order to save Zeff. While doing that, Sanji remembers 9 years ago when he first met Zeff.\n",
  "long_summary": "Taking Zeff hostage, Gin asks Sanji to leave the ship. Sanji refuses and tells him to go to hell. What might appear as a very egotistical reaction on Sanji's part, turns out to be a gesture of sacrifice. Indeed, Sanji asks Gin to point the gun at him instead of the owner, and when the newly conscious Pearl attacks him, he does not avoid or counter him anymore. Luffy gets ready to punch Pearl, but Sanji yells at him to stop. If they do anything further to harm the Krieg pirates, Gin is highly liable to act on his threat. Sanji knows this, and holds himself accountable for Zeff and the Baratie. The reasons behind his weird shift in behavior are hidden in the past of these two chefs: Sanji blames himself for having destroyed Zeff's former life, his dreams, and his strength. He does not want him to lose anything more and would die rather than give Don Krieg the Baratie.\nPearl takes this opportunity to wallop Sanji, since he won't raise a finger to possibly endanger Zeff. The cooks around them are dying to know what could have possibly happened to them so long ago, because they were under the impression that Sanji had hated the head cook. While Sanji is down after several attacks from Pearl, two words come to mind before the scene flashes back in time: All Blue.  Nine years ago, young Sanji was an apprentice chef on the Orbit cruise ship. He one day told his older chef companions about his dream to find the All Blue, a legendary sea where all species of fish and seafood from all the world's oceans could be found. After mocking him for believing that such a sea exists, they began to eat the many leftovers left by the clients. Sanji finds this disgusting, and berates them for eating scraps, when there is still fresh food and their next port of call is only two days away. The more experienced cooks reply that on the sea, one does not know what may happen. A sea-faring cook must take advantage of whatever resources are available. He doesn't see the allure, and rejects their leftovers again.\nSuddenly people on the deck began running and yelling for help. The ship is being attacked by Zeff and his crew, the Cook Pirates.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Krieg",
    "Gin",
    "Pearl",
    "Zeff",
    "Sanji",
    "Patty",
    "Carne"
  ],
  "ssum_frequencies": [
    [
      "sanji",
      2
    ],
    [
      "to",
      2
    ],
    [
      "zeff",
      2
    ],
    [
      "decides",
      1
    ],
    [
      "sacrifice",
      1
    ],
    [
      "himself",
      1
    ],
    [
      "in",
      1
    ],
    [
      "order",
      1
    ],
    [
      "save",
      1
    ],
    [
      "while",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      24
    ],
    [
      "to",
      17
    ],
    [
      "and",
      12
    ],
    [
      "sanji",
      11
    ],
    [
      "him",
      7
    ],
    [
      "his",
      7
    ],
    [
      "a",
      6
    ],
    [
      "of",
      6
    ],
    [
      "on",
      5
    ],
    [
      "he",
      5
    ],
    [
      "is",
      5
    ],
    [
      "for",
      5
    ],
    [
      "zeff",
      4
    ],
    [
      "pearl",
      4
    ],
    [
      "all",
      4
    ],
    [
      "gin",
      3
    ],
    [
      "ship",
      3
    ],
    [
      "what",
      3
    ],
    [
      "does",
      3
    ],
    [
      "not",
      3
    ]
  ]
}