{
  "chapter_number": "Chapter 74",
  "title": "Business",
  "short_summary": "Arlong's fish-men had been beaten by Zoro while Arlong and his crew were in Cocoyasi Village. In order to regain the trust of the pirates who start to think that she let the swordsman escape, Nami fights with Usopp who has been captured. From Arlong's point of view, he watches her stabs him and plunge him into the sea. Satisfied by this behavior to be worthy of a true Arlong Pirate, the fish-men congratulate her. However she tells him that she only did that so that she could buy the village Arlong promised her. From a distance, Johnny watches unseen and quickly runs back towards the village.\n",
  "long_summary": "Realizing it has been Zoro in their grasp all along, Arlong explains that since he has the highest bounty in all of East Blue, it's natural that a bounty hunter would want to take him out. He wonders where Zoro could be, to which Usopp responds that he doesn't know and asks to be let go. Though his lie doesn't fool anyone, Arlong then gets the idea to kill Usopp to get Zoro to show up, but Usopp tells them that this won't work and asks Nami for help. Causing more doubt among the crew about Nami's loyalty, and Usopp berates her for betraying Luffy saying that even now he still trusts her, to which Nami calls him an idiot.\nHatchan then returns, and is surprised that Arlong is back and that his comrades are hurt, and is even more surprised to learn that it was Zoro who did it, telling the crew that he just gave him a ride to Cocoyasi Village because he was looking for Arlong and he thought Zoro was Arlong's guest. Which makes Arlong happy that Zoro is looking for him, Hatchan then asks who Usopp is. Nami, in order to prove her allegiance, attacks Usopp. She announces he will kill him and appears to stab him from Arlong's point of view. Johnny watches unseen from the bushes. Nami then pushes Usopp into the pool which solidifies the crew's trust of her, and she reminds them again of her goal - to purchase back her hometown village.\nLuffy, Sanji, Yosaku, and Zoro all arrive at Arlong Park and are pulled ashore by Momoo.\n\n"
}