{
  "chapter_number": "Chapter 31",
  "title": "Truth",
  "short_summary": "Kaya learns the truth and leaves the mansion to try to stop Kuro. Meanwhile at the cliff, two new Black Cat Pirates make their apparition: the Nyaban Brothers.\n",
  "long_summary": "At the mansion, Kaya has a nightmare where Usopp attempts to kill her for insulting his pirate blood. She goes looking around the mansion for Klahadore, only to find her servant Merry laying on the floor.\nMerry manages to regain consciousness; however, he is too weak to get up. He tells Kaya about Klahadore attacking and trying to kill him and how Usopp really was correct; Klahadore really is a pirate. Kaya cries because the only one who knew the truth was chased away from the village while trying to protect it. More startling is the news from Merry that everyone else in the mansion is on vacation, Merry calms Kaya down since nothing has happened yet. Klahadore is after treasure, Merry tells Kaya to just give him what he is after to protect her life so the village can stay safe.\nThe Usopp Pirates gather outside the village, commenting how they think their captain lied about lying about the pirates coming. Just then, they spot Miss Kaya heading out of town.\nBack at the coast, Zoro stands ready to fight whatever is coming up from the Black Cat Pirates next. The Nyaban Brothers, Buchi and Sham, appear. The pair appear afraid to attack Zoro. Sham runs towards Zoro in a cowardly fashion. However, at the last second Sham suddenly becomes confident and reveals he was faking his cowardice. The next thing, Zoro sees Sham standing there with two of his swords attached to his back.\n\n",
  "characters": [
    "Monkey D. Luffy (K.O)",
    "Roronoa Zoro",
    "Nami",
    "Kuro (flashback)",
    "Jango",
    "Buchi",
    "Sham",
    "Kaya",
    "Merry",
    "Usopp",
    "Piiman",
    "Ninjin",
    "Tamanegi"
  ],
  "ssum_frequencies": [
    [
      "the",
      4
    ],
    [
      "to",
      2
    ],
    [
      "kaya",
      1
    ],
    [
      "learns",
      1
    ],
    [
      "truth",
      1
    ],
    [
      "and",
      1
    ],
    [
      "leaves",
      1
    ],
    [
      "mansion",
      1
    ],
    [
      "try",
      1
    ],
    [
      "stop",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      18
    ],
    [
      "to",
      11
    ],
    [
      "is",
      7
    ],
    [
      "kaya",
      6
    ],
    [
      "merry",
      5
    ],
    [
      "his",
      4
    ],
    [
      "klahadore",
      4
    ],
    [
      "he",
      4
    ],
    [
      "and",
      4
    ],
    [
      "zoro",
      4
    ],
    [
      "sham",
      4
    ],
    [
      "at",
      3
    ],
    [
      "mansion",
      3
    ],
    [
      "a",
      3
    ],
    [
      "usopp",
      3
    ],
    [
      "her",
      3
    ],
    [
      "about",
      3
    ],
    [
      "was",
      3
    ],
    [
      "from",
      3
    ],
    [
      "village",
      3
    ]
  ]
}