{
  "chapter_number": "Chapter 21",
  "title": "Town",
  "short_summary": "After defeating the Buggy Pirates, Luffy, Zoro and Nami are about to depart with Buggy's treasure, but the villagers arrive and ask about the pirates. Seeing that their mayor has been knocked out, they ask who did it, and Luffy admits it was him. While they are being chased out of the village, Chouchou helps them escape by holding back the villagers. The mayor soon wakes up, and after asking about Luffy and the others, runs after them to thank them as they sail away.\n",
  "long_summary": "Luffy, having beaten Buggy, begins to leave the city with Zoro and Nami. Nami splits the loot into two bags: one for Luffy and one for herself. When the villagers arrive, they find Boodle unconscious, and Luffy admits that he knocked him out. The villages then ask if they are pirates, and Luffy cheerfully says he is, angering them and causing them to give chase. While the crew is running away, Luffy says that it must be a very good town, because they were prepared to fight pirates to protect a single person, but he also mentions that no matter what the villagers say, they are not going to stop.\nOn the way, they encounter Chouchou, who protects Luffy and the others. They reason that this is to pay back the debt of Luffy avenging the destruction of his owner's shop, as he refuses to let the villagers pass. Near the boat, they encounter three of Buggy's crew who Nami stole a boat from previously and who Zoro beat up afterwards. Luffy, carrying a worn out Zoro on his shoulders, is stopped by one of the pirates, who taps Zoro on the head, saying that he should not be a coward and should show his face. When Zoro lifts his head and glares at them, the three pirates run away in fear.\nMeanwhile, the Mayor wakes up and finds the town's people around him. They tell him that they have chased Luffy and the rest out of town. As they curse the pirates, he gets angry, saying that he is the only one allowed to insult them. He rushes to the harbor to thank the crew.\nAs the boat leaves, Luffy says he left his bag of treasure back at the harbor to help them rebuild. Out of rage, Nami threatens to drown him in the sea, calling him an idiot. \n\n"
}