{
  "chapter_number": "Chapter 111",
  "title": "The Secret Criminal Organization",
  "short_summary": "Nami makes a deal with Igaram: they will save the princess for a 1,000,000,000 reward. However she only wants the money and asks Zoro to do the fighting. Showing us her great powers to manipulate people, she is able to convince Zoro. Meanwhile the princess tries to escape Mr. 5 and Miss Valentine, after Mr. 9 it is Miss Monday turn to help her but she is no match. While Mr. 5 is about to kill her, Zoro appears suddenly and saves her. Luffy, on his side as woken up too and seems to have a grudge against Zoro.\n",
  "long_summary": "Igaram is exasperated by Nami's offer of a 1,000,000,000 to protect Vivi. With Luffy still asleep, Zoro asks whether Nami should still be unconscious from all the alcohol she drank at the welcoming party. Nami retorts that she didn't want to drink and lower her guard, due to her suspicions of the Whisky Peak villagers' behavior, before bragging that she could have drunk much more if she had intended to, much to Zoro's chagrin. Turning to Igaram, Nami happily asks him whether he can guarantee the payment and additionally reminds the head of the Arabasta Royal Guard that without their help, Nefertari Vivi could die.\nAfter some bartering, Igaram tells Nami that she will have to negotiate the payment with Vivi herself, only after her safe journey to Arabasta has been assured - Nami agrees with a haughty sigh and subsequently commands Zoro to assist the Princess.\nA shocked Zoro at first refuses, claiming that the monetary scheme should be her responsibility, before Nami quips that even if the money is hers, the contract involves the entire Straw Hat crew. They continue to argue, whilst Luffy wakes up from his slumber in order to urinate, ignoring his crew-mates' squabble. Nami finally coaxes a frustrated Zoro into assisting her, by offering to rescind the unpaid added interest of 200,000 Belly on the money she loaned out to him at Loguetown.\nAs Zoro leaves to assist Vivi, cursing that Nami won't have a peaceful death, Igaram laments his weakness in failing to protect Vivi. Nami reassures him that Zoro is 'monstrously strong', with Igaram iterating that Vivi's survival is incredibly important for Arabasta's future.\nMeanwhile, across town, Vivi is attempting to escape Mr. 5 and Miss Valentine by riding Karoo to a ship docked behind Cactus Rock. Mr. 5 comments on how her efforts are useless. Miss Monday aids a grateful Vivi by standing in the path of the two Baroque Works agents, reasoning that the whole band of bounty hunters in Whisky Peak would be punished anyway for suffering defeat at Zoro's hands. Disappointed with her sullying of Baroque Works' name, Mr. 5 incapacitates Miss Monday with a single clothesline that explodes on impact.\nHe continues to explain to a shocked Vivi, that his very person is a human bomb, being able to make any body part explode, having eaten the Bomu Bomu no Mi; he then picks his nose, flicking a bogey and subsequently launching a Nose Fancy Cannon. Suddenly, Zoro slices it in half, rescuing a surprised Vivi; the resultant explosive fragments destroy the buildings lining the road. Mr. 5 ponders who the swordsman is.\nZoro is disgusted at having to slice a bogey in half. Vivi at first believes that Zoro is there to prevent her escape, attacking him; Zoro casually blocks it, informing that he is in fact there to rescue her.\nThe scene then jumps to Nami, who asks Igaram about Baroque Works; he tells her that it is a secret criminal organization in which none of its members know the true identity of their boss, a man who bestows orders ranging from intelligence gathering to assassinations. Nami asks why the organisation members follow the commands of an unknown entity; Igaram replies that the ultimate aim of the group is to create an ideal nation, with high-ranking positions being awarded to those individuals who bring great success to the organisation. He also reveals that the boss has a codename of Mr. 0, explaining that the lower the number, the higher-ranked and the stronger that particular person will be within this ideal nation; he stresses that the strength of those with a number ranking of 5 or below are 'abnormal'.\nLuffy is now seen walking by the river running through the town, having just urinated. He becomes shocked at something off-panel.\nWe return to the two Baroque Works agents, who identify Zoro as the one who defeated the town's agents; they ask him further why he is protecting Vivi. After an ambiguous answer from Zoro, the pair prepare to attack, Miss Valentine boasting about her Devil Fruit ability.\nHowever, Luffy interrupts, shouting from further down the road that vows to never forgive Zoro and challenges his crew-mate to a fight, much to Zoro's surprise.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp (cover)",
    "Sanji (cover)",
    "Nefertari Vivi",
    "Igaram",
    "Karoo",
    "Mr. 5",
    "Miss Valentine",
    "Miss Monday"
  ],
  "ssum_frequencies": [
    [
      "to",
      7
    ],
    [
      "the",
      4
    ],
    [
      "and",
      4
    ],
    [
      "zoro",
      4
    ],
    [
      "her",
      4
    ],
    [
      "is",
      4
    ],
    [
      "a",
      3
    ],
    [
      "she",
      3
    ],
    [
      "mr",
      3
    ],
    [
      "princess",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      42
    ],
    [
      "to",
      33
    ],
    [
      "that",
      21
    ],
    [
      "a",
      19
    ],
    [
      "is",
      14
    ],
    [
      "of",
      14
    ],
    [
      "zoro",
      13
    ],
    [
      "vivi",
      11
    ],
    [
      "nami",
      11
    ],
    [
      "her",
      11
    ],
    [
      "he",
      9
    ],
    [
      "with",
      8
    ],
    [
      "in",
      8
    ],
    [
      "igaram",
      7
    ],
    [
      "at",
      7
    ],
    [
      "and",
      7
    ],
    [
      "she",
      6
    ],
    [
      "his",
      6
    ],
    [
      "who",
      6
    ],
    [
      "by",
      5
    ]
  ]
}