{
  "chapter_number": "Chapter 100",
  "title": "The Legend Has Begun",
  "short_summary": "Smoker manages to capture Buggy, Alvida and the rest in mere seconds using a net made of Seastone for Devil Fruit users. When he finally gets a hold on Luffy and is ready to finish him off, a mysterious man named Dragon stops Smoker and a huge storm suddenly starts. The storm helps Luffy, Zoro and Sanji escape to the ship and head to the Grand Line, where they vow to accomplish their dreams.\n",
  "long_summary": "A mysterious figure roams the streets of Loguetown as the storm pours down. Alongside the figure, words are spoken about how change cannot be stopped. The man says \"Pirate King?\" and then adds afterwards \"not a bad idea\".\nBuggy gets up after being struck by lightning, angry that Luffy escaped. When Cabaji questions why he is still alive, Buggy states he refuses to die here. Alvida points out the growing Marine problem. Boasting how Luffy's ship should be burned down by now, Buggy uses his car mode and heads off to the harbor, closely followed by Alvida who takes off her sandals, and slide down a ramp to follow. However, they are caught by Smoker. The Marines succeeded in catching the Buggy Pirates and Alvida. Smoker then chases after Luffy, while Alvida comments on how her Devil Fruit powers do not work on the net. Buggy states it is made of Seastone and the Marines have developed it to capture Devil Fruit users.\nAt the harbor, Richie and Mohji are in trouble, the rain prevents them from setting fire to the Going Merry. Mohji is startled as Usopp arrives, causing him to slip over and knock himself out while Richie is distracted by an egg launched out by the boy's slingshot, while the marksman and Nami arrive back to the Going Merry.\nElsewhere, Zoro, Sanji, and Luffy race towards the ship followed by the Marines. Ahead, Tashigi calls Zoro out and states he lied to her. She states she will take Zoro's Meito and Wado Ichimonji away from him. As the pair break into a fight, Sanji yells at Zoro for attacking a woman but Luffy grabs Sanji and continue on towards the harbor, leaving Zoro behind. Tashigi is easily beaten, knocked against the wall with Zoro's sword at her throat, Zoro states he will never lose his sword. As Zoro begins to run after Luffy and Sanji, Tashigi is outraged that she wasn't killed and demands he tell her why he refuses to kill her, believing it to be because she is a woman. Zoro yells at her, telling her to stop imitating his dead friend and the two break into a childish argument.\nSmoker catches up to Luffy and Sanji and blocks the way to the harbor. Smoker grabs Luffy causing Sanji to leap into action, but with no effect to Smoker because of his Devil Fruit, the Moku Moku no Mi. Smoker uses White Blow and hits Sanji to a building, Luffy tried to fight back with one blow but ultimately failed, due to Smoker's ability. Losing very easily, as Smoker goes to throw the finishing blow, a mysterious man called Dragon appears. The World Government is apparently looking for him. Stating the world is \"waiting for our answer\", a gust of wind breaks out.\nEveryone is blown away from where they were, including Luffy with Zoro and Sanji. As the crew escape, Smoker demands to know why, Dragon states he sees no reason to stop a man's destiny. At the harbor, Nami and Usopp urge the others to hurry on board the Going Merry quickly. Smoker declares he will go after Luffy, Tashigi states she will chase after Zoro. On the sea, Buggy tells his crew to chase after Luffy, and that it is time he returned to the Grand Line.\nFinally, away from Loguetown and safely at sea, the Straw Hats spot the lighthouse signaling the way to the Grand Line. They declare their vows and dreams and prepare themselves for the next step in their journey.\n\n"
}