{
  "chapter_number": "Chapter 194",
  "title": "Cutting Steel",
  "short_summary": "Zoro and Mr. 1 fight starts but nobody is able to make a true decisive step. Mr. 1's attacks are countered by Zoro and Zoro's attacks are ineffective against Mr. 1's steel body. After being buried under rubbles, Zoro reminds himself of a talk with his sword master: when he asked him if it was true that there was people able to cut through steel, Koushirou answered him that a true sword has the power to cut but also to not cut.\n",
  "long_summary": "On the streets of Alubarna, Mr. 1 tells Roronoa Zoro that since he acquired the Supa Supa no Mi, not a single swordsman has been able to harm even a single strand of his hair, and that Zoro cannot win. Zoro responds by saying that he was just giving him some things to take into consideration, and that while he does not know who he fought before, he will change that fact. Mr. 1 charges, saying that Zoro only has a big mouth. Zoro, calling him bald, blocks his leg slash with two of his swords. Both of them wonder how long their opponent can last, and Mr. 1 spins around, turns his hands into blades, and strikes at Zoro. Zoro successfully deflects a series of blows, and dodges a leg slash aimed at his head. Placing his third sword in his mouth, Zoro attacks Mr. 1 with Oni Giri, followed with Tora Gari, knocking Mr. 1 to the ground. However, the assassin simply stands up, having taken no damage whatsoever, and asks Zoro what he told him earlier. Zoro is surprised to see that there is not a scratch on him, and that he has not met anyone who took his attacks and could still stand. Mr. 1 says that this is because before this moment, Zoro had never met him.\nMr. 1 continues with a bladed kick that Zoro barely dodges. Zoro states that he gets it, and blocks the bladed underside of his leg with his sword. Zoro realizes that with Mr. 1's powers, he is able to make a blade anywhere on his body, essentially creating a body full of blades. Mr. 1 kicks at his head, but Zoro ducks and rolls to the side, dodging. Mr. 1 continues, attacking Zoro with his Sparkling Daisy attack, slicing open the building behind Zoro and sending him flying into the rubble. Lying bleeding under the rubble, Zoro says that he will have to train himself further, as that was too close to death. Wondering what he is lacking, Zoro remembers a conversation he had with his sword mentor, Koushirou. Zoro had asked if there were swordsmen could cut through steel, and after not cutting a piece of paper, Koushirou tells Zoro that a true sword protects what the swordsman wants it to protect and only cuts what he wants it to cut. Back to real time, Mr. 1 tells Zoro that Zoro has not cut him yet, and that he is waiting to be slashed. Zoro, telling Mr. 1 not to underestimate him, lifts a huge section of the building and throws it in the air at Mr. 1, saying that when he learns how to cut steel, it will be Mr. 1's end. Mr. 1 simply states that anything that comes towards him, he will simply destroy it.\n\n"
}