{
  "chapter_number": "Chapter 76",
  "title": "Sleep",
  "short_summary": "Nami tells the Straw Hat Pirates to leave the island and stay away from Arlong. She tells Luffy that they are not her crewmates and that she never saw them as such. Luffy decides to go to sleep on the spot, which infuriates her. Meanwhile, Usopp is revealed to be alive, and Nami faked his death in order to save him from being killed by Arlong.\n",
  "long_summary": "When Luffy refers to Nami as his crewmate, she tells him that he is no more than a nuisance. She says that she only stayed with them because of their money. Zoro argues with Sanji that he is making things more complicated with his romantic advances toward her. Sanji responds by saying that love is like a hurricane.\nJohnny interrupts their quibbling when he yells at Nami, calling her a witch. He says that all she cares about is getting all the money hidden in Cocoyasi Village, where she is willing to join the Arlong Pirates and will go so far as to kill people in order to do so. He follows up by calling her a witch again and saying that she is cold-blooded. He swears that he saw her killing Usopp. Nami is unfazed, and asks Johnny what he is going to do about it. Johnny is taken aback by surprise.\nShe also tells them that if they want to live, they better stay out of Arlong's business because he is infuriated by Zoro's stunt. Nami says that Luffy and his crew may be monsters, but they are no match for the real monster. Zoro responds by saying that he couldn't care less and asking where Usopp is. Nami tells him that he is at the bottom of the ocean. Irritated, Zoro tries to attack Nami, but Sanji stops him. The two of them begin to argue. Zoro tells him to not interfere when he has no idea what is going on. Sanji ignores him and tells him that he is just irritated after his loss with Mihawk. Zoro gets mad and points his sword toward Sanji's neck. Sanji taunts him and tells him to just try. Yosaku tells the two of them to stop because they are in a serious situation right now.\nNami tells them to leave and go fight elsewhere, and she couldn't care less, bidding them farewell. Luffy then immediately falls asleep on the spot, announcing that he is sleepy and could not care less about what is happening on the island. Nami then yells at him, saying that he can die for all she cares. Afterwards, Johnny and Yosaku decide to part ways with Luffy and the others because they are afraid of getting hunted down and killed by Arlong. They tell everyone that they will meet again one day.\nMeanwhile, Usopp, who is revealed to be alive, wanders through Cocoyasi Village. He wonders and asks himself why Nami would pretend to kill him but stab her own hand instead. It then occurs to him that Nami was actually trying to save him from being killed by Arlong, and he comes to the conclusion that she is not a witch. Following this realization, Usopp decides to look for Zoro. He remembers that the octopus guy told him that Zoro was looking for Arlong earlier. Terrified, he assumes that Zoro could have returned to Arlong Park to search for him. He decides to run straight for Arlong Park in order to save his crewmate. However, he spots Zoro in the distance as he is running.\nAt the same time, Sanji asks Zoro if he thinks that Nami killed Usopp. Zoro tells him that it is a possibility, as she got pissed after Usopp called her \"small\" last time. Sanji gets angry, thinking that Zoro was referring to Nami's breast size. Sanji and Zoro then clash, but Usopp gets into the crossfire and gets his face injured.\nMeanwhile, Nojiko is out in the tangerine fields and hears the house door slamming shut. She goes inside and notices Nami with her head on the desk. Nojiko comments on the mess of thrown furniture and broken glass on the floor, which Nami has made, and asks her if anything is wrong. Nami says that she was only taking a little rest at first before opening up to her sister. Nojiko then understands that her friends have come to take her back, and she understands why she is upset, as nothing upsets Nami more than having to say the word \"friend.\"\nBack with the Straw Hats, Luffy is shocked by Usopp's face. He asks him if Nami was responsible for it; Sanji and Zoro take responsibility for it. Usopp tells Luffy that Nami had saved him, and he feels that Nami had joined the Arlong Pirates for another reason. Nojiko then appears and tells them that it's useless and that there is no way that they could change Arlong's rule. She then agrees to tell the crew about Nami's past, but they must leave after she is done.\nBack at the village, 16th Marine Branch captain, Nezumi appears with his team and asks Genzo to lead them to Nami's house.\n\n"
}