{
  "chapter_number": "Chapter 2",
  "title": "That Guy, \"Straw Hat Luffy\"",
  "short_summary": "Luffy ends up on an island that the pirate Iron-Mace Alvida is using as a base. There, he meets Koby, a boy who has been forced to be Alvida's servant despite his desires to become a Marine. Luffy helps Koby get the courage to stand up to Alvida. After this, Luffy promptly defeats her and leaves the island with Koby.\n",
  "long_summary": "Luffy sets off in a dinghy to form his own pirate crew; however, no sooner had he left than he ran into his first problem - a whirlpool.\nMeanwhile, on a remote island, as Alvida is inspecting her ship, she clobbers one of her crew for leaving dust on the deck and asks Koby \"Who is the most beautiful in all the sea?\" The boy fearfully replies that she is. She comments on how Koby is only allowed to stay because he knows more about navigation than all the others do and how useless he is at everything else. She then orders Koby to clean her shoes.\nSad and upset, Koby pushes a barrel he found into Alvida's hideout. Upon approach, three of Alvida's crew (Heppoko, Peppoko, and Poppoko) stop him and take the barrel, bullying him into being silent about the fact that they are going to drink the wine inside it without Alvida knowing. Suddenly, Luffy bursts out of the barrel and shocks everyone. Before they can get their answer as to why he popped out, Alvida sends her club flying into the hideout. Koby and Luffy flee; meanwhile Alvida accuses her crew of slacking off because she heard someone call \"Aw! What a nice nap!\" They explain it was not them, but an intruder instead. Alvida fears the famous bounty hunter Roronoa Zoro is here to claim her bounty.\nElsewhere, Koby has dragged Luffy to safety away from Alvida. He shows him his boat that he made over the last 2 years in an attempt to escape from her and explains how he got into his situation. Luffy comments on how wimpy Koby is. Luffy tells Koby his dream to become Pirate King. Koby cannot believe Luffy is prepared to die for his dream and Luffy hits Koby because he does not like his wimpy outlook. Koby admires Luffy's outlook on life. Koby then reveals his desires to become a Marine and catch bad guys. He boasts he would rather die trying to escape to join them than spend the rest of his life at Alvida's side.\nJust then, Alvida appears and destroys his boat. Alvida accuses Koby of hiring someone to kill her. When she asks him who the most beautiful woman is, Luffy interferes and outwardly states Alvida is an ugly old hag. Koby, inspired by Luffy, tells Alvida straight what he thinks of her. Alvida strikes Koby in anger, but Luffy gets between her and Koby, taking the full force of Alvida's club; to the shock of everyone, he survives. With one punch of his \"Gomu Gomu no Pistol\", Luffy knocks Alvida out and orders her crew to fetch Koby a boat and to stay out of his way.\nSometime later, Luffy and Koby are seen sailing out to sea by themselves. Koby tells Luffy more about Zoro, the bounty hunter Alvida mentioned. Luffy decides that he wants to try to recruit Zoro and they head off.\n\n",
  "characters": [
    "Alvida",
    "Heppoko",
    "Peppoko",
    "Poppoko",
    "Monkey D. Luffy",
    "Koby",
    "Roronoa Zoro (mentioned only)"
  ],
  "ssum_frequencies": [
    [
      "to",
      4
    ],
    [
      "luffy",
      3
    ],
    [
      "the",
      3
    ],
    [
      "a",
      3
    ],
    [
      "koby",
      3
    ],
    [
      "up",
      2
    ],
    [
      "island",
      2
    ],
    [
      "alvida",
      2
    ],
    [
      "ends",
      1
    ],
    [
      "on",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      20
    ],
    [
      "koby",
      19
    ],
    [
      "the",
      17
    ],
    [
      "and",
      17
    ],
    [
      "luffy",
      15
    ],
    [
      "he",
      15
    ],
    [
      "alvida",
      13
    ],
    [
      "his",
      12
    ],
    [
      "her",
      11
    ],
    [
      "of",
      11
    ],
    [
      "is",
      10
    ],
    [
      "a",
      7
    ],
    [
      "she",
      6
    ],
    [
      "crew",
      5
    ],
    [
      "into",
      5
    ],
    [
      "on",
      5
    ],
    [
      "out",
      5
    ],
    [
      "in",
      4
    ],
    [
      "that",
      4
    ],
    [
      "how",
      4
    ]
  ]
}