{
  "chapter_number": "Chapter 8",
  "title": "Introducing Nami",
  "short_summary": "In order to get food for himself and Zoro, Luffy tries to catch a bird, but it is far larger than him, and he ends up being brought to an island. Zoro chases after him, and picks up some of Buggy the Clown's pirates along the way. Meanwhile, Luffy meets a girl named Nami, who was running away from some pirates.\n",
  "long_summary": "Zoro and Luffy are lost, starving at sea due to the fact that neither of them has any navigation skills. They are talking about how Zoro survives on the sea by hunting others. Zoro points how odd it is for a pirate like Luffy not being able to navigate, though Luffy states that wandering usually works for him. He then points out that Zoro is no different, given that he is a wandering bounty hunter. Zoro reveals that he never intended to become a bounty hunter in the first place when he first went out to sea, but entirely to search for a certain man. However, he then could not find his way back home. Due to this, he had no choice but to take up bounty hunting for a living. Luffy somewhat correctly comes to the conclusion that Zoro has been lost this whole time, which angers the swordsman who tells him to shut up. Some time passes and a bird flies overhead, causing a starving Luffy to go after it, which ends up with him in the bird's beak, being carried off with Zoro left to chase after him.\nAs Zoro rows as fast as he can, he comes across some castaways and tells them to grab on, as he is not stopping. When they are on board, they reveal that they are pirates working for Captain Buggy and that they were taking the boat. Zoro then reveals to them who he is by beating them. As they row him onwards the question of why they were in the middle of the ocean arises.\nIt turns out they were tricked by a girl on a boat, who stole their boat and treasure, leaving them to be sunk on her boat with help from a storm. Zoro wonders if a person like her who can predict the weather would join him and Luffy. One of Buggy's crew tells Zoro about their captain and how he has the power of a Devil Fruit.\nMeanwhile, a girl in the nearby town is running from some of Buggy's crew after stealing their map to the Grand Line. Elsewhere Buggy's men report seeing a strange bird and Buggy gives the order to shoot it down. As the bird is hit, Luffy falls right in front of the girl. However, to the shock of the Superhuman Domingos, Luffy stands up unscathed.\nThe girl tries to claim Luffy is her boss in order to get out of trouble with the pirates and runs off, leaving Luffy to deal with them. One of Buggy's crew knocks Luffy's straw hat causing him to get mad. Luffy beats them up. After he is finished, the girl reappears claiming to be a thief who steals from pirates, called Nami.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Tightrope Walking Funan Bros",
    "Superhuman Domingos",
    "Nami",
    "Pinky"
  ],
  "ssum_frequencies": [
    [
      "to",
      3
    ],
    [
      "and",
      3
    ],
    [
      "zoro",
      2
    ],
    [
      "luffy",
      2
    ],
    [
      "a",
      2
    ],
    [
      "him",
      2
    ],
    [
      "up",
      2
    ],
    [
      "some",
      2
    ],
    [
      "the",
      2
    ],
    [
      "pirates",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      22
    ],
    [
      "the",
      22
    ],
    [
      "a",
      15
    ],
    [
      "he",
      12
    ],
    [
      "zoro",
      11
    ],
    [
      "luffy",
      11
    ],
    [
      "of",
      10
    ],
    [
      "and",
      9
    ],
    [
      "is",
      9
    ],
    [
      "that",
      8
    ],
    [
      "they",
      8
    ],
    [
      "them",
      7
    ],
    [
      "him",
      7
    ],
    [
      "in",
      6
    ],
    [
      "as",
      6
    ],
    [
      "on",
      5
    ],
    [
      "for",
      5
    ],
    [
      "up",
      5
    ],
    [
      "who",
      5
    ],
    [
      "with",
      5
    ]
  ]
}