{
  "chapter_number": "Chapter 120",
  "title": "The Red Ogre Weeps",
  "short_summary": "Brogy defeats Dorry thanks to Mr. 3's interference, but Mr. 3 then comes in and overwhelms Brogy by using the power of the Doru Doru no Mi to cover his body in wax. Meanwhile, Mr. 5 and Miss Valentine confront Luffy, Usopp, and Vivi after defeating Karoo, and they capture Vivi to bring her to Mr. 3.\n",
  "long_summary": "Mr. 3's interference allows Brogy to land a great blow on Dorry's chest, defeating the latter. Luffy becomes very enraged and yells out, wanting to know who had weakened Dorry. Miss Goldenweek hears him, but Mr. 3 pays no attention. Brogy starts to cry with happiness over finally winning in their duel, when Mr. 3 approaches him and thanks him. He introduces himself to Brogy before revealing that he has encased the giant's feet with wax using the power of the Doru Doru no Mi.\nMeanwhile, Usopp and Vivi decide to go find the people who harmed Dorry. Right then, however, Mr. 5 and Miss Valentine come out of the woods with a defeated Karoo. Mr. 5 reveals that they had been trying to lure Vivi away from Luffy by forcing Karoo to cry out for her, but the duck refused even to the point of severe beating. Usopp asks if they put the bomb in Dorry's rum, which they affirm, and they note that they had not seen him before. Usopp and Vivi then pull out their weapons and race to attack, with Usopp launching an explosive shot at Mr. 5. However, Mr. 5 is unharmed due to his Devil Fruit power, and he responds by flicking an explosive ball of mucus at Usopp. Miss Valentine then leaps into the air before becoming much heavier and slamming into Usopp. Vivi attempts to attack Mr. 5, but he overwhelms her with an explosion before grabbing her by the neck. He says that he is not going to kill Vivi, but rather take her to Mr. 3 on his orders. Meanwhile, Mr. 3 has pinned Brogy to the ground with his wax as he states his intention to create a masterpiece of artwork.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Usopp",
    "Dorry",
    "Brogy",
    "Nefertari Vivi",
    "Karoo",
    "Mr. 3",
    "Miss Goldenweek",
    "Mr. 5",
    "Miss Valentine"
  ],
  "ssum_frequencies": [
    [
      "to",
      4
    ],
    [
      "mr",
      4
    ],
    [
      "and",
      4
    ],
    [
      "brogy",
      2
    ],
    [
      "3",
      2
    ],
    [
      "in",
      2
    ],
    [
      "the",
      2
    ],
    [
      "doru",
      2
    ],
    [
      "vivi",
      2
    ],
    [
      "defeats",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      15
    ],
    [
      "the",
      12
    ],
    [
      "mr",
      10
    ],
    [
      "and",
      9
    ],
    [
      "he",
      7
    ],
    [
      "with",
      6
    ],
    [
      "usopp",
      6
    ],
    [
      "of",
      5
    ],
    [
      "vivi",
      5
    ],
    [
      "5",
      5
    ],
    [
      "they",
      5
    ],
    [
      "brogy",
      4
    ],
    [
      "out",
      4
    ],
    [
      "him",
      4
    ],
    [
      "but",
      4
    ],
    [
      "3",
      4
    ],
    [
      "before",
      4
    ],
    [
      "that",
      4
    ],
    [
      "her",
      4
    ],
    [
      "his",
      4
    ]
  ]
}