{
  "chapter_number": "Chapter 60",
  "title": "Propriety",
  "short_summary": "The fierce battle between Sanji vs Gin and Luffy vs Don Krieg begins.\n",
  "long_summary": "Gin promises he will honor Sanji by killing him by his own hands. Sanji has little reaction to Gin's threats. This also goes for Luffy, who does not see himself loosing in front of such a crew.\nFor the Krieg Pirates, who see themselves as the most powerful of East Blue, this is unforgivable and they rush the two kids. However, they are immediately stopped by their captain; while he is here they have not to be worry of who is the stronger. However, when Krieg asks Luffy the question of who is stronger, Luffy naturally responds that he is the strongest one here.\nIn order to make him realize the difference between the two of them, Don Krieg threatens Luffy with one of his strongest weapons - the poison gas MH5. Krieg fires the bomb at the Baratie. When Luffy attempts to bounce the bomb back, it reveals to actually be a shuriken bomb and not a poison bomb. Hurt by the sharp stakes, Luffy admits he was tricked, but he continues to assert that he is the strongest. As his anger rises, Don Krieg asks Gin to take care of Sanji. He tells him he will deal with Luffy personally.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Mohji (cover, K.O)",
    "Richie (cover)",
    "Cabaji (cover, K.O)",
    "Krieg",
    "Gin",
    "Hustle",
    "Zeff",
    "Sanji",
    "Patty",
    "Carne"
  ],
  "ssum_frequencies": [
    [
      "vs",
      2
    ],
    [
      "the",
      1
    ],
    [
      "fierce",
      1
    ],
    [
      "battle",
      1
    ],
    [
      "between",
      1
    ],
    [
      "sanji",
      1
    ],
    [
      "gin",
      1
    ],
    [
      "and",
      1
    ],
    [
      "luffy",
      1
    ],
    [
      "don",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      14
    ],
    [
      "he",
      8
    ],
    [
      "to",
      7
    ],
    [
      "luffy",
      7
    ],
    [
      "of",
      7
    ],
    [
      "is",
      6
    ],
    [
      "krieg",
      5
    ],
    [
      "by",
      4
    ],
    [
      "who",
      4
    ],
    [
      "bomb",
      4
    ],
    [
      "sanji",
      3
    ],
    [
      "him",
      3
    ],
    [
      "his",
      3
    ],
    [
      "not",
      3
    ],
    [
      "a",
      3
    ],
    [
      "they",
      3
    ],
    [
      "strongest",
      3
    ],
    [
      "gin",
      2
    ],
    [
      "will",
      2
    ],
    [
      "this",
      2
    ]
  ]
}