{
  "chapter_number": "Chapter 51",
  "title": "Roronoa Zoro Falls Into the Sea",
  "short_summary": "Roronoa Zoro begins battle with Dracule Mihawk, hoping to earn the title of World's Greatest Swordsman. However Mihawk turns out to be more powerful than Zoro could have ever hoped to imagine, and he is easily bested. While Mihawk does not take him seriously as an opponent by initially fighting him with a small knife, the strength of will Zoro demonstrates greatly impresses him to the point that he draws his real blade out of respect. While this does not change the inevitability of Zoro's defeat, Mihawk promises that he will remember his name. Zoro is cut down with all but one of his swords destroyed, but he humbles himself and seems to find solace in having been able to witness the greatest in the world.\n",
  "long_summary": "Having now fully drawn his swords, Zoro expresses his shock at meeting the World's Greatest Swordsman Dracule Mihawk so early in their adventure. The impending duel has garnered the full attention of everyone present; Krieg Pirates, Straw Hats, and Baratie staff alike. However, Mihawk humiliates him by answering his request with a pocket knife, which was the pendant he was wearing around his neck. He states that he isn't like most fools who would go all out to hunt a mere rabbit. He goes on to explain that while Zoro may have earned some fame as a swordsman, the East Blue is the weakest of the four seas that are separated by the Grand Line and Red Line. He actually regrets that he didn't have an even smaller knife. Zoro is now furious at the degree to which he feels underestimated and prepares to attack, telling Mihawk not to regret it when he dies. As Zoro charges, Mihawk likens him to a frog in a well; stating that its time he experiences the real world beyond his little well. Zoro attempts to use \"Oni Giri\", but Mihawk effortlessly stops all 3 katana with the tip of his knife. Luffy is visibly surprised, while Johnny and Yosaku can't believe that one of Zoro's signature techniques was stopped so easily. Zoro himself considers how no man has been able to stop the technique before, and yet Mihawk countered it so easily with a \"toy\". The shock sends him into a frenzy, ferociously swinging at Mihawk while he wonders how the real world could possibly be so far out of reach with all his training and preparation. Mihawk continues to dodge and counter without so much as breaking a sweat. Zoro remembers his promise to Kuina, and redoubles his efforts. Mihawk notices his mental anguish and questions what burdens him so, and why he seeks the ultimate power. He again calls Zoro a weakling, this time angering Johnny and Yosaku to the point they attempt to intervene, but Luffy stops them. Zoro gets back on his feet, and prepares the \"Tora Gari\".\nThis time Zoro remembers his promise to Luffy instead, and how Luffy's reaction was that he'd expect nothing less of him to be standing at his side as Pirate King. Before Zoro could land the attack however, Mihawk pierces him in the chest with his knife. While everyone is shocked at the devastating blow, the biggest surprise comes from Mihawk, as Zoro simply stands there with the knife in his chest. He asks Zoro why he refuses to step back, and Zoro doesn't really know himself. He explains that if he were to take even one step back, it would be like stepping back on every vow he's made to this point, which would prevent him from ever making it back to where he is now. Mihawk states that such is defeat, but Zoro feels that is even more reason not to step back. Mihawk questions if he'd stand by this conviction even if it meant his death, but Zoro counters that death might actually be better. Mihawk is incredibly impressed by Zoro's strong display of will, and upon removing the knife from his chest, asks the latter to state his name. As Zoro complies, Mihawk finally draws his blade, telling Zoro that he will remember his name, as he does not often see his level of conviction in this world. As a gesture of respect to a fellow swordsman, he tells Zoro that he will fight him with the World's Strongest Sword.  \nZoro prepares his ultimate attack, the Sanzen Sekai, as Mihawk charges toward him. The move ultimately proves ineffective, as all of his swords except the Wado Ichimonji are broken in Mihawk's attack. As his swords break, he concedes defeat and muses how he never even considered the possibility of losing. He stands to face Mihawk, exposing his chest, and extending his arms out to receive the final blow. Mihawk is puzzled, and Zoro tells him that a cut to the back is a shameful act among swordsmen. Mihawk is pleased with Zoro's brave gesture and slashes his chest open. As Zoro begins to fall from the wound, Mihawk makes a mental note that Zoro shouldn't rush his own death. \n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Usopp",
    "Buggy (cover)",
    "Alvida (cover)",
    "Krieg",
    "Zeff",
    "Sanji",
    "Patty",
    "Kuina (flashback)",
    "Dracule Mihawk",
    "Yosaku",
    "Johnny"
  ],
  "ssum_frequencies": [
    [
      "to",
      6
    ],
    [
      "the",
      6
    ],
    [
      "of",
      5
    ],
    [
      "zoro",
      4
    ],
    [
      "mihawk",
      4
    ],
    [
      "he",
      4
    ],
    [
      "with",
      3
    ],
    [
      "him",
      3
    ],
    [
      "his",
      3
    ],
    [
      "greatest",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      32
    ],
    [
      "his",
      28
    ],
    [
      "to",
      25
    ],
    [
      "he",
      24
    ],
    [
      "zoro",
      23
    ],
    [
      "mihawk",
      20
    ],
    [
      "and",
      19
    ],
    [
      "that",
      15
    ],
    [
      "a",
      14
    ],
    [
      "as",
      12
    ],
    [
      "of",
      11
    ],
    [
      "is",
      11
    ],
    [
      "him",
      10
    ],
    [
      "with",
      8
    ],
    [
      "back",
      7
    ],
    [
      "so",
      6
    ],
    [
      "in",
      6
    ],
    [
      "knife",
      6
    ],
    [
      "at",
      5
    ],
    [
      "even",
      5
    ]
  ]
}