{
  "chapter_number": "Chapter 192",
  "title": "Whirlwind Warning",
  "short_summary": "At the palace, Miss All Sunday prevents the guards from helping King Cobra. This gives time to Crocodile to make Vivi despair by telling her Luffy is dead and ask Cobra about his true motive: the search of Pluton. Meanwhile, Nami and Miss Doublefinger's fight continues. Nami starts to combine her weather knowledge with Clima-Tact power while escaping Miss Doublefinger's dangerous attacks at the same time. By combining the hot and cold bubbles with water and the desert dryness, she is able to create a small cloud. Miss Doublefinger continues to mock her ability, that is until she receives a big shock. With the use of the cloud, combined with the electric bubble, Nami is able to electrocute her badly. With the help of her Mirage Tempo, Nami is now fully confident and address a forecast warning to her enemy.\n",
  "long_summary": "Back at the south gate of Alubarna, Sanji meets up with Usopp and Chopper, returning Usopp's goggles back to him. Usopp thanks Sanji, but later gets back with him when he realizes they're broken, telling him they were the latest and expensive model from North Blue. Sanji notices the commotion the rebel army is causing, telling Usopp and Chopper to hurry to the palace so they could somehow assist Vivi. Back at the palace, members of the royal army realize that Crocodile is at the palace, making their way there to defend Vivi. However, Miss All-Sunday uses her powers to use Dieciseis Fleur, sprouting a number of hands outside the palace gate to prevent the royal army members from entering. Having defeated more members of the royal army, along with Vivi's father, the king, Crocodile sarcastically thanks Vivi for sacrificing her life, along with her pirate friends. Vivi asks Crocodile where Luffy is, and Crocodile replies to her that he is dead, however Vivi does not believe him. Crocodile comments that he has no intention of sparing Vivi or her father, saying that when a palace falls, the royal family should fall along with it. Crocodile asks Cobra where Pluton is, much to the shock of the royal king, wondering how Crocodile knows that name.\nMeanwhile, Nami is still fighting with Miss Doublefinger, as the Baroque Works agent corners her against a wall. Telling Nami that she is playing around with a toy, Miss Doublefinger says that true weapons are made solely for the purpose of terminating Life as Nami escapes her attack. Nami tries to think of a way to create an opening so her ultimate attack would not miss, as Miss Doublefinger comments that a wool sweater could produce more electricity than her Thunder Ball. Nami, wishing to create more moisture in the air, tries to use a \"Rain Tempo\" attack, but she only manages to create small fountains. Wishing to end the fight, Miss Doublefinger attacks Nami with Sea Urchin Stinger, while Nami dodges, shooting out many Cool Balls. Nami then shoots out many Heat Balls, having some kind of plan in mind.\nMiss Doublefinger then attacks Nami with Toge Toge Doping. Barely dodging the attack, Nami notices her plan worked, creating a (small) cloud in the air. Wanting to make it grow bigger, Nami shoots out even more Heat Balls and Cool Balls, and then one Thunder Ball at the cloud, creating the Thunderbolt Tempo, electrocuting Miss Doublefinger and severely injuring her. Enraged, Miss Doublefinger attacks Nami, however it is another mirage, and Nami tells Miss Doublefinger to watch out for tornadoes.\n\n"
}