{
  "chapter_number": "Chapter 178",
  "title": "Level G.L.",
  "short_summary": "The chapter begins with Crocodile fighting with Luffy. Crocodile creates a giant hole of quicksand, which surprises Luffy. Luffy escapes the quicksand and tries to attack Crocodile several times, but Crocodile is not effected. Crocodile attacks Luffy and makes his hand wither with his power, which makes Luffy panic. Luffy remembers the water Toto gave him and revives himself, yelling that Toto stated Yuba would never lose to sand. Luffy uses a new technique that probably comes from Wapol and eats the top half of Crocodile, which enrages him. Crocodile tells Luffy to die along with Yuba, and creates a sandstorm. Meanwhile in Rainbase, people worries about the sandstorm they see. Tashigi tells Smoker about it, which he simply looks on at. On Hasami, the rest of the Straw Hats also talk about the sandstorm. Vivi tells them that it is \"him\". Back at the scene, Crocodile tells Luffy his intentions on sending this sandstorm to Yuba, which enrages Luffy. Luffy tries to stop Crocodile, but gets stabbed by Crocodile's hook. Crocodile tells Luffy that rookies like him are swarming all over the Grand Line.\n",
  "long_summary": "Crocodile asks Luffy if they can end the games to which Luffy responds that he has been fighting seriously, Crocodile then comments that they are pirates in two different leagues and attacks Luffy with his escada attack, fortunately Luffy manages to get out of the way in time. Luffy is astonished at Crocodile's power while Crocodile comments that he does not just posses his devil fruit ability like some people, he mastered it and demonstrates this by creating a hole of quicksand. While Luffy is struggling to leave the pit, Crocodile comments that no one can contend with him while in the desert, though Luffy finally manages to get out of the pit. Luffy then comments that if he cannot beat Crocodile, then he will catch him, but this also fails and Crocodile shows Luffy more of his abilities by mummifying his right arm. Crocodile then explains that he merely sucked the water out of his arm, this causes Luffy to run to his water bottle and drink causing Crocodile to comment about it being ridiculous, and Luffy counters saying it is not ridiculous and tells Crocodile the story of Yuba. Luffy then charges Crocodile and literally bites his head off, but Crocodile manages to escape from Luffy's mouth and comment that it is time for him and Yuba to die, Crocodile then creates a sandstorm while commenting on the dryness of the sand that day. Meanwhile people all across Arabasta notice the sandstorm with Vivi realizing that it is Crocodile's doing, Crocodile begins to tell Luffy how strange it is that Yuba keeps getting hit by sandstorms Luffy then puts two and two together, and enraged attacks Crocodile only to be impaled by his hook, while Crocodile comments that pirates like him are coming on the grand line.\n\n"
}