{
  "chapter_number": "Chapter 137",
  "title": "Avalanche",
  "short_summary": "Sanji and Luffy try to evade the avalanche created by the lapahn. While they attempt to flee to a high point, they continue to be chased by the ferocious animals. In order to save Nami, Sanji sacrifices himself and throws Luffy and Nami to a safe place and is hit by the full front of the avalanche.\n",
  "long_summary": "Usopp and Vivi and the villagers are fleeing from the avalanche.\nElsewhere, Luffy and Sanji try to find higher ground but are unable to escape the avalanche. Luffy grabs a tree and rides it like a sled as he grabs Sanji. They are confronted by more lapahns who throw trees at them, but Sanji kicks Luffy away while he takes the brunt of the attack and saves his friends. Luffy tries to grab Sanji's hand but only grabs his glove.\nMeanwhile, the villagers are freaking out about the avalanche, as well as Wapol who flees on his pet.\nLuffy dives into the snow to retrieve Sanji. After the avalanche has hit and the village is covered, Wapol eats his way out and blames the avalanche on the Straw Hats as an elaborate plot to attack him.\nLuffy finds Sanji and begins to bring him back up the mountain. As he passes by a buried lapahn, he also pulls out the parent lapahn. The baby and adult lapahn are shocked that a human has helped them. Luffy is soon found by Wapol's men.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro (cover)",
    "Nami",
    "Usopp",
    "Sanji",
    "Wapol",
    "Chess",
    "Kuromarimo",
    "Robson",
    "Nefertari Vivi"
  ],
  "ssum_frequencies": [
    [
      "to",
      6
    ],
    [
      "the",
      5
    ],
    [
      "and",
      4
    ],
    [
      "by",
      3
    ],
    [
      "sanji",
      2
    ],
    [
      "luffy",
      2
    ],
    [
      "avalanche",
      2
    ],
    [
      "they",
      2
    ],
    [
      "a",
      2
    ],
    [
      "nami",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      15
    ],
    [
      "and",
      9
    ],
    [
      "luffy",
      7
    ],
    [
      "to",
      6
    ],
    [
      "are",
      5
    ],
    [
      "avalanche",
      5
    ],
    [
      "sanji",
      5
    ],
    [
      "as",
      5
    ],
    [
      "a",
      4
    ],
    [
      "he",
      4
    ],
    [
      "his",
      4
    ],
    [
      "but",
      3
    ],
    [
      "grabs",
      3
    ],
    [
      "by",
      3
    ],
    [
      "out",
      3
    ],
    [
      "lapahn",
      3
    ],
    [
      "villagers",
      2
    ],
    [
      "who",
      2
    ],
    [
      "them",
      2
    ],
    [
      "attack",
      2
    ]
  ]
}