{
  "chapter_number": "Chapter 39",
  "title": "For Whom the Bell Tolls",
  "short_summary": "Kuro continues attacking his crew until Luffy tells him to fight him instead. Luffy ends up wrapping his elongated limbs around Kuro so that he cannot escape and wins their fight by using a headbutt. At the same time, Jango is about to kill Kaya after beating Usopp Pirates. But Usopp and Zoro intervene and save Kaya from Jango.\n",
  "long_summary": "Luffy and Nami are still watching as Kuro continues to cut up the other Black Cat Pirates. Suddenly, Luffy is wounded by Kuro but he keeps his ground and grabs Kuro's jacket and throws him to the ground. Kuro mocks Luffy, saying he should have stood still so Kuro could kill him easier, and because Luffy stops him moving, his crew are still alive and suffering. Kuro goes to do his move again, but this time Luffy grabs him and holds him tight. Kuro is unable to move.\nIn the forest, Kaya agrees to sign the will if Jango stops hurting the Usopp Pirates. Jango throws them against trees and turns to Kaya, who has his hypnotizing ring and threatens to kill herself with it if he does not do what she says. Jango panics, because if he does not get the will signed before her death he is in trouble. While Kaya signs the will, the Usopp pirates pretend to be hurt. They discuss their options and agree that just because their losing does not mean they can run away. With the will signed, Jango now prepares himself to kill Kaya.\nZoro and Usopp spot them. Zoro tosses Usopp aside to stop Jango. As Jango goes in for the kill the Usopp Pirates ram a shovel between the cheeks of his rear. Angrily he kicks them aside and goes to kill Kaya, stating to Zoro he is too late to save her. But Zoro states it wasn't his goal to do so, he cuts some branches blocking a clear shot of Jango from Usopp. With the branches out of the way, Usopp now can fire a clear shot at Jango with his slingshot.\nBack at the coastline, Kuro's crew cheer Luffy on. Luffy throws his head back and stretches his neck far enough back to tell the Black Cat pirates to stop cheering for him. Kuro in shock just keeps on about how his plan will not fail.\nJango is hit by Usopp's slingshot and at that same moment, Kuro also falls as Luffy pulls his head back and rams it into Kuro.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Buggy (cover)",
    "Kuro",
    "Jango",
    "Kaya",
    "Usopp",
    "Piiman",
    "Ninjin",
    "Tamanegi",
    "Big Bird (cover)",
    "Big Bird's Children (cover)"
  ],
  "ssum_frequencies": [
    [
      "and",
      3
    ],
    [
      "kuro",
      2
    ],
    [
      "his",
      2
    ],
    [
      "luffy",
      2
    ],
    [
      "him",
      2
    ],
    [
      "to",
      2
    ],
    [
      "fight",
      2
    ],
    [
      "jango",
      2
    ],
    [
      "kaya",
      2
    ],
    [
      "usopp",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      16
    ],
    [
      "the",
      16
    ],
    [
      "and",
      14
    ],
    [
      "his",
      11
    ],
    [
      "kuro",
      9
    ],
    [
      "jango",
      9
    ],
    [
      "luffy",
      8
    ],
    [
      "he",
      8
    ],
    [
      "usopp",
      7
    ],
    [
      "him",
      6
    ],
    [
      "pirates",
      5
    ],
    [
      "is",
      5
    ],
    [
      "kill",
      5
    ],
    [
      "kaya",
      5
    ],
    [
      "will",
      5
    ],
    [
      "in",
      4
    ],
    [
      "with",
      4
    ],
    [
      "not",
      4
    ],
    [
      "zoro",
      4
    ],
    [
      "back",
      4
    ]
  ]
}