{
  "chapter_number": "Chapter 106",
  "title": "The Town of Welcome",
  "short_summary": "The Straw Hat Pirates have a hard time with the unpredictable weather of the Grand Line, but thanks to Nami's navigational skills, they arrive safely at their first island, Whisky Peak, where they receive an unexpected warm welcome from the townsfolk.\n",
  "long_summary": "After their departure from Twin Cape, the Straw Hat Pirates start their journey on the Grand Line. However Nami has a hard time understanding the Grand Line's unpredictable and wild climate when lightning follows a blizzard. Things get worse when Miss Wednesday asks her if she has checked her Log Pose and she realizes their ship is going the wrong way after just a few moments of inattention. The next hour is a non-stop fight against the inconsistent weather.\nFinally, the Straw Hat Pirates manage to reach a period of calm. Everyone takes this opportunity to rest except Zoro who finally wakes up. When he is about to ask Miss Wednesday and Mr. 9 about their real motivation, Nami punches him for sleeping while the rest struggled against the weather. However, she is now fully confident in her navigation skills in the Grand Line for the future, as she feels more comfortable with the climate patterns.\nSoon the Whisky Peak, Miss Wednesday and Mr. 9's island, comes into view. While the two take this opportunity to leave the ship and jump overboard the Straw Hat Pirates wonder how their first Grand Line island experience will play out. They ponder if it has monsters, enemies, and so forth. But against all expectations, they receive a cheerful welcome from the inhabitants who invite them to a party.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Garp (cover)",
    "Bogard (cover)",
    "Koby (cover)",
    "Helmeppo (cover)",
    "Igarappoi",
    "Miss Catherina",
    "Mr. Beans",
    "Mr. 9",
    "Miss Wednesday",
    "Mr. 13",
    "Miss Friday"
  ],
  "ssum_frequencies": [
    [
      "the",
      4
    ],
    [
      "they",
      2
    ],
    [
      "straw",
      1
    ],
    [
      "hat",
      1
    ],
    [
      "pirates",
      1
    ],
    [
      "have",
      1
    ],
    [
      "a",
      1
    ],
    [
      "hard",
      1
    ],
    [
      "time",
      1
    ],
    [
      "with",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      17
    ],
    [
      "a",
      7
    ],
    [
      "and",
      6
    ],
    [
      "their",
      5
    ],
    [
      "to",
      5
    ],
    [
      "grand",
      4
    ],
    [
      "she",
      4
    ],
    [
      "is",
      4
    ],
    [
      "straw",
      3
    ],
    [
      "hat",
      3
    ],
    [
      "pirates",
      3
    ],
    [
      "line",
      3
    ],
    [
      "has",
      3
    ],
    [
      "when",
      3
    ],
    [
      "miss",
      3
    ],
    [
      "wednesday",
      3
    ],
    [
      "her",
      3
    ],
    [
      "against",
      3
    ],
    [
      "after",
      2
    ],
    [
      "from",
      2
    ]
  ]
}