{
  "chapter_number": "Chapter 165",
  "title": "Operation Utopia",
  "short_summary": "Despite Koza not being in Yuba, Vivi and the crew did not give up on stopping the rebellion. But, they first allow themselves a good rest. Meanwhile, Baroque Works' top members meet together in Rain Dinners. They discover that their leader, Mr. 0, is no other than Crocodile. After the initial shock, Crocodile reveals to them his plan to become the ruler of Arabasta, thus creating their own utopia. The plans begin the next morning at 7 AM. Next morning, Toto gives Luffy a precious barrel of oasis water he helped to recover the other night. The Straw Hats then depart for their next destination. But suddenly, Luffy decides to stop moving on.\n",
  "long_summary": "Remembering when Mr. Toto left Yuba, Vivi offers him a tissue and promises to stop the rebellion, the crew then decides to stay the night while Mr. Toto, and Luffy continue to dig for water. Meanwhile, the top brass of Baroque Works meet up, but are awaiting for Mr. 0, suddenly Miss All Sunday shows up and reveals that they are in Rain Dinners, a casino owned by Crocodile. It is also revealed that the leader is Crocodile himself and that he has been there the whole time, which surprises all the members, he then explains his \"Utopia\" plan. The next day, the Straw Hats are preparing to leave Yuba, and Mr. Toto gives them some water for their journey, but Luffy suddenly decides to quit.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Tony Tony Chopper",
    "Nefertari Vivi",
    "Toto",
    "Crocodile",
    "Miss All Sunday",
    "Mr. 1",
    "Miss Doublefinger",
    "Mr. 2 Bon Kurei",
    "Mr. 4",
    "Miss Merry Christmas",
    "Matsuge"
  ],
  "ssum_frequencies": [
    [
      "the",
      8
    ],
    [
      "to",
      4
    ],
    [
      "their",
      3
    ],
    [
      "next",
      3
    ],
    [
      "not",
      2
    ],
    [
      "in",
      2
    ],
    [
      "on",
      2
    ],
    [
      "but",
      2
    ],
    [
      "they",
      2
    ],
    [
      "a",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      9
    ],
    [
      "and",
      5
    ],
    [
      "to",
      5
    ],
    [
      "mr",
      4
    ],
    [
      "toto",
      3
    ],
    [
      "for",
      3
    ],
    [
      "are",
      3
    ],
    [
      "that",
      3
    ],
    [
      "yuba",
      2
    ],
    [
      "a",
      2
    ],
    [
      "then",
      2
    ],
    [
      "decides",
      2
    ],
    [
      "luffy",
      2
    ],
    [
      "water",
      2
    ],
    [
      "up",
      2
    ],
    [
      "but",
      2
    ],
    [
      "suddenly",
      2
    ],
    [
      "all",
      2
    ],
    [
      "crocodile",
      2
    ],
    [
      "is",
      2
    ]
  ]
}