{
  "chapter_number": "Chapter 61",
  "title": "The Demon",
  "short_summary": "Sanji and Gin start to fight but their strength is equal. Meanwhile, Luffy attacks Don Krieg, but the armored pirate does not want a direct fight and, instead, pushes back Luffy by throwing needles at him. At the same time, Gin has made a decisive move toward Sanji, but when he is about to give the final blow, he stops himself in tears, unable to kill the only man who has ever shown him kindness.\n",
  "long_summary": "Sanji and Gin fight but their attacks cause little damage. They find their abilities are equally matched. The Krieg Pirates estimate that Gin will lose, but Don Krieg says Gin's fighting abilities will no give out. He explains that Gin is a calm and collected \"Demon\". He tells them that Gin can kill his opponents without pardon and many people have called him \"The Demon\". That's why he had placed him as the battle commander in his armada. Due to his injuries from fighting with Pearl, Sanji is cornered by Gin. Patty and the other Baratie cooks become worried.\nMeanwhile, Luffy attacks Don Krieg, but Don Krieg releases his armor and plans to kill Luffy. He shoots Luffy with bombs and spears. That spears impale Luffy's foot, and he almost falls into the ocean. Luffy asks if Don Krieg is not serious to fight him directly. Krieg answers the most important skill in fighting is to kill the opponent. Krieg jeers that Luffy is a monkey because he attacks without strategy.\nDon Krieg's Pirates scream that Sanji's bone is broken. Gin roughs up Sanji ten times. Gin attacks Sanji and brings him close to his death. Krieg's Pirates cheer at Gin's win. When Gin prepares to execute Sanji, he remembers how Sanji gave him food. Gin begins crying. He admits he cannot kill the only man who treated him kindly in his entire life.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro (cover)",
    "Nami (cover)",
    "Usopp (cover)",
    "Krieg",
    "Gin",
    "Zeff",
    "Sanji",
    "Patty",
    "Carne"
  ],
  "ssum_frequencies": [
    [
      "the",
      4
    ],
    [
      "to",
      3
    ],
    [
      "but",
      3
    ],
    [
      "sanji",
      2
    ],
    [
      "and",
      2
    ],
    [
      "gin",
      2
    ],
    [
      "fight",
      2
    ],
    [
      "is",
      2
    ],
    [
      "luffy",
      2
    ],
    [
      "a",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "gin",
      9
    ],
    [
      "he",
      9
    ],
    [
      "and",
      8
    ],
    [
      "the",
      8
    ],
    [
      "krieg",
      7
    ],
    [
      "sanji",
      6
    ],
    [
      "that",
      6
    ],
    [
      "is",
      6
    ],
    [
      "his",
      6
    ],
    [
      "him",
      6
    ],
    [
      "to",
      6
    ],
    [
      "don",
      5
    ],
    [
      "luffy",
      5
    ],
    [
      "attacks",
      4
    ],
    [
      "kill",
      4
    ],
    [
      "but",
      3
    ],
    [
      "pirates",
      3
    ],
    [
      "fighting",
      3
    ],
    [
      "in",
      3
    ],
    [
      "fight",
      2
    ]
  ]
}