{
  "chapter_number": "Chapter 41",
  "title": "To the Sea",
  "short_summary": "As thanks for their help, Kaya and Merry are giving a ship to the crew: the Going Merry. Usopp has made his luggage to become a pirate captain, but Luffy and the others propose to him to join them instead. After their departure, Merry tells Kaya about Usopp's childhood through a flashback.\n",
  "long_summary": "After a hard battle, Nami, Luffy and Zoro are seen eating in a local restaurant. Suddenly Kaya enters and asks if she can have a word with them. Elsewhere Usopp sits at home after packing his bag, he states it's time to leave his home, however he packed his bag with so much stuff he cannot get out of the door. He rolls away after breaking the door getting out. After rolling away from his house, he smiles and collects his things up again.\nElsewhere, Merry and Kaya show the Straw Hat Pirates the ship they intend to give them, the Going Merry. Nami comments on it being a caravel. Merry explains that he designed the Merry and explains its rudder system, which Nami interrupts and says to just explain it to her. Kaya mentions she stocked up the Going Merry with the necessary food, which Luffy thanks her for, Zoro however tells him off when he gets his thanks wrong (see chapter notes).\nEveryone's attention is drawn towards Usopp who is rolling down the slope. Luffy and Zoro stop him using their feet before he hits the ship. When Usopp says he will head out to sea and meet them someday, Luffy and Zoro tell him to just shut up and get on board the ship with them as captain, which Luffy instantly states is his job.\nNinjin, Tamanegi, and Piiman watch them leave, taking their former captain with them. They are happy that although Usopp always lived alone, he is surrounded by strong people now. Piiman has an idea suddenly.\nElsewhere also watching them leave, Merry and Kaya talk. Merry tells Kaya of Usopp's past. When Usopp was young, his father Yasopp left to become a pirate, leaving behind his wife and child, Usopp. His mother fell sick and the day before her death Usopp ran through the village calling that the Pirates are coming, his father was returning to take them away. She knew he was lying, but stated she was proud she had married him and happy he left to pursue his dream and believed that one day he would become as strong as his father. Usopp cried trying to stop her from talking as though she was about to die. \nAfter his mother's death, Usopp was then alone, but he continued to call \"the pirates are coming\", even though he had no need to. Merry stated Kaya needs to continue on and be strong so she does not suffer as he used to as a repayment to him for saving her.\nAs the crew of the Straw Hat Pirates celebrates a new member and ship, back in the village the three former Usopp pirates prepare themselves. As they call \"The pirates are coming\", Kaya tells Merry she wants to become a doctor someday.\n\n\n"
}