{
  "chapter_number": "Chapter 133",
  "title": "Adventure in a Nameless Country",
  "short_summary": "The Straw Hats are guided by Dalton, the guard captain, to Bighorn, a village of Drum Island. There is only one doctor on the island, Dr. Kureha, who lives in a castle at the top of a steep mountain. To reach her quickly, Luffy and Sanji decide to climb the mountain, carrying Nami on their back.\n",
  "long_summary": "Dalton, the guard of the island, leads the Straw Hats toward his village. Zoro and Karoo stay behind to guard the Going Merry. The island seems to be in an important time of its history since strange things are hinted: it has no name, the villagers are making a police force, and an election is about to occur. But to the Straw Hats' misfortune, there is only one doctor—a 140 year old lady, Dr. Kureha—whom the villagers call a witch. She lives in a castle at the top of a steep mountain and only comes down to treat patients when she so desires. However, according to Dalton, she is very skillful at her practice.\nWith Nami's fever climbing, Luffy decides to climb the mountain instead of waiting for the doctor. Nami agrees and Luffy and Sanji depart with the sick girl on Luffy's back.\nDalton explains to Vivi and Usopp that their country has recently been attacked by a handful of pirates led by Blackbeard. However, in their misfortune, it allowed them to get rid of their king tyrant: Wapol!\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Blackbeard (shadowed)",
    "Van Augur (shadowed)",
    "Jesus Burgess (shadowed)",
    "Doc Q (shadowed)",
    "Laffitte (shadowed)",
    "Wapol (flashback)",
    "Dalton",
    "Kureha (shadowed)",
    "Tony Tony Chopper (shadowed)",
    "Negikuma Maria",
    "Nefertari Vivi",
    "Karoo",
    "Hiking Bear"
  ],
  "ssum_frequencies": [
    [
      "the",
      5
    ],
    [
      "to",
      3
    ],
    [
      "a",
      3
    ],
    [
      "of",
      2
    ],
    [
      "island",
      2
    ],
    [
      "on",
      2
    ],
    [
      "mountain",
      2
    ],
    [
      "straw",
      1
    ],
    [
      "hats",
      1
    ],
    [
      "are",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      12
    ],
    [
      "to",
      9
    ],
    [
      "of",
      6
    ],
    [
      "and",
      6
    ],
    [
      "a",
      5
    ],
    [
      "dalton",
      3
    ],
    [
      "in",
      3
    ],
    [
      "is",
      3
    ],
    [
      "she",
      3
    ],
    [
      "their",
      3
    ],
    [
      "guard",
      2
    ],
    [
      "island",
      2
    ],
    [
      "straw",
      2
    ],
    [
      "hats",
      2
    ],
    [
      "an",
      2
    ],
    [
      "are",
      2
    ],
    [
      "it",
      2
    ],
    [
      "has",
      2
    ],
    [
      "villagers",
      2
    ],
    [
      "misfortune",
      2
    ]
  ]
}