{
  "chapter_number": "Chapter 172",
  "title": "Rebellion",
  "short_summary": "The final stage of Baroque Works' plan is put into action. Both the Rebel and Royal armies prepare to fight. Crocodile explains his grand scheme to Vivi, the Straw Hats and Smoker. Despite the dire situation, Vivi stills believes she can prevent the impending war.\n",
  "long_summary": "The town of Nanohana is in an uproar as the citizens attempt to put out the fires started by the 'Royal Guards'. Mr. 1 and Miss Doublefinger move to meet Mr. 2 at the edge of town. While Mr. 2 is escaping the ensuing chaos, he is spotted by a young boy, Kappa, who realizes that the 'King' is in fact an imposter. However, before he can alert anyone, he bumps into Mr. 1 and Miss Doublefinger, who decide to take action to prevent the word from getting out. A citizen finds the boy's near lifeless body, but mistakes Kappa's attempts to convey the deception as cries of pain. Upon seeing the wounded boy, a wounded Koza makes the decision to attack immediately. Seemingly serendipitously, the ship that crashed into the harbor was carrying weapons. Koza orders an all-out attack on Alubarna. Meanwhile, in the palace, Chaka is in disbelief at the message brought to him regarding the king appearing in Nanohana. The situation rapidly declining, and the number of rebels rising as news of what happened in Nanohana spread throughout the country, Chaka steels himself and makes the decision to defend the capital and push back the rebellion.\nIn Rainbase, Crocodile perversely explains his scheme in front of a distraught Vivi, the captured Straw Hat Pirates and Smoker. He recounts the many years of planning and dedication it took to reach where he is today. Vivi, tied to a chair, knocks herself down and attempts to crawl away, still set on cutting off the rebels before they reach Alubarna and preventing the bloodshed. An amused Crocodile tells Vivi that he and Miss All Sunday are on their way to the capital to meet her father. Showing her the key to the cage that holds Luffy and his crew, he tells her she is free to join them if she wishes, then throws the key down a trap-door into a pit of Bananawani.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Garp (cover)",
    "Smoker",
    "Hina (cover)",
    "Fullbody (cover)",
    "Jango (cover)",
    "Koby (cover)",
    "Helmeppo (cover)",
    "Nefertari Vivi",
    "Chaka",
    "Koza",
    "Erik",
    "Farafra",
    "Kebi",
    "Kappa",
    "Crocodile",
    "Miss All Sunday",
    "Mr. 1",
    "Miss Doublefinger",
    "Mr. 2 Bon Kurei",
    "Akumai",
    "Banchi"
  ],
  "ssum_frequencies": [
    [
      "the",
      5
    ],
    [
      "and",
      2
    ],
    [
      "to",
      2
    ],
    [
      "vivi",
      2
    ],
    [
      "final",
      1
    ],
    [
      "stage",
      1
    ],
    [
      "of",
      1
    ],
    [
      "baroque",
      1
    ],
    [
      "works",
      1
    ],
    [
      "plan",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      31
    ],
    [
      "to",
      15
    ],
    [
      "and",
      11
    ],
    [
      "of",
      8
    ],
    [
      "in",
      8
    ],
    [
      "is",
      7
    ],
    [
      "he",
      7
    ],
    [
      "a",
      7
    ],
    [
      "an",
      4
    ],
    [
      "mr",
      4
    ],
    [
      "that",
      4
    ],
    [
      "nanohana",
      3
    ],
    [
      "as",
      3
    ],
    [
      "miss",
      3
    ],
    [
      "into",
      3
    ],
    [
      "on",
      3
    ],
    [
      "vivi",
      3
    ],
    [
      "her",
      3
    ],
    [
      "town",
      2
    ],
    [
      "out",
      2
    ]
  ]
}