{
  "chapter_number": "Chapter 109",
  "title": "Responsibility Problem",
  "short_summary": "Mr. 8, Mr. 9, and Miss Wednesday are the only ones left in Zoro's way. Despite their weapons and techniques, Zoro initially manages to overpower him. Mr. 9 manages to tie Zoro's arm up and Miss Wednesday takes Luffy hostage, but Zoro sends Mr. 9 flying into Miss Wednesday before cutting down Mr. 8 and winning the battle.\n",
  "long_summary": "Mr. 8, Mr. 9, and Miss Wednesday are shaken and angered by their forces' inability to take down Zoro. Intent on fulfilling their responsibility to watch over this town, Mr. 8 takes out his saxophone and blows into it, which shoots bullets at Zoro. Zoro dodges the shots, and Mr. 9 and Miss Wednesday go on the move. While Mr. 9 leaps up toward the roof, Miss Wednesday mounts her duck Karoo to use its great speed to pursue Zoro. Karoo has trouble following Miss Wednesday's directions, and Mr. 9 performs acrobatic flips to attack Zoro from behind with two metal bats. He is cocky about the power of his bats, and warns Zoro to not let his swords get chipped, but Zoro manages to unnerve him by merely quickly drawing his sword and pointing it at the agent. Mr. 9 loses his composure as he swats recklessly at Zoro's sword, and Zoro wonders where his acrobatic finesse went. Mr. 9 decides to show it to him again and does a backflip, but ends up jumping off the roof and crashing to the ground.\nZoro wonders if anyone here is more competent when Miss Wednesday confronts him. She performed a dance, using the spiral design of her top to make Zoro dizzy. Zoro was overwhelmed by the dance, and Miss Wednesday charged at him to finish him off with her Peacock Slashers. However, Karoo moved so that her weapon-carrying hand was on the wrong side, and Miss Wednesday rode off the roof. Zoro was ashamed that he had to fight these people, but had to quickly dodge more of Mr. 8's shots. Zoro cut a hole in the roof and went down to the ground, where he hid in an alley and encountered Mr. 9 again. Mr. 9 extended the tip of one of his bats with an iron rope, tying up one of Zoro's arms with it. Miss Wednesday then brought out the sleeping Luffy, threatening to kill him if Zoro moved. Mr. 8 fires at Zoro with guns in his hair, but Zoro pulls on the rope, sending Mr. 9 flying into the path of the explosive shots. Zoro then throws Mr. 9 at Miss Wednesday and Karoo, sending them flying away from Luffy. Using Luffy's inflated body as a trampoline, Zoro bounces up to Mr. 8, cutting him down with a single slash as the battle comes to an end.\n\n",
  "characters": [
    "Monkey D. Luffy (K.O.)",
    "Roronoa Zoro",
    "Koby (cover)",
    "Helmeppo (cover)",
    "Mr. 8",
    "Mr. 9",
    "Miss Wednesday",
    "Karoo"
  ],
  "ssum_frequencies": [
    [
      "mr",
      5
    ],
    [
      "and",
      4
    ],
    [
      "9",
      3
    ],
    [
      "miss",
      3
    ],
    [
      "wednesday",
      3
    ],
    [
      "8",
      2
    ],
    [
      "the",
      2
    ],
    [
      "zoros",
      2
    ],
    [
      "zoro",
      2
    ],
    [
      "manages",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      19
    ],
    [
      "to",
      18
    ],
    [
      "zoro",
      18
    ],
    [
      "and",
      16
    ],
    [
      "mr",
      15
    ],
    [
      "9",
      10
    ],
    [
      "miss",
      9
    ],
    [
      "wednesday",
      8
    ],
    [
      "his",
      8
    ],
    [
      "of",
      7
    ],
    [
      "him",
      7
    ],
    [
      "at",
      6
    ],
    [
      "with",
      6
    ],
    [
      "a",
      5
    ],
    [
      "8",
      4
    ],
    [
      "on",
      4
    ],
    [
      "it",
      4
    ],
    [
      "up",
      4
    ],
    [
      "roof",
      4
    ],
    [
      "her",
      4
    ]
  ]
}