{
  "chapter_number": "Chapter 97",
  "title": "Sandai Kitetsu",
  "short_summary": "Zoro goes to the Arms Shop to buy swords, and with the help of the woman he met earlier he finds the high-grade Sandai Kitetsu. After testing his luck against the cursed blade by playing roulette with it and emerging intact, the owner Ipponmatsu agrees to give him the sword as well as his prized heirloom Yubashiri. Unbeknownst to Zoro, the woman is actually a Marine named Tashigi, who wishes to retrieve all the high-grade swords from criminals like himself, although she does not know who he is.\n",
  "long_summary": "Nami tries on several outfits which the owner swoons over, only to not buy any of them. Meanwhile, Luffy stands in front of Roger's execution platform and reflects on the event that happened there that started the Great Age of Pirates. Elsewhere, Zoro is still flustered after encountering a woman who looks just like Kuina and is also a swordsman to boot. Assured that he will not see her again, Zoro heads to the Arms Shop, where he is greeted by the owner Ipponmatsu. Zoro asks to buy two swords with 100,000, and Ipponmatsu says that he can only sell blunt, low-quality swords for that little money. He then recognizes Wado Ichimonji on Zoro's hip in shock, and asks to see it. After confirming that it is Wado Ichimonji, he tries to lowball it and buy it from Zoro for 200,000. Zoro refuses to sell it, even when Ipponmatsu triples his bid.\nRight then, the woman Zoro met comes in and immediately recognizes Wado. She reveals that it is one of the 21 O Wazamono grade swords and is worth no less than 1,000,000, to Ipponmatsu's horror. He shouts at the woman, threatening to sue her for obstruction of business, and tosses her her sword Shigure that she came to pick up. She ends up crashing into a display rack, and he yells at her to clean it up before admitting to Zoro that his sword is indeed as valuable as the woman claimed. Not caring to understand what the earlier exchange was about, Zoro goes back to pick out some of the low-quality swords when the woman recognizes him. Not knowing who he is, she states that his three swords remind her of Zoro, and condemns how Zoro uses his blades to make money. She laments how the famous swordsmen who possess all the highest quality swords now are all criminals, saying the blades are crying. Ipponmatsu states that he has no problem with criminals, as they were his customers before Smoker gained authority over the town; he considers Smoker a \"monster\" due to being a Devil Fruit user. The woman vows to retrieve all the high-grade swords that are being used for evil.\nShe then spots Sandai Kitetsu, another high-grade sword worth over 1,000,000, being sold for 50,000. After hearing of its real value, Ipponmatsu refuses to sell it, and Zoro notes that it is cursed. Ipponmatsu confirms this, stating that like its predecessors, its wielders have suffered tragic deaths. Zoro still wants to buy it, but Ipponmatsu still refuses to sell it despite the urging of his wife. Zoro then offers to test its curse against his luck as he tosses it into the air and holds out his arm. Despite its unparalleled sharpness, Sandai Kitetsu does not leave a scratch on Zoro as it spins around his arm, causing Ipponmatsu to fall down in shock. Zoro then tells the woman to pick out another sword for him, but Ipponmatsu presents him with Yubashiri, a Ryo Wazomono grade sword that is the best one he owns. He lets Zoro take it and Sandai Kitetsu for free, apologizing for trying to trick him and being impressed over the latter sword's selection of him. Zoro then leaves, and Ipponmatsu's wife is surprised that he gave away their family heirloom. Ipponmatsu replies that he has entrusted his dream to Zoro, and as his wife sends him to clean the bathtub, the woman is left kneeling in awe at what she just witnessed.\nAt the Marine Station, Smoker asks where Master Chief Petty Officer Tashigi is. A subordinate states that she went to pick up her sword at the Arms Shop, and Smoker tells him to go bring her back as he had gotten an eyewitness report about pirates. He curses Tashigi to himself, calling her the shame of the Marines. Meanwhile, Sanji stares lovestruck at a beautiful woman standing nearby on the street.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Sanji",
    "Alvida",
    "Bogard (cover)",
    "Smoker",
    "Tashigi",
    "Koby (cover)",
    "Helmeppo (cover)",
    "Hanger",
    "Ipponmatsu",
    "Ipponume"
  ],
  "ssum_frequencies": [
    [
      "the",
      9
    ],
    [
      "to",
      5
    ],
    [
      "he",
      3
    ],
    [
      "zoro",
      2
    ],
    [
      "swords",
      2
    ],
    [
      "and",
      2
    ],
    [
      "with",
      2
    ],
    [
      "woman",
      2
    ],
    [
      "highgrade",
      2
    ],
    [
      "his",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      30
    ],
    [
      "to",
      29
    ],
    [
      "that",
      18
    ],
    [
      "zoro",
      18
    ],
    [
      "and",
      17
    ],
    [
      "he",
      17
    ],
    [
      "it",
      14
    ],
    [
      "is",
      13
    ],
    [
      "of",
      11
    ],
    [
      "his",
      11
    ],
    [
      "ipponmatsu",
      10
    ],
    [
      "a",
      9
    ],
    [
      "woman",
      9
    ],
    [
      "her",
      9
    ],
    [
      "swords",
      8
    ],
    [
      "for",
      8
    ],
    [
      "she",
      8
    ],
    [
      "as",
      7
    ],
    [
      "him",
      7
    ],
    [
      "then",
      6
    ]
  ]
}