{
  "chapter_number": "Chapter 11",
  "title": "Flight",
  "short_summary": "Zoro, having sliced Buggy into pieces, turns his back on him and prepares to break Luffy out of his cage. However, Buggy reveals the abilities of his Devil Fruit, the Bara Bara no Mi, by stabbing Zoro in the back with a disembodied hand. Zoro flips the cannon that was initially aimed at Luffy back at the Buggy Pirates. The cannon fires, causing massive damage to the rooftop they were on. Zoro ignores Nami's complaints about needing to find a key to the cage and instead escapes while carrying the cage. When the Buggy Pirates recover, they find nothing, as the escapees are instead hiding on rooftops. Buggy, furious, declares war on them.\n",
  "long_summary": "Zoro stands seemingly victorious after slicing up Buggy. However, as he goes to free Luffy from his cage, Buggy's crew starts laughing. Nami questions to herself why the crew is doing so when Zoro suddenly finds himself struck in the side by a hand holding a knife. Buggy floats behind Zoro as he finds himself fighting the hand and boasts about his Devil Fruit powers, the Bara Bara no Mi.\nBuggy sees he missed Zoro's vital parts, but Zoro is still injured and finds that he needs rescuing even though he had initially come to rescue Luffy. While Nami is simply shocked about the whole thing, Luffy calls Buggy \"Big Nose\" while claiming he is a jerk for striking Zoro in the back. Buggy gets angry and sends his hand out again, this time to kill Luffy; however, Luffy grasps the knife between his teeth. As Luffy claims he will finish Buggy, Buggy and his crew laugh. Luffy tells Zoro to escape, but Nami does not understand. Zoro, however, gets the idea of what Luffy is going to do.\nZoro attempts to escape, but Buggy launches his Bara Bara no Hou. Zoro heads for the cannon and turns it over to face Buggy and his crew. Nami lights the fuse and the cannon fires at the Buggy Pirates, destroying part of the rooftop they're in. Zoro asks who Nami is and, while she says she is just a thief, Luffy tells him she is their navigator. Nami denies Luffy's statement and follows behind them. While Buggy's crew is down for the count, Zoro goes to Luffy and, ignoring the request to find a way to open the cage, he grabs it and makes a break for it before Buggy fully recovers. Buggy's crew begins to find their bearings and find all three of them gone, as well as the key to Luffy's cage. Buggy's crew starts to search the town, but Zoro and Luffy are on a rooftop. Furious, Buggy declares war on them.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Buggy",
    "Acrobatic Fuwas",
    "Nami"
  ],
  "ssum_frequencies": [
    [
      "the",
      11
    ],
    [
      "buggy",
      5
    ],
    [
      "zoro",
      4
    ],
    [
      "on",
      4
    ],
    [
      "to",
      4
    ],
    [
      "his",
      3
    ],
    [
      "back",
      3
    ],
    [
      "cage",
      3
    ],
    [
      "and",
      2
    ],
    [
      "luffy",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      18
    ],
    [
      "to",
      14
    ],
    [
      "and",
      13
    ],
    [
      "zoro",
      12
    ],
    [
      "buggy",
      12
    ],
    [
      "luffy",
      11
    ],
    [
      "is",
      9
    ],
    [
      "he",
      8
    ],
    [
      "his",
      7
    ],
    [
      "crew",
      7
    ],
    [
      "a",
      7
    ],
    [
      "nami",
      6
    ],
    [
      "as",
      5
    ],
    [
      "buggys",
      4
    ],
    [
      "bara",
      4
    ],
    [
      "but",
      4
    ],
    [
      "while",
      4
    ],
    [
      "for",
      4
    ],
    [
      "however",
      3
    ],
    [
      "cage",
      3
    ]
  ]
}