{
  "chapter_number": "Chapter 44",
  "title": "Three Cooks",
  "short_summary": "Deciding on how Luffy can repay the damages done to his restaurant, things quickly become violent when Luffy refuses the conditions. Meanwhile, the Baratie's staff walk in on Sanji holding a bloodied Fullbody off the ground, and after Zeff and Luffy crash down Fullbody is forced to leave. However one of his men arrives in a panic, and reports that a prisoner has escaped before said prisoner arrives, demanding food from the staff. After being rejected violently, Sanji finds the starving man outside and offers him food despite the other chefs decision, to which after witnessing this Luffy declares he will be his chef.\n",
  "long_summary": "Luffy is trying to work out a much shorter time for working at the Baratie then the one Zeff proposes. But Zeff states he did the damage and now must repair it. When Luffy rudely states he will not accept, Zeff kicks him with his peg leg and offers a much faster way of repairing his debt; have one of his legs cut off. Luffy refuses once more and berates Zeff causing the chef to kick at him once more.\nMeanwhile Patty is preparing himself to greet customers, although he means well in practice he is getting everything round the wrong way. To his horror, when he finally goes to work, Sanji is holding the bloodstained Fullbody by the neck. The two insult each other before breaking into a fight. However when Fullbody threatens to have the place shut down, Sanji simply states he cannot let the Marine live now. The other chefs grab Sanji to prevent the Marine from being killed, at that moment Zeff and Luffy come crashing through the ceiling. The two get up and continue to argue, Zeff's attention is drawn to Sanji as the other chefs plea for his behavior to stop. After stopping Sanji with a kick, Zeff kicks out Fullbody who comments these chefs are no better than pirates.\nAt that moment Fullbody's attention is drawn by one of his men who reports the prisoner has escaped from his cell and 7 of Fullbody's men could not stop him. Fullbody dismisses it, stating that he was starving when they found him and had gone for the last 3 days without any food given to him. When the Marine asks for forgiveness, the prisoner appears and shots the Marine to the ground with a single shot. He walks in and sits at a table with his feet up on it. Patty walks up to the man and treats him with respect to the horror of the other customers. When Gin threatens to pay for his food with bullets since he has no money, Patty clobbers the man, breaking one of Zeff's chairs. Patty kicks the man about to the cheering of the customers while Fullbody makes an escape.\nOutside the restaurant, the man lays hungry, Sanji appears and gives him food. Sanji is happy at the man's reactions, who comments its the best food he has had in his life. Luffy comments on he has found his chef.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro (cover)",
    "Nami (cover)",
    "Usopp (cover)",
    "Krieg (mentioned only)",
    "Gin",
    "Fullbody",
    "Zeff",
    "Sanji",
    "Patty"
  ],
  "ssum_frequencies": [
    [
      "the",
      7
    ],
    [
      "luffy",
      4
    ],
    [
      "and",
      4
    ],
    [
      "to",
      3
    ],
    [
      "his",
      3
    ],
    [
      "a",
      3
    ],
    [
      "after",
      3
    ],
    [
      "on",
      2
    ],
    [
      "staff",
      2
    ],
    [
      "in",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      32
    ],
    [
      "to",
      16
    ],
    [
      "he",
      11
    ],
    [
      "and",
      11
    ],
    [
      "his",
      11
    ],
    [
      "is",
      7
    ],
    [
      "him",
      7
    ],
    [
      "of",
      7
    ],
    [
      "sanji",
      7
    ],
    [
      "a",
      6
    ],
    [
      "at",
      6
    ],
    [
      "zeff",
      6
    ],
    [
      "when",
      6
    ],
    [
      "with",
      6
    ],
    [
      "luffy",
      5
    ],
    [
      "for",
      5
    ],
    [
      "fullbody",
      5
    ],
    [
      "one",
      4
    ],
    [
      "patty",
      4
    ],
    [
      "other",
      4
    ]
  ]
}