{
  "chapter_number": "Chapter 68",
  "title": "The Fourth",
  "short_summary": "Sanji becomes the fourth member of the Straw Hat Pirates.\n",
  "long_summary": "Luffy would like very much that Sanji becomes a member of his crew, but he cannot do it unless Sanji himself agrees which he never has so far. Suddenly, a strange animal arrives at the Baratie. It is none other than Yosaku, half eaten by a shark. He has come back to ask for Luffy's help. He has located Nami but can do nothing without Luffy's strength.\nWhile he is ok to depart, Sanji, to the surprise of every one, decides to go with them and becomes the Straw Hat Chef. He changed his mind when he heard that everybody wanted him to depart. As to comfort his decision, Zeff tells him that he regrets to have let him live.\nA nostalgic Zeff is seen remembering his restaurant history. When it is time for departure, everybody becomes serious. Patty and Carne even try an ultimate revenge attack on Sanji but it proves useless as he easily beats the two back. Then, from his balcony, Zeff reveals his true feelings by wishing Sanji good luck. These are the words that break the hypocritical atmosphere. In turn, Sanji shows his gratitude to the man who gave him everything and bows in respect. They depart in the middle of the joy and the tears and bid farewell to the Baratie!\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Sanji",
    "Nami (mentioned)",
    "Buggy (cover)",
    "Richie (cover)",
    "Zeff",
    "Patty",
    "Carne",
    "Kumate Tribe (cover)",
    "Yosaku",
    "Panda Shark"
  ],
  "ssum_frequencies": [
    [
      "the",
      2
    ],
    [
      "sanji",
      1
    ],
    [
      "becomes",
      1
    ],
    [
      "fourth",
      1
    ],
    [
      "member",
      1
    ],
    [
      "of",
      1
    ],
    [
      "straw",
      1
    ],
    [
      "hat",
      1
    ],
    [
      "pirates",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      11
    ],
    [
      "he",
      9
    ],
    [
      "to",
      9
    ],
    [
      "his",
      7
    ],
    [
      "sanji",
      6
    ],
    [
      "and",
      5
    ],
    [
      "that",
      4
    ],
    [
      "a",
      4
    ],
    [
      "it",
      4
    ],
    [
      "is",
      4
    ],
    [
      "him",
      4
    ],
    [
      "becomes",
      3
    ],
    [
      "of",
      3
    ],
    [
      "but",
      3
    ],
    [
      "has",
      3
    ],
    [
      "depart",
      3
    ],
    [
      "zeff",
      3
    ],
    [
      "in",
      3
    ],
    [
      "do",
      2
    ],
    [
      "baratie",
      2
    ]
  ]
}