{
  "chapter_number": "Chapter 114",
  "title": "The Course",
  "short_summary": "The Straw Hats decide to leave Whisky Peak in a hurry. Miss All Sunday meets them on their ship and offers them help by giving them an Eternal Pose which leads to a route unknown to the Baroque Works. However, Luffy destroys it and says that she has no right to decide their path. The crew follows the path their Log Pose indicates, which will lead them to Little Garden.\n",
  "long_summary": "Having just witnessed Igaram's ship get destroyed, Luffy immediately wakes up Sanji and Usopp. Grabbing them by Usopp's nose and Sanji's leg, he drags them out of the Whisky Peak Bar and gives them a rude awakening. Zoro, meanwhile, prepares the Going Merry to set sail. As everyone gathers at the Going Merry, Vivi expresses that she still wants to go around town to look for Karoo. To her surprise, she finds out that Karoo climbed on board the ship before even Zoro got in. With that matter settled, everyone prepares to set sail. At the same time, a mysterious figure emerges from the flames of the explosion that destroyed Igaram's ship.\nDue to their rude awakening, Sanji and Usopp do not know anything and protest to stay in town a little longer. Fortunately, Nami explains everything to them with a conk in their heads. As the Going Merry sails from Whisky Peak, the crew find out that someone else is on board. The person is the mysterious figure that came out of explosion and is Miss All Sunday. It is explained then that not only was she the one who blew Igaram's ship, but she also she is Crocodile's partner and Vice President of Baroque Works.\nVivi continues to explain that she and her compatriots were able to learn the true identity of Baroque Work's boss and plans by following Miss All Sunday. Miss All Sunday, however, explains that she had let Vivi follow her. Hearing this, Vivi suddenly suspects that Miss All Sunday was the one who told Crocodile of her true identity. Miss All Sunday goes on explaining that she helped Vivi because she felt that the princess worked very hard, but she finds the princess' resolve to go against Baroque Work's stupid.\nUpon the conversation becoming heated, the Straw Hats prepared themselves to fight with Sanji and Usopp both preparing to shoot Miss All Sunday with a gun and Usopp's slingshot, respectively. The two prepared to shoot despite not fully understanding what was happening. However despite being surrounded, Miss All Sunday simply flips both Sanji and Usopp with her Devil Fruit powers, leaving the rest in shock. While everyone is wondering what power she has, Miss All Sunday grabs Luffy's straw hat and explains to the Straw Hats their next destination on the Log Pose route they are following. That place, Little Garden, is so dangerous that not even Baroque Works need to deal with them there. To help them avoid such an obstacle, Miss All Sunday gives them an Eternal Pose that will lead them somewhere else. She however gives them the choice to accept this or not as she states it might be a trap.\nLuffy declines this offer and crushes the Eternal Pose in his bare hand despite Nami's protest. He states that he did this because Miss All Sunday does not have the right to tell them where to go, and because he hated her for bombing Igaram's ship. With that Miss All Sunday left the Straw Hats on her giant turtle, Banchi. Having escaped that danger, the Straw Hats continued sailing to Little Garden. As they sailed, Sanji and Usopp are properly filled in about the situation, while Luffy wonders if it's gonna snow again.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Garp (cover)",
    "Koby (cover)",
    "Helmeppo (cover)",
    "Nefertari Vivi",
    "Karoo",
    "Igaram (flashback)",
    "Miss All Sunday",
    "Banchi"
  ],
  "ssum_frequencies": [
    [
      "to",
      5
    ],
    [
      "the",
      4
    ],
    [
      "them",
      4
    ],
    [
      "their",
      3
    ],
    [
      "decide",
      2
    ],
    [
      "a",
      2
    ],
    [
      "and",
      2
    ],
    [
      "pose",
      2
    ],
    [
      "which",
      2
    ],
    [
      "path",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      28
    ],
    [
      "to",
      21
    ],
    [
      "that",
      18
    ],
    [
      "and",
      16
    ],
    [
      "she",
      13
    ],
    [
      "miss",
      11
    ],
    [
      "all",
      11
    ],
    [
      "sunday",
      11
    ],
    [
      "them",
      10
    ],
    [
      "her",
      7
    ],
    [
      "with",
      7
    ],
    [
      "is",
      7
    ],
    [
      "of",
      6
    ],
    [
      "a",
      6
    ],
    [
      "in",
      6
    ],
    [
      "not",
      6
    ],
    [
      "ship",
      5
    ],
    [
      "sanji",
      5
    ],
    [
      "usopp",
      5
    ],
    [
      "vivi",
      5
    ]
  ]
}