{
  "chapter_number": "Chapter 140",
  "title": "The Castle of Snow",
  "short_summary": "Chopper is chased around the castle by Luffy and Sanji who want to eat him. Chopper escapes them and talks to Nami while Dr. Kureha chases Luffy and Sanji. Their conversation is interrupted by Luffy and Sanji who chase Chopper away. Kureha tells Nami about Chopper's past and Dr. Hiriluk. Chopper transforms to his Heavy Point and Luffy decides he wants Chopper to join his crew.\n",
  "long_summary": "Luffy asks Dr. Kureha to join the Straw Hats, however she rejects his offer. When Chopper appears inside Nami's bedroom, he is immediately hunted by Sanji and Luffy who want to cook him, however, they are chased by Kureha who does not want to lose her assistant.\nChopper loses Luffy and Sanji and returns to Nami's room to take care of her. When she saw that he is interested in pirates, Nami asks him to join their crew, but Chopper declines, saying that he is a reindeer and cannot be involved with humans. Their conversation is suddenly interrupted by the appearance of Luffy and Sanji, and Chopper quickly flees.\nKureha then enters the room. She heard Nami and Chopper's discussion and explains to Nami that she has no objection if Chopper goes with them. However, it will be difficult to convince him (or earn his trust for that matter), as Chopper has been horribly scarred throughout his life, something which Kureha claims not even a doctor can fix. Dr. Kureha reveals that Chopper has always been alone, even more since he ate the Hito Hito no Mi, rejected by both humans and reindeer. When Chopper was still very young, his whole herd, even his own parents, shunned him all because of his blue nose. When he ate the Hito Hito no Mi, he became even more of an outcast and chased him away. Realising he was able to take on a human form, he tried socialising with the local humans, which ended disastrously as they mistook for a monster (he did not look entirely human, despite his abilities, and his blue nose made him stand out). Only one man was able to talk to him: Dr. Hiriluk.\nDuring their hunt, Luffy and Sanji realise that the castle is full of snow due to the entrance, which has been left open. When they are about to close the door, Chopper prevents them from doing so by turning into his Heavy Point form. Sanji and Luffy realise the reason for the door being open—a nest of baby birds is on the top of the door—as well as the fact that Chopper is not really a common reindeer.\n\n"
}