{
  "chapter_number": "Chapter 186",
  "title": "4",
  "short_summary": "The explosion was not enough to beat the pair. When Usopp and Chopper see that, Usopp tries to flee but is quickly caught by Miss Merry Christmas who throws him towards Mr. 4 who, in turn, sends him flying with a swing of his bat. When Miss Merry Christmas states that Luffy is dead and mocks his dream to become the Pirate King, Usopp forgets all his injuries and fights back in the name of his friend's honor. Amazed, Miss Merry Christmas tries to do the same move and catch Usopp again, but when she throws Usopp toward Mr. 4, Chopper uses his Horn Point mode to dig Miss Merry Christmas out. Usopp exchanges places with her and she is the one who ends up meeting Mr. 4's bat after Usopp blinds his line of sight with a Kemuri Boshi and imitates her voice. Once she is knocked out, Usopp and Chopper team up again and send Mr. 4 flying along with his pet gun Lassoo. The first victory goes to the Straw Hat Pirates.\n",
  "long_summary": "Usopp, beaten on the ground, hopes to himself that Mr. 4 and Miss Merry Christmas would not get back up after their attack is successful. Chopper notices that Mr. 4 is still standing, commenting to himself that he only has a minute and a half left after eating a Rumble Ball. Usopp then begins to flee, yelling out that the pair are monsters that can't be beaten. While Chopper yells to Usopp he can't run away from them, Miss Merry Christmas confirms this, grabbing Usopp's legs from underground. Miss Merry Christmas then comments that if a captain is weak then so is his crewmates, prompting Usopp to ask her what about Luffy. Miss Merry Christmas tells them that Luffy has been killed by Mr. 0 and that the rebellion has started, much to the shock of Usopp and Chopper.\nUsopp denies this, yelling at Miss Merry Christmas that Luffy is going to be Pirate King and he wouldn't lose to a \"filthy sand gator\". Miss Merry Christmas begins to laugh at the idea of Luffy being Pirate King, which enrages Usopp. Usopp then yells out to Chopper, as Miss Merry Christmas drags Usopp's legs and drives him through a wall with her Mogu Mogu Impact attack, also telling Mr. 4 to get his 4-ton bat ready. The pair attack Usopp with Mogurazuka Yonban Kousaten, severely injuring him and knocking him several meters back. However, much to the shock of Miss Merry Christmas, Usopp is still standing, continuing to explain to Chopper that there are times when a man comes to fight, even if there are seemingly no chances of winning, which is when their friends' dreams are being laughed at.\nMiss Merry Christmas proceeds to grab Usopp's legs again, driving him towards Mr. 4. As Chopper reveals a new form, Horn Point, Usopp tells Chopper to get behind him as he fires a Smoke Star at Mr. 4. Slipping out of his shoes to escape from Miss Merry Christmas' grip, Usopp tells Chopper to ensnare Miss Merry Christmas into his horns, which Chopper does, running towards Mr. 4. Thinking Miss Merry Christmas is Usopp, and still blinded by the smoke, Mr. 4 uses his 4-ton bat to knock Miss Merry Christmas back, much to his surprise. During the confusion, Usopp uses Chopper's horns and a rubber band as a slingshot to fire his hammer at Mr. 4, using Hissatsu Uso-Cho Hammer Suisei, knocking out Mr. 4 and Lassoo and winning the battle.\nVictorious, Usopp collapses, and Chopper panics and asks if there is a doctor around, only for Usopp to proclaim that it's him.\n\n",
  "characters": [
    "Monkey D. Luffy (cover)",
    "Roronoa Zoro (cover)",
    "Usopp",
    "Tony Tony Chopper",
    "Mr. 4",
    "Miss Merry Christmas",
    "Lassoo"
  ],
  "ssum_frequencies": [
    [
      "the",
      8
    ],
    [
      "usopp",
      8
    ],
    [
      "and",
      8
    ],
    [
      "his",
      7
    ],
    [
      "to",
      6
    ],
    [
      "is",
      4
    ],
    [
      "miss",
      4
    ],
    [
      "merry",
      4
    ],
    [
      "christmas",
      4
    ],
    [
      "mr",
      4
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      23
    ],
    [
      "usopp",
      16
    ],
    [
      "and",
      13
    ],
    [
      "miss",
      13
    ],
    [
      "merry",
      13
    ],
    [
      "christmas",
      13
    ],
    [
      "a",
      12
    ],
    [
      "that",
      11
    ],
    [
      "the",
      10
    ],
    [
      "mr",
      10
    ],
    [
      "chopper",
      10
    ],
    [
      "4",
      9
    ],
    [
      "is",
      9
    ],
    [
      "his",
      7
    ],
    [
      "him",
      6
    ],
    [
      "of",
      5
    ],
    [
      "at",
      5
    ],
    [
      "he",
      4
    ],
    [
      "then",
      4
    ],
    [
      "out",
      4
    ]
  ]
}