{
  "chapter_number": "Chapter 77",
  "title": "The First Step Toward a Dream",
  "short_summary": "Nami's childhood, love is more important than blood.\n",
  "long_summary": "8 years ago, a 10-year-old Nami lived with her adoptive sister Nojiko and their adoptive mother Bell-mère who was raised them on an orange farm. One day, Nami was caught by a local policeman, Genzo, when she attempted to steal a book. She explained they were poor and could not afford to buy the navigation book she desired. She needed the book to accomplish her dream, to travel around the world. Genzo took pity upon the young girl and bought the book for her. Upon returning her to Bell-mère, Genzo demanded she be taught respect. Bell-mere stood up for the girl and told him she'd pay him back with love when she could. As she shut the door, she explained that Nami should have asked for the book. Bell-mère would have purchased it for her. With the book, Nami was soon able to draw her first map of their island.\nOne night, while Bell-mère gave Nami an old dress of Nojiko's. Nami complained that it was a hand me down and how the three of them were not blood related. She yelled in a fit how she wished she had been adopted by a family with more money. Angry, Bell-mère slapped her and told Nami that she could leave the house and live the life she wanted.\nNami took refuge in Genzo's house. He explains to her how Bell-mère found her and Nojiko. Bell-mère served in a war as a Marine, and was heavily wounded during a battle, when she returned with the two little girls who they had lost their parents. She collapsed and in her potentially final breath, she begged for her village members to save the children. As she looked down at the infant Nami, Nami could only smile as she was unaware of her surroundings and only knew joy.\nIn the present, upon hearing the story Nami came to realize that the love bond between the three of them was stronger than blood. She returned with Nojiko who had been searching for her.\nHowever at the same time, pirates accosted the island. Sea-pirate Arlong and his fish-men had arrived and they declared that the land now belonged to them.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Usopp",
    "Sanji",
    "Arlong (flashback)",
    "Hatchan (flashback)",
    "Chew (flashback)",
    "Kuroobi (flashback)",
    "Nami",
    "Nojiko",
    "Genzo (flashback)",
    "Bell-mère (flashback)",
    "Nako (flashback)"
  ],
  "ssum_frequencies": [
    [
      "namis",
      1
    ],
    [
      "childhood",
      1
    ],
    [
      "love",
      1
    ],
    [
      "is",
      1
    ],
    [
      "more",
      1
    ],
    [
      "important",
      1
    ],
    [
      "than",
      1
    ],
    [
      "blood",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      22
    ],
    [
      "she",
      19
    ],
    [
      "her",
      13
    ],
    [
      "and",
      13
    ],
    [
      "nami",
      11
    ],
    [
      "to",
      10
    ],
    [
      "a",
      9
    ],
    [
      "bellmère",
      7
    ],
    [
      "was",
      7
    ],
    [
      "with",
      6
    ],
    [
      "book",
      6
    ],
    [
      "for",
      6
    ],
    [
      "that",
      5
    ],
    [
      "of",
      5
    ],
    [
      "in",
      5
    ],
    [
      "them",
      4
    ],
    [
      "could",
      4
    ],
    [
      "as",
      4
    ],
    [
      "had",
      4
    ],
    [
      "nojiko",
      3
    ]
  ]
}