{
  "chapter_number": "Chapter 7",
  "title": "Friends",
  "short_summary": "Morgan's Marines are grateful to Luffy for defeating Morgan and ridding them of his tyranny, and allow Luffy and Zoro to leave peacefully. Koby, however, does not accompany them, causing the soldiers to ask if he is one of them or not. To prove that Koby is not their friend, Luffy provokes him until he punches him; he is then allowed to stay. After the pirates leave, Koby asks to join the Marines, and is allowed in. Koby and the Marines salute Luffy and Zoro as they set off.\n",
  "long_summary": "Morgan has been defeated; however, the Marines working for him would rather celebrate than worry about his loss. Due to his fatigue, Zoro finally collapses.\nBack at Rika's home, Zoro is eating after going for nine days without food. Zoro asks Luffy what his plans are. Luffy states he wants to go to the Grand Line to find One Piece. Zoro questions why Koby is worried since he is not going with them. He replies that it is because they are friends. Zoro points out to Koby that his past with Alvida makes joining the Marines difficult as he has association with pirates.\nJust then, the Marines enter the building demanding to know if Luffy and Zoro are pirates. After the pair confirms that they are, they are told as pirates the Marines are grateful for their help, but they cannot stay in town and must leave; however, the Marines will not be reporting the whole event to Marine Headquarters. Luffy and Zoro thank Rika's mother for the food.\nKoby is left standing there alone and the Marines question whether he is with the pirates. Koby claims otherwise. As Luffy is asked if he knows Koby, Luffy goes on about how Koby used to be with Alvida. Angry that Luffy is telling the Marines what he does not want them to know, he hits him. With everyone watching in awe, Luffy begins to punch Koby for hitting him. After the Marines stop Luffy from fighting, Koby is declared not to be with the pirates. Luffy and Zoro are ordered to leave.\nLying on the ground, Koby brings his nerves together and declares he wants to join the Marines, even if it is just to do chores. The Marine in charge of the scene asks Koby if he really wants to join, the Marine acknowledges his past with pirates and agrees that Koby can join.\nOn the outskirts of the town, Zoro and Luffy are leaving. Koby suddenly catches their attention. Koby salutes the pirates; suddenly he becomes aware that the other Marines are also saluting them. As the two sail away in a small boat, the Marine in charge declares that they violated the Marine code of conduct and now must go one week without food, but not before commenting to Koby on how he has a good friend in Luffy.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Buggy (shadowed)",
    "Shanks (shadowed)",
    "Morgan (K.O)",
    "Ripper",
    "Koby",
    "Helmeppo (K.O)",
    "Rika",
    "Ririka"
  ],
  "ssum_frequencies": [
    [
      "to",
      6
    ],
    [
      "and",
      6
    ],
    [
      "luffy",
      4
    ],
    [
      "koby",
      4
    ],
    [
      "the",
      4
    ],
    [
      "is",
      4
    ],
    [
      "marines",
      3
    ],
    [
      "them",
      3
    ],
    [
      "not",
      3
    ],
    [
      "he",
      3
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      27
    ],
    [
      "to",
      16
    ],
    [
      "koby",
      14
    ],
    [
      "luffy",
      12
    ],
    [
      "he",
      12
    ],
    [
      "marines",
      10
    ],
    [
      "is",
      10
    ],
    [
      "zoro",
      9
    ],
    [
      "are",
      9
    ],
    [
      "and",
      9
    ],
    [
      "with",
      8
    ],
    [
      "that",
      7
    ],
    [
      "pirates",
      7
    ],
    [
      "his",
      6
    ],
    [
      "in",
      6
    ],
    [
      "for",
      5
    ],
    [
      "not",
      5
    ],
    [
      "they",
      5
    ],
    [
      "marine",
      5
    ],
    [
      "as",
      4
    ]
  ]
}