{
  "chapter_number": "Chapter 110",
  "title": "The Night Isn't Over",
  "short_summary": "Two more Baroque Works agents make their appearance in Whisky Peak: Mr. 5 and Miss Valentine. They have come to kill Arabasta traitors who have discovered their boss's identity, Mr. 8 and Miss Wednesday.\n",
  "long_summary": "Luffy wakes up for a second but soon returns to sleep. The Baroque Works members, Mr. 8 and Miss Wednesday, attempt to run from the Straw Hats. However, to their horror they are spotted by Mr. 13 and Miss Friday. They suddenly hear someone order them to stop. They turn and spot two more Baroque Works members holding their guns at them. They ask for them to identify themselves and they answer with their code names.\nMeanwhile, Zoro sits, drinking. Mr. 8 stands up, severely injured, and spots Mr. 5 and Miss Valentine behind him. The two officer agents reveal that Miss Wednesday is Nefertari Vivi, princess of Arabasta, and Mr. 8 is Igaram, her servant. Zoro watches from above, unnoticed. Mr. 9 is surprised and bows to Vivi while Vivi yells at him for acting so stupid. Zoro grabs Luffy and sprints away.\nMr. 5 announces they are here to kill the two traitors, but Mr. 9 stands before Vivi, saying that he cannot let his partner die. He is hit with an explosive by Mr. 5. As Zoro comments on Mr. 5's exploding booger. Igaram begs Zoro to save Vivi. While she escapes on Karoo, Nami appears. She proposes they will save Vivi if they pay 1,000,000,000.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Garp (cover)",
    "Koby (cover)",
    "Helmeppo (cover)",
    "Nefertari Vivi",
    "Igaram",
    "Karoo",
    "Mr. 5",
    "Miss Valentine",
    "Mr. 9",
    "Miss Monday",
    "Mr. 13",
    "Miss Friday"
  ],
  "ssum_frequencies": [
    [
      "their",
      2
    ],
    [
      "mr",
      2
    ],
    [
      "and",
      2
    ],
    [
      "miss",
      2
    ],
    [
      "have",
      2
    ],
    [
      "two",
      1
    ],
    [
      "more",
      1
    ],
    [
      "baroque",
      1
    ],
    [
      "works",
      1
    ],
    [
      "agents",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "mr",
      10
    ],
    [
      "and",
      9
    ],
    [
      "to",
      8
    ],
    [
      "they",
      8
    ],
    [
      "vivi",
      6
    ],
    [
      "zoro",
      5
    ],
    [
      "the",
      4
    ],
    [
      "miss",
      4
    ],
    [
      "is",
      4
    ],
    [
      "for",
      3
    ],
    [
      "8",
      3
    ],
    [
      "their",
      3
    ],
    [
      "them",
      3
    ],
    [
      "two",
      3
    ],
    [
      "5",
      3
    ],
    [
      "luffy",
      2
    ],
    [
      "up",
      2
    ],
    [
      "but",
      2
    ],
    [
      "baroque",
      2
    ],
    [
      "works",
      2
    ]
  ]
}