{
  "chapter_number": "Chapter 174",
  "title": "Mr. Prince",
  "short_summary": "Sanji, nicknamed as Mr. Prince, makes Crocodile leave the casino, by pretending to be dead. When Crocodile sees that all his Millions have been beaten by the mysterious Mr. Prince, he runs after him, but he is chasing after Chopper in a disguise. Sanji is, in reality, already in the casino, to which he has blocked all access by destroying the bridge. Now he and Vivi, who escaped from the Bananawani, have time to help the prisoners.\n",
  "long_summary": "Sanji, calling himself Mr. Prince, is talking to Crocodile on a Den Den Mushi, and is antagonizing him, Sanji then convinces Crocodile that he has been beaten by a Million and that they are outside the casino. Vivi tries to escape but is stopped by Crocodile, Crocodile then leaves with a parting remark that he will bring Mr. Princes' corpse as a farewell gift to the Straw Hat Pirates in the cage, Vivi does however manage to get out of the room. However when Crocodile leaves the casino he finds his minions defeated, and learns that it was \"Mr. Prince\" that defeated the Millions, he then spots a figure running away from the scene and assumes that it is Mr. Prince so he follows him. As he starts chasing the figure, the bridge to the casino collapses which Vivi views as meaning that she can not get away, but Sanji who is playing at the slots says that it means enemies can not get in, he then asks her to lead the way.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Smoker",
    "Nefertari Vivi",
    "Ultraking",
    "Crocodile",
    "Miss All Sunday",
    "Mr. 3 (flashback)"
  ],
  "ssum_frequencies": [
    [
      "the",
      6
    ],
    [
      "he",
      4
    ],
    [
      "by",
      3
    ],
    [
      "to",
      3
    ],
    [
      "in",
      3
    ],
    [
      "sanji",
      2
    ],
    [
      "mr",
      2
    ],
    [
      "prince",
      2
    ],
    [
      "crocodile",
      2
    ],
    [
      "casino",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      12
    ],
    [
      "that",
      8
    ],
    [
      "he",
      7
    ],
    [
      "to",
      6
    ],
    [
      "is",
      5
    ],
    [
      "crocodile",
      5
    ],
    [
      "a",
      5
    ],
    [
      "mr",
      4
    ],
    [
      "and",
      4
    ],
    [
      "then",
      4
    ],
    [
      "sanji",
      3
    ],
    [
      "prince",
      3
    ],
    [
      "casino",
      3
    ],
    [
      "vivi",
      3
    ],
    [
      "as",
      3
    ],
    [
      "get",
      3
    ],
    [
      "it",
      3
    ],
    [
      "den",
      2
    ],
    [
      "him",
      2
    ],
    [
      "by",
      2
    ]
  ]
}