{
  "chapter_number": "Chapter 179",
  "title": "Showdown at Alubarna",
  "short_summary": "Crocodile throws Luffy in the quicksand. Meanwhile, everybody is getting ready for the battle in Arabasta.\n",
  "long_summary": "The chapter begins with the Straw Hats getting ready for battle on the giant crab, Hasami. Usopp tells Chopper one of his lie stories again, while Zoro trains by putting Matsuge on top of one of his swords and lifting him. As Usopp tells a horrified Chopper that shrimp are actually crabs in the background, Nami tells Zoro that what he's doing would probably just use up his stamina. Sanji tells Nami to leave him alone, saying that everyone has to do something in order to push away their thoughts about their captain tasting the level of a Shichibukai at this moment. Zoro asks Sanji what he wants to say, and Sanji says that Zoro is scared, thinking what if Luffy lost. Zoro gets annoyed at the word \"scared\" and calls Sanji \"beauty brows\". Sanji gets insulted by this and calls Zoro a moss head. As the two are about to start a fight, Nami punches both. Usopp thinks about cheering everyone up as a \"vice captain\", but Vivi assures everyone that Luffy is okay. Usopp comments that Vivi is the one who should be the most worried and Nami tells Vivi should just focus on worrying about the rebellion and not other things, lightly punching her in the head. Nami officially gives the crab the name \"Hasami\" and tells him to hurry to Alubarna, while the others comment on the strange name.\nMeanwhile in Yuba, Toto finally finds a place that spurts out lots of water, and smiles, not knowing about the sandstorm created by Crocodile approaching.\nBack in the fight with Luffy and Crocodile, Crocodile tells Luffy about how everything would go his way, not Luffy's. We see now that Crocodile had stabbed right through Luffy's water bottle around his neck into Luffy. While the water from Luffy's bottle drips onto Crocodile's arm, Luffy suddenly grabs Crocodile's arm and breaks it, despite being half dead. Crocodile is surprised that Luffy is still alive and throws him into the quicksand and Luffy falls deeper and deeper into it.\nIn Rainbase, Smoker tells Tashigi to go straight to Alubarna by herself and do whatever she feels is her own justice there. Smoker tells her to watch closely how this place will end up, whether it gets destroyed or not, and drives away.\nMeanwhile in the desert, rebels ride on horses toward Alubarna. Koza tells Cobra to wait and see how they will destroy Arabasta.\nIn the royal palace, the soldiers also get ready for battle, and the citizens run away for safety.\nMr. 4 and Miss Merry Christmas are seen with a bloody and captured Cobra somewhere, and while the pair chatter, Cobra tells everyone to stop destroying themselves in his mind.\nPeople who hate the fight, people who fight, people who create the fight, people who stop the fight, they all come to Alubarna to clash.\nBack in the quicksand, Luffy's head pops out, and he yells out that he's hungry.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Tony Tony Chopper",
    "Smoker",
    "Tashigi",
    "Nefertari Cobra",
    "Nefertari Vivi",
    "Chaka",
    "Koza",
    "Toto",
    "Crocodile",
    "Mr. 4",
    "Miss Merry Christmas",
    "Karoo (cover)",
    "Matsuge",
    "Hasami"
  ],
  "ssum_frequencies": [
    [
      "in",
      2
    ],
    [
      "the",
      2
    ],
    [
      "crocodile",
      1
    ],
    [
      "throws",
      1
    ],
    [
      "luffy",
      1
    ],
    [
      "quicksand",
      1
    ],
    [
      "meanwhile",
      1
    ],
    [
      "everybody",
      1
    ],
    [
      "is",
      1
    ],
    [
      "getting",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      28
    ],
    [
      "and",
      21
    ],
    [
      "to",
      14
    ],
    [
      "tells",
      11
    ],
    [
      "that",
      10
    ],
    [
      "in",
      10
    ],
    [
      "luffy",
      8
    ],
    [
      "a",
      7
    ],
    [
      "his",
      6
    ],
    [
      "zoro",
      6
    ],
    [
      "about",
      6
    ],
    [
      "is",
      6
    ],
    [
      "fight",
      6
    ],
    [
      "on",
      5
    ],
    [
      "of",
      5
    ],
    [
      "nami",
      5
    ],
    [
      "sanji",
      5
    ],
    [
      "who",
      5
    ],
    [
      "crocodile",
      5
    ],
    [
      "usopp",
      4
    ]
  ]
}