{
  "chapter_number": "Chapter 5",
  "title": "Pirate King and Master Swordsman",
  "short_summary": "Morgan and his soldiers go to kill Zoro and Koby, while Luffy retrieves Zoro's swords. Zoro is thinking about how he cannot die at a place like this, remembering the promise he made to his childhood friend, Kuina. Just before Zoro and Koby are shot, however, Luffy gets in the way, protecting the pair from all the bullets. Zoro realizes that, if he wants to live, he has no choice and tells Luffy that he will join him.\n",
  "long_summary": "Luffy is busy dragging Helmeppo through the base, trying to find Zoro's sword. After dragging Helmeppo for a while, Luffy asks Helmeppo where Zoro's sword is and he tells Luffy Zoro's arsenal is in his room. Luffy decides to use Helmeppo as a human shield, leaving some pursuing Marines in a position where they cannot do anything.\nMeanwhile, Koby realizes that he has been shot and that he had started bleeding. Zoro tells Koby to run, but Koby will not go until Zoro is untied. He tells Zoro that Helmeppo never planned to keep his word. Zoro cannot believe what he is hearing, and Koby tells Zoro how Luffy punched Helmeppo because of what they overheard him say. Koby asks Zoro to help Luffy. Suddenly, some Marines approach Zoro and Koby and declare them traitors.\nElsewhere, Luffy has found swords in Helmeppo's room, but does not know which one is Zoro's. Luffy suddenly spots what is going on down on the ground outside the window of the Marine base. Zoro and Koby are in trouble and Morgan wants them dead. Zoro, aware that he may die, begins a flashback to his days as a young boy and his reasons for becoming who he is.\nA young Zoro was in a training dojo on the ground after a defeat against Kuina. Kuina was mocking him for failing to win against her (for the 2000th time) even after he used two swords. Zoro's friends stuck up for him when he was called weak, as Kuina stated even though he could stand up to the adults, it was no good if he still could not beat her. The others accused her for showing off because she was the dojo master's daughter. As the sensei entered the room, the other trainee swordsmen (save Zoro himself) accused him of giving her special training because she was able to beat Zoro. The sensei just stated that Kuina was older.\nLater that night, a frustrated Zoro challenged Kuina to fight him with real katana. Kuina accepted Zoro's challenge. With one strike, Zoro lost and Kuina claimed her 2001st victory against him. After the duel was over, Kuina broke down in tears. She told Zoro her woe about being a girl: as she gets older, she will fall behind him due to the fact girls do not acquire the strength guys do. Kuina said that she wished she had been born a boy, but Zoro got angry at her, saying that she did not have the right to complain after she beat him. Zoro went further by saying that it was an insult to all the hard work he'd been doing. The two then made an agreement; one of them will become the greatest swordsman in the world.\nDisaster hit the next day as Zoro was informed of the worst; Kuina had fallen down the stairs and died. Upset, Zoro called to her body lying lifeless, its face covered with a cloth, accusing her of running away. Zoro asked the sensei to give Zoro her sword; he will become the world's greatest swordsman on her behalf.\nBack in the present, Zoro faces death. As the Marines fire, Luffy jumps in front of them and the bullets hit him instead. The bullets then bounce off Luffy to the disbelief of everyone watching. Luffy brings the three swords he had found in Helmeppo's room, claiming he did not know which one was Zoro's. The swordsman then explains he uses three swords. Zoro accepts Luffy's offer to join his crew because he would rather become a criminal than die.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Morgan",
    "Helmeppo",
    "Kuina (flashback)",
    "Koushirou (flashback)",
    "Koby"
  ],
  "ssum_frequencies": [
    [
      "he",
      5
    ],
    [
      "and",
      4
    ],
    [
      "zoro",
      4
    ],
    [
      "the",
      4
    ],
    [
      "to",
      3
    ],
    [
      "luffy",
      3
    ],
    [
      "his",
      2
    ],
    [
      "koby",
      2
    ],
    [
      "that",
      2
    ],
    [
      "morgan",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      33
    ],
    [
      "zoro",
      23
    ],
    [
      "to",
      17
    ],
    [
      "he",
      16
    ],
    [
      "a",
      13
    ],
    [
      "luffy",
      11
    ],
    [
      "and",
      11
    ],
    [
      "was",
      11
    ],
    [
      "her",
      11
    ],
    [
      "in",
      10
    ],
    [
      "kuina",
      10
    ],
    [
      "that",
      9
    ],
    [
      "him",
      9
    ],
    [
      "she",
      9
    ],
    [
      "is",
      8
    ],
    [
      "of",
      8
    ],
    [
      "zoros",
      7
    ],
    [
      "as",
      7
    ],
    [
      "koby",
      7
    ],
    [
      "helmeppo",
      6
    ]
  ]
}