{
  "chapter_number": "Chapter 158",
  "title": "Landing in Arabasta",
  "short_summary": "While the crew is arguing about Luffy's irresponsible behavior, Smoker and Ace are having a confrontation in the restaurant. Smoker moves to arrest Ace, when suddenly, a starving Luffy runs into the restaurant, propelling both Smoker and Ace away in the process. While Luffy is starting to eat in front of a bemused assembly, Smoker and Ace realize that the guy who hit them is the one they are both looking for. Smoker reacts first and confronts Luffy. After an abnormal amount of time, Luffy realizes his situation and flees the restaurant, not realizing the presence of Ace. While the Marines are pursuing Luffy, the rest of the crew has bought some local clothes (much to Sanji's delight) in order to blend in. Unfortunately, their captain soon gives their position away, forcing everyone to flee. Just as Smoker is about to catch Luffy thanks to his Moku Moku no Mi, Ace intervenes.\n",
  "long_summary": "The crew is waiting for Luffy to get back, when they spot Mr. 3's ship. Meanwhile, Smoker confronts Ace and the spectators are astonished that a commander of the Whitebeard Pirates is there, while Luffy smells food from the restaurant, Smoker prepares to attack Ace when Luffy rockets into the room. Luffy then orders food while Ace apologizes for the mess and recognizes Luffy, but is pushed down by Smoker who recognizes him as well, but is annoyed by Luffy's lack of interest and rudeness. Luffy then recognizes Smoker and runs away while Ace and Smoker chase after him. Smoker warns Tashigi of Luffy, who then tries to stop Luffy but is unable to, and Smoker is forced to go after him alone. Meanwhile Vivi and Nami are trying out different perfumes to the pleasure of Sanji but to the horror of Chopper. Vivi then explains that they need to get to Yuba so that she may talk with Koza the leader of the rebellion. Suddenly, Luffy appears being chased by marines, including Smoker who attacks him until he is stopped by Ace, whom Luffy recognizes.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Tony Tony Chopper",
    "Portgas D. Ace",
    "Yurikah (cover)",
    "Smoker",
    "Fullbody (cover)",
    "Tashigi",
    "Nefertari Vivi",
    "Karoo",
    "Yoshimoto"
  ],
  "ssum_frequencies": [
    [
      "the",
      11
    ],
    [
      "to",
      7
    ],
    [
      "smoker",
      6
    ],
    [
      "ace",
      6
    ],
    [
      "luffy",
      6
    ],
    [
      "and",
      5
    ],
    [
      "in",
      5
    ],
    [
      "is",
      4
    ],
    [
      "of",
      4
    ],
    [
      "while",
      3
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      10
    ],
    [
      "luffy",
      10
    ],
    [
      "to",
      9
    ],
    [
      "smoker",
      8
    ],
    [
      "is",
      7
    ],
    [
      "and",
      7
    ],
    [
      "of",
      6
    ],
    [
      "ace",
      5
    ],
    [
      "then",
      4
    ],
    [
      "recognizes",
      4
    ],
    [
      "but",
      4
    ],
    [
      "by",
      4
    ],
    [
      "him",
      4
    ],
    [
      "that",
      3
    ],
    [
      "while",
      3
    ],
    [
      "who",
      3
    ],
    [
      "for",
      2
    ],
    [
      "get",
      2
    ],
    [
      "when",
      2
    ],
    [
      "they",
      2
    ]
  ]
}