{
  "chapter_number": "Chapter 58",
  "title": "Crap-Geezer",
  "short_summary": "Sanji's flashback: Sanji's 85 foodless days.\n",
  "long_summary": "Sanji tried to divide his small portion of food wisely, but after 25 days he had only one piece of moldy bread left. He had only seen one ship that did not even see him pass. After 70 days, weak and hopeless, he decided to reach Zeff to steal his food.\nUpon arriving, he found Zeff's bag was still almost full. He became enraged and approached Zeff with a knife, declaring he was taking the food and did not care about him. However, when Sanji opened the bag, he found it had only been filled with treasures. Sanji realized that Zeff had given him all the food and that he had only survived by eating his own leg. When asked why he acted such foolishly while they hate each other, the pirate revealed that, he too, believed in the All Blue and that he was trying to find it in the Grand Line. However, now that he no longer has his crew, he could not realize this dream anymore. He decided if they were rescued, he would retire from piracy and start a restaurant.\nThe miracle occurred, after 85 days, the ship Sanji had seen came back and saved them.\nBack in the present, Sanji's behavior makes more sense: in the memory of the old man that saved his life, he will not allow anyone to kill him or steal his last dream.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Mohji (cover)",
    "Richie (cover)",
    "Cabaji (cover)",
    "Gin",
    "Pearl",
    "Zeff",
    "Sanji"
  ],
  "ssum_frequencies": [
    [
      "sanjis",
      2
    ],
    [
      "flashback",
      1
    ],
    [
      "85",
      1
    ],
    [
      "foodless",
      1
    ],
    [
      "days",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "he",
      16
    ],
    [
      "the",
      11
    ],
    [
      "that",
      7
    ],
    [
      "and",
      7
    ],
    [
      "his",
      6
    ],
    [
      "had",
      6
    ],
    [
      "to",
      5
    ],
    [
      "sanji",
      4
    ],
    [
      "food",
      4
    ],
    [
      "only",
      4
    ],
    [
      "not",
      4
    ],
    [
      "him",
      4
    ],
    [
      "in",
      4
    ],
    [
      "of",
      3
    ],
    [
      "after",
      3
    ],
    [
      "days",
      3
    ],
    [
      "zeff",
      3
    ],
    [
      "was",
      3
    ],
    [
      "one",
      2
    ],
    [
      "seen",
      2
    ]
  ]
}