{
  "chapter_number": "Chapter 154",
  "title": "To Arabasta",
  "short_summary": "While Kureha and Dalton rejoice about the now possible rebirth of their country, they learn that Chopper has joined a group of pirates whose captain is worth 30,000,000. Meanwhile, Chopper discovers the life on board the Going Merry with his new friends.\n",
  "long_summary": "Kureha and Dalton are sitting under the sakura snow, now full of hope about the future of their country when a villager appears carrying Luffy's bounty poster. Understanding their friend has encountered some dangerous people, Kureha makes mysterious remarks about Gol D. Roger and the Will of D. When asked about where the poster came from, the villager replies that a few days ago, a stranger appeared, looking for the Blackbeard Pirates who destroyed the island. When the stranger called Ace learned that they have already left, he gave Luffy's poster to the villagers so that, in case he reaches Drum, they can tell Luffy he would wait for him in Arabasta for 10 days.\nOnboard the Going Merry, Chopper is full of nostalgia and does not rejoice with the others, who are having a sakura party. However, once Nami gives him his medicine bag, which he had no time to prepare during his hasty departure, he understands that Kureha did it for him, secretly agreeing with his departure. This revelation changes his mood and he quickly learns the crew's customs who happily celebrate the new Straw Hats' doctor.\nMeanwhile in Little Garden, an okama named Mr. 2 is searching for Mr. 3 in order to accomplish Crocodile's orders to kill him, but Mr. 3 is nowhere to be found.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Tony Tony Chopper",
    "Fullbody (cover)",
    "Dalton",
    "Kureha",
    "Nefertari Vivi",
    "Karoo",
    "Crocodile",
    "Miss All Sunday",
    "Mr. 2 Bon Kurei",
    "Akumai",
    "Ace (flashback)"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "of",
      2
    ],
    [
      "chopper",
      2
    ],
    [
      "while",
      1
    ],
    [
      "kureha",
      1
    ],
    [
      "and",
      1
    ],
    [
      "dalton",
      1
    ],
    [
      "rejoice",
      1
    ],
    [
      "about",
      1
    ],
    [
      "now",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      13
    ],
    [
      "he",
      6
    ],
    [
      "for",
      5
    ],
    [
      "to",
      5
    ],
    [
      "and",
      4
    ],
    [
      "of",
      4
    ],
    [
      "a",
      4
    ],
    [
      "that",
      4
    ],
    [
      "in",
      4
    ],
    [
      "him",
      4
    ],
    [
      "his",
      4
    ],
    [
      "kureha",
      3
    ],
    [
      "about",
      3
    ],
    [
      "when",
      3
    ],
    [
      "poster",
      3
    ],
    [
      "who",
      3
    ],
    [
      "is",
      3
    ],
    [
      "mr",
      3
    ],
    [
      "are",
      2
    ],
    [
      "sakura",
      2
    ]
  ]
}