{
  "chapter_number": "Chapter 187",
  "title": "Even Match",
  "short_summary": "As Koza continues to press into the battle, Vivi encounters some of the Royal Guards and asks them to take her to Chaka. Meanwhile, Sanji's battle with Mr. 2 is not looking good for either side as both combatants land several devastating blows on each other. In an attempt to make Sanji hesitate in attacking, Mr. 2 transforms his face into one of Sanji's friends only for the latter to inform him faces do not matter as what makes a person is their heart. Testing this belief, Mr. 2 transforms into Nami which immediately fools the chef. Back at the Alubarna Palace, Vivi is brought before Chaka and asks him to destroy the palace.\n",
  "long_summary": "Koza continues to press forward into the battle, prompting a member of the rebel army to ask if he is still injured from Nanohana. Koza berates him saying that it doesn't matter anymore, as they are in a battlefield. Koza comments that he needs a horse so he can enter the plaza in the north to demand Cobra's surrender, but he is shot down as it is revealed that the royal army's main regiment is waiting there, along with Chaka and Pell. Vivi is seen running when several royal army members tell her to halt, asking if she is a rebel. Vivi asks them to take her to Chaka, and the royal army members comply, recognizing that she is Princess Vivi.\nIn the South Block of Alubarna, Sanji is seen exchanging a blow with Mr. 2, knocking each other back into buildings. Mr. 2 wonders how Sanji can stand up to his Okama Kenpo, as Sanji tells him he's gonna have to get through him if he wants to move forward. As Mr. 2 attacks Sanji with Okama Kempo techniques, Sanji comments that he has to beat him with one strike and uses a number of his kicks, only for them to be blocked by Mr. 2. Sanji uses his Mouton Shot at the same time Mr. 2 uses his Hakucho Arabesque, sending each other crashing into buildings. Mr. 2 then warns Sanji about the dangers of his Mane Mane no Mi, using the Mane Mane Montage. However, Sanji doesn't buy it, pointing out that he is still using his own face, just with Usopp's nose.\nMr. 2 then decides to transform into Usopp completely, however Sanji still kicks him in the face. Sanji, while Mr. 2 tearfully asks why he would willingly attack his friend's face, points out that he is still him, and he (Sanji) wouldn't fall for such a petty trick, proclaiming that people are made of heart. Mr. 2 says he understands, transforming into Nami, while realizing that even that would not matter, but not before he notices Sanji showing infatuation towards Nami. Testing this out, Mr. 2 transforms into Nami and notices Sanji makes a love face when he does, while Mr. 2 calls him a fool and transforms into her to fight.\nAt the palace of Alubarna, Vivi asks Chaka to destroy the palace, much to his shock. Vivi explains that Arabasta is a country for the people, and the destruction of the palace would distract the two opposing parties long enough for Vivi to explain everything to them.\n\n",
  "characters": [
    "Nami (as a face of Mr. 2)",
    "Usopp (as a face of Mr. 2)",
    "Sanji",
    "Hatchan (cover)",
    "Nefertari Vivi",
    "Chaka",
    "Koza",
    "Kebi",
    "Mr. 2 Bon Kurei"
  ],
  "ssum_frequencies": [
    [
      "to",
      6
    ],
    [
      "the",
      6
    ],
    [
      "as",
      3
    ],
    [
      "into",
      3
    ],
    [
      "mr",
      3
    ],
    [
      "2",
      3
    ],
    [
      "is",
      3
    ],
    [
      "battle",
      2
    ],
    [
      "vivi",
      2
    ],
    [
      "of",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      17
    ],
    [
      "the",
      17
    ],
    [
      "he",
      13
    ],
    [
      "sanji",
      13
    ],
    [
      "is",
      11
    ],
    [
      "that",
      11
    ],
    [
      "mr",
      11
    ],
    [
      "2",
      11
    ],
    [
      "a",
      10
    ],
    [
      "his",
      8
    ],
    [
      "into",
      7
    ],
    [
      "of",
      7
    ],
    [
      "him",
      7
    ],
    [
      "and",
      7
    ],
    [
      "vivi",
      6
    ],
    [
      "with",
      5
    ],
    [
      "still",
      4
    ],
    [
      "as",
      4
    ],
    [
      "in",
      4
    ],
    [
      "for",
      4
    ]
  ]
}