{
  "chapter_number": "Chapter 191",
  "title": "The Woman Who Controls the Weather",
  "short_summary": "Miss Doublefinger is attacking Nami, who is desperately trying to learn how to use her new weapon.\n",
  "long_summary": "Miss Doublefinger uses her Double Stinger attack on Nami, who is desperately trying to escape from her. Miss Doublefinger tells Nami that it's pointless, and that she should allow her to grant her a slow and painless death, unless Nami wants to continue with her \"magic show\". Resolving to keep trying her attacks to find one that actually works, Nami puts her bo-staff into a Y-shape and tries to use \"Thunder Tempo\", but a boxing glove appears out of it, which Miss Doublefinger easily smacks aside and cuts Nami on her cheek. Nami, thinking in her head that if she dies she will curse Usopp for creating a useless weapon, tries going through the instructions again, only to notice something. Miss Doublefinger is then seen standing upside down under a platform, using her spikes, and chases Nami into a building with her Stinger Hedgehog attack. Nami then intelligently uses her cloth to direct the pursuing Miss Doublefinger elsewhere while she escapes, prompting the Baroque Works agent to praise her, realizing she's not a complete novice at fighting.\nHiding behind a pile of crates, Nami goes over the instructions again, to find that the list of \"attacks\" she were using were only for parties and entertainment, and for the attacks effective in battle, she should flip to the other side. When Miss Doublefinger begins to look for Nami, Nami confronts her, proclaiming she should not be treated like a little girl. The basic directions of the combat-type of the Clima-Tact are shown, with each piece of the bo-staff able to shoot out special bubbles, the Heat Ball (for heating), Cool Ball (for cooling), and the Thunder Ball (for a small electrical shock). As Nami runs to escape Miss Doublefinger's Sewing Stinger, she tries to find something to effectively use. Miss Doublefinger catches up to Nami, piercing her in the leg. Before she can finish off Nami, Nami desperately throws her staff at Miss Doublefinger, using Cyclone Tempo, which, to the shock of both, creates a strong gust of wind that knocks Miss Doublefinger back into a pile of crates, while it flings itself back into Nami's hand. Nami figures out the basis of the attack, using Heat and Cool balls to create a strong air current, praising Usopp for creating an amazing weapon that he apparently doesn't seem to understand, calling the attack a party trick. Reading on, Nami finds the ultimate attack of the Clima-Tact, the Tornado Tempo, which any human could not get back up from, however Usopp explains that it is a hit-or-miss last resort technique. Back up, Miss Doublefinger stabs Nami through the head and chest, telling her not to look away while fighting.\nTo Miss Doublefinger's surprise, Nami \"disappeared\" and re-appeared right next to her, creating the Mirage Tempo with Cool Balls. Claiming she now fully understands the Clima-Tact, Nami shouts at Miss Doublefinger to surrender while she still can.\n\n",
  "characters": [
    "Nami",
    "Usopp (flashback)",
    "Hatchan (cover)",
    "Miss Doublefinger",
    "Seaboar (cover)",
    "Sea King (cover)"
  ],
  "ssum_frequencies": [
    [
      "is",
      2
    ],
    [
      "to",
      2
    ],
    [
      "miss",
      1
    ],
    [
      "doublefinger",
      1
    ],
    [
      "attacking",
      1
    ],
    [
      "nami",
      1
    ],
    [
      "who",
      1
    ],
    [
      "desperately",
      1
    ],
    [
      "trying",
      1
    ],
    [
      "learn",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      24
    ],
    [
      "the",
      24
    ],
    [
      "nami",
      20
    ],
    [
      "her",
      18
    ],
    [
      "a",
      15
    ],
    [
      "miss",
      13
    ],
    [
      "doublefinger",
      11
    ],
    [
      "and",
      11
    ],
    [
      "she",
      11
    ],
    [
      "of",
      11
    ],
    [
      "that",
      8
    ],
    [
      "for",
      8
    ],
    [
      "attack",
      5
    ],
    [
      "with",
      4
    ],
    [
      "into",
      4
    ],
    [
      "tempo",
      4
    ],
    [
      "using",
      4
    ],
    [
      "while",
      4
    ],
    [
      "not",
      4
    ],
    [
      "back",
      4
    ]
  ]
}