{
  "chapter_number": "Chapter 17",
  "title": "Character",
  "short_summary": "As Zoro and Cabaji's fight continues, Nami leaves to steal the Buggy Pirates' treasure while the crew is still unconscious, but asks Luffy to steal the Grand Line map from Buggy if he got the chance. Zoro then defeats Cabaji with his Oni Giri attack, only to collapse as he reveals they are pirates. Surprised by this, Buggy laughs at their desire to enter the Grand Line, before Luffy declares his intent to become the Pirate King. As they prepare to fight, Buggy mentions Shanks, causing Luffy to pause.\n",
  "long_summary": "Luffy cheers on Zoro while Nami points out how he looks like he is about to collapse after wounding himself on purpose. Zoro swears that he will not be defeated by another swordsman. Cabaji notes Zoro's determination, but adds that Zoro can use his wounds as a excuse once he has lost the fight; Zoro responds by claiming if he loses in this condition, then his fate is obvious and he will never be the world's greatest swordsman.\nNami whispers her plan to Luffy, while Buggy and Cabaji are distracted and the rest of Buggy's crew is unconscious; they will continue fighting while she steals Buggy's treasure from a warehouse. She expects the Grand Line map is still in Buggy's possession, not with the rest of the treasure, and says that after she gets the treasure, she will escape. She reasons that whether or not Luffy and Zoro win their fight does not depend on her, so she can escape without causing any problems; and if Luffy wins the fight and gets the map, then they can \"cooperate\" again before she leaves.\nAs the fight between Zoro and Cabaji rages on, Cabaji begins what he calls his best trick. After launching several tops at Zoro, he rides his unicycle up a wall and leaps high into the air to prepare a downward strike. Zoro manages to deflect all of the tops, but Buggy launches his hand with his devil fruit powers to grab Zoro, so that he cannot avoid Cabaji's attack. Luffy intervenes by stepping on Buggy's hand before he can grab Zoro - while Buggy recoils in pain, Luffy tells him that he shouldn't interfere with Zoro's fight. Cabaji continues to go for his attack even without his captain's help. Zoro dodges, but becomes exhausted due to the strain of his wounds, and says that he is tired. Cabaji interrupts to insult him, before being thrown from his unicycle by Zoro. Zoro then finishes his statement, saying that he is tired of fighting an opponent with such pitiful skills. Cabaji tries to retaliate with one final strike against Zoro, but Zoro uses his \"Oni Giri\" attack to finish off Cabaji. As Cabaji falls, he admits that it is shameful to be defeated by a common thief. Zoro collapses from exhaustion as he declares himself to be a pirate, telling Luffy that he is going to sleep. Luffy promises Zoro that he will finish things off.\nBuggy is shocked to learn that Luffy and Zoro are pirates. Luffy demands that Buggy should hand over the Grand Line map, but Buggy responds that the Grand Line is not a place where nobodies like Luffy can go as they please, and asks Luffy what he intends to do there. Luffy responds that he is going to be the King of the Pirates, stunning Buggy, before he also declares that he will be the Pirate King. Luffy says that they should stop talking and begin their fight, but as they prepare to fight, Buggy remarks that Luffy's hat reminds him of a red-haired man he once knew.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Buggy",
    "Cabaji",
    "Acrobatic Fuwas (K.O)"
  ],
  "ssum_frequencies": [
    [
      "to",
      7
    ],
    [
      "the",
      6
    ],
    [
      "buggy",
      4
    ],
    [
      "as",
      3
    ],
    [
      "luffy",
      3
    ],
    [
      "zoro",
      2
    ],
    [
      "fight",
      2
    ],
    [
      "steal",
      2
    ],
    [
      "pirates",
      2
    ],
    [
      "grand",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "he",
      22
    ],
    [
      "zoro",
      18
    ],
    [
      "that",
      18
    ],
    [
      "the",
      18
    ],
    [
      "to",
      17
    ],
    [
      "luffy",
      14
    ],
    [
      "and",
      13
    ],
    [
      "his",
      12
    ],
    [
      "is",
      11
    ],
    [
      "cabaji",
      9
    ],
    [
      "a",
      8
    ],
    [
      "buggy",
      8
    ],
    [
      "fight",
      7
    ],
    [
      "of",
      7
    ],
    [
      "she",
      7
    ],
    [
      "will",
      6
    ],
    [
      "be",
      6
    ],
    [
      "but",
      6
    ],
    [
      "as",
      6
    ],
    [
      "on",
      5
    ]
  ]
}