{
  "chapter_number": "Chapter 85",
  "title": "Three Sword Style vs. Six Sword Style",
  "short_summary": "Despite his heavy injuries, Zoro continues to fight Hatchan, and defeats him despite the fish-man having six swords to his three. Sanji then confronts Kuroobi, while Genzo and Nojiko go underwater to try to save the drowning Luffy.\n",
  "long_summary": "Johnny and Yosaku, though worried about Zoro's injuries, know their comrade is the only one who can stand against Hatchan, and they throw their swords at him as he puts on his bandanna. Although he puts on a confident front, Zoro knows he could pass out at any time, and as Hatchan prepares to overwhelm him with his Six Sword Style, Zoro does not make a move to catch Johnny and Yosaku's swords, much to their shock. However, at the last second Zoro dodges Hatchan's three-sword jab as he grabs Johnny and Yosaku's swords and attempts to attack the fish-man. Hatchan leaps out of the way and is confident that Zoro will be unable to deal with all six of his swords, but Zoro parries his strikes and cuts him vertically across the chest.\nThe fish-men, villagers, and Johnny and Yosaku are stunned by Zoro's attack, but the wound only angers Hatchan. He states that Zoro cannot logically beat him since Zoro has three swords compared to his six, but Zoro counters that their blades have different weight as he remembers his encounter with Mihawk. Hatchan does not understand his comment, since his swords physically weigh more at 300 kilograms each, but Zoro says no more as Hatchan begins to attack again. He brings all his swords together and jabs them at Zoro, and Zoro counters them. However, Hatchan suddenly spreads out his arms and different directions, moving Zoro's arms and leaving him exposed. Hatchan then headbutts Zoro and sends him flying into the air, putting him on the verge of unconsciousness. Hatchan spins his swords over his head to dice up Zoro when he lands on them, but Zoro manages to spin on top of his swords and cut his hands. Hatchan lets go of his swords and writhes in pain, growing even angrier as he prepares to finish Zoro off. Intent on surpassing his limits and not passing out, Zoro meets Hatchan's attack head-on. He then manages to break Hatchan's swords, telling him that this is what he meant by their swords having different weights. Hatchan tries attacking with rapid punches, but Zoro cuts him up with a whirlwind slash, sending him flying up into the air and landing on the ground defeated.\nKuroobi then prepares to attack Zoro, but Sanji blocks his strike. Kuroobi is surprised that he managed to live after taking one of his punches, but Sanji says that people from Baratie could have taken it as well, causing Kuroobi to state he is being underestimated. Meanwhile, Genzo and Nojiko attempt to break the rock Luffy is trapped in at the bottom of the pool, with Luffy already having swallowed a lot of water. Genzo cannot break the rock as the two quickly run out of oxygen, but they then get an idea.\n\n",
  "characters": [
    "Monkey D. Luffy (K.O)",
    "Roronoa Zoro",
    "Sanji",
    "Arlong",
    "Hatchan",
    "Kuroobi",
    "Dracule Mihawk (flashback)",
    "Koby (cover)",
    "Helmeppo (cover)",
    "Nojiko",
    "Genzo",
    "Nako",
    "Rika (cover)",
    "Yosaku",
    "Johnny"
  ],
  "ssum_frequencies": [
    [
      "to",
      4
    ],
    [
      "despite",
      2
    ],
    [
      "his",
      2
    ],
    [
      "and",
      2
    ],
    [
      "the",
      2
    ],
    [
      "heavy",
      1
    ],
    [
      "injuries",
      1
    ],
    [
      "zoro",
      1
    ],
    [
      "continues",
      1
    ],
    [
      "fight",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "and",
      20
    ],
    [
      "his",
      18
    ],
    [
      "zoro",
      18
    ],
    [
      "the",
      16
    ],
    [
      "to",
      15
    ],
    [
      "he",
      13
    ],
    [
      "swords",
      12
    ],
    [
      "hatchan",
      11
    ],
    [
      "him",
      10
    ],
    [
      "of",
      9
    ],
    [
      "but",
      9
    ],
    [
      "as",
      8
    ],
    [
      "on",
      7
    ],
    [
      "is",
      6
    ],
    [
      "at",
      6
    ],
    [
      "with",
      6
    ],
    [
      "that",
      6
    ],
    [
      "their",
      5
    ],
    [
      "out",
      5
    ],
    [
      "attack",
      5
    ]
  ]
}