{
  "chapter_number": "Chapter 117",
  "title": "Dorry and Brogy",
  "short_summary": "On Kyuka Island, Mr. 3 and Miss Goldenweek hear about Mr. 5's defeat and decide to go after the Straw Hats. Meanwhile, Dorry and Brogy's battle ends in a draw again and the two giants go back to talk with the Straw Hats, with Brogy giving Dorry some rum that Nami and Usopp gave him. However, Dorry's rum explodes, and he believes that the Straw Hats did this, causing him and Luffy to face off.\n",
  "long_summary": "On Kyuka Island, Mr. 3 is lounging around drinking tea when his partner Miss Goldenweek says that she is bored. He tells her to enjoy her time off and to not call him by his codename so casually, and asks about the paper she has been staring at for a few days. To his shock, it is their next set of orders from their boss, and he finds out that Mr. 5 has been beaten. Mr. 3 says that Mr. 5 is an overconfident fool who overestimates his Devil Fruit abilities, and decides to go and teach the people that beat him a lesson about antagonizing their organization.\nOn Little Garden, Nami and Usopp watch as Dorry and Brogy fight each other viciously, not holding back in any of their attacks and often barely avoiding receiving fatal strikes. Nami wants to take this opportunity to escape, but Usopp wants to watch a little longer, expressing how impressed he is by the giants' pride and wanting to become a brave warrior of the sea like them someday. He states that he would like to visit their giant warrior village Elbaf one day. After exchanging several more blows, Dorry and Brogy's fight ends in a draw for the 73,466th time, and Brogy offers Dorry some rum he got from Nami and Usopp.\nDorry takes the rum back to his campsite, where he finds out that Nami and Usopp are with Luffy and Vivi. Vivi asks about the Log Pose taking a year to finish recording Little Garden, and Dorry confirms this, revealing that all the human skeletons around them are of sailors who perished before their Log set. Dorry says that he only has an Eternal Pose that points toward Elbaf, and Vivi weeps over what might happen to her country if she is stuck here for a year. Dorry jokingly suggests setting sail there and leaving it to fate, and laughs when Luffy is open to the idea. Meanwhile, Usopp tells Brogy about his dream, and Brogy states that the giants' biggest wish is to die without tarnishing their pride. Suddenly, Dorry's rum explodes while he is drinking it, greatly injuring him and knocking him over. Luffy is sure that Brogy would never do something underhanded like that, but this leaves Dorry to believe that they are the culprits as he confronts Luffy and Vivi. Luffy gives Vivi his straw hat as he goes to fight Dorry, despite Vivi's pleas.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro (cover)",
    "Nami",
    "Usopp",
    "Sanji (cover)",
    "Dorry",
    "Brogy",
    "Nefertari Vivi",
    "Karoo",
    "Samurai Batts",
    "Mr. 3",
    "Miss Goldenweek"
  ],
  "ssum_frequencies": [
    [
      "and",
      7
    ],
    [
      "the",
      4
    ],
    [
      "to",
      3
    ],
    [
      "straw",
      3
    ],
    [
      "hats",
      3
    ],
    [
      "mr",
      2
    ],
    [
      "go",
      2
    ],
    [
      "dorry",
      2
    ],
    [
      "with",
      2
    ],
    [
      "rum",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "and",
      21
    ],
    [
      "to",
      17
    ],
    [
      "that",
      13
    ],
    [
      "he",
      11
    ],
    [
      "the",
      11
    ],
    [
      "is",
      10
    ],
    [
      "dorry",
      9
    ],
    [
      "his",
      7
    ],
    [
      "a",
      7
    ],
    [
      "their",
      7
    ],
    [
      "usopp",
      5
    ],
    [
      "brogy",
      5
    ],
    [
      "luffy",
      5
    ],
    [
      "vivi",
      5
    ],
    [
      "mr",
      4
    ],
    [
      "him",
      4
    ],
    [
      "about",
      4
    ],
    [
      "of",
      4
    ],
    [
      "nami",
      4
    ],
    [
      "says",
      3
    ]
  ]
}