{
  "chapter_number": "Chapter 73",
  "title": "Monsters of the Grand Line",
  "short_summary": "Zoro knocks out all of the fish-men and has Hatchan tow him to Cocoyasi Village. Sanji, Luffy, and Yosaku run into Momoo, the monster of Grand Line who destroyed Gosa Village and chase him off. Arlong comes back to find what Zoro has done. Usopp gets captured and Zoro runs back to Arlong Park to save him, while Sanji, Luffy, and Yosaku have Momoo tow them to Arlong Park.\n",
  "long_summary": "Hatchan finishes preparing Momoo's meal and makes a trumpet sound to lure Momoo to his dinner. The sound alerts Zoro who finds Hatchan sitting on the shore. Hatchan asks who he is, and Zoro responds that he is a guest. Hatchan responds that Arlong is away at Cocoyasi village and offers to transport him.\nMeanwhile Luffy, Sanji, and Yosaku are confronted by the large sea creature, Momoo. Yosaku suspects he is hungry and suggests to give Momoo. Luffy responds by punching Momoo. Sanji then berates him for hurting the beast just because it's hungry and offers Momoo food. However, Sanji suddenly kicks Momoo for trying to bite his hand. He then knocks him out when he tries to retaliate. The group then proceed to eat their lunch.\nMeanwhile, Zoro arrives at Cocoyasi village. Arlong returns to Arlong Park to find his crewmates have been injured. When asks who did this, he finds out it was Zoro. At first angered, he pacifies himself after learning that Usopp has been captured. Some of his crew hypothesize that Nami was the one that let him escape, saying that betrayal is her specialty. To which Nami responds that she would never betray the crew. She reminds the crew of her promise to buy back the village fair and square, and Arlong believes her. He says they need to take care of Usopp and Zoro, while Zoro finds out Usopp was captured and heads back toward Arlong park, as wells as Luffy and company.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Usopp",
    "Sanji",
    "Buggy (cover)",
    "Mohji (cover)",
    "Cabaji (cover)",
    "Alvida (cover)",
    "Arlong",
    "Hatchan",
    "Chew",
    "Kuroobi",
    "Nami",
    "Momoo",
    "Yosaku"
  ],
  "ssum_frequencies": [
    [
      "and",
      5
    ],
    [
      "to",
      5
    ],
    [
      "zoro",
      3
    ],
    [
      "him",
      3
    ],
    [
      "arlong",
      3
    ],
    [
      "of",
      2
    ],
    [
      "the",
      2
    ],
    [
      "has",
      2
    ],
    [
      "tow",
      2
    ],
    [
      "village",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      12
    ],
    [
      "and",
      11
    ],
    [
      "the",
      9
    ],
    [
      "he",
      8
    ],
    [
      "that",
      7
    ],
    [
      "momoo",
      6
    ],
    [
      "zoro",
      6
    ],
    [
      "is",
      5
    ],
    [
      "arlong",
      5
    ],
    [
      "hatchan",
      4
    ],
    [
      "his",
      4
    ],
    [
      "responds",
      4
    ],
    [
      "him",
      4
    ],
    [
      "who",
      3
    ],
    [
      "finds",
      3
    ],
    [
      "at",
      3
    ],
    [
      "village",
      3
    ],
    [
      "luffy",
      3
    ],
    [
      "sanji",
      3
    ],
    [
      "then",
      3
    ]
  ]
}