{
  "chapter_number": "Chapter 196",
  "title": "1",
  "short_summary": "The Tsumegeri Guards come to save the king. They try to kill Crocodile by drinking Hero Water and get very strong in return for shorting their life spans dramatically. With their great strength, they attack Crocodile, but he avoids the attacks by turning into sand. The Tsumegeri Guards die as an after effect and then Chaka attacks Crocodile, revealing his Devil Fruit powers. Mr. 1 falls down defeated and Zoro collapses from his wounds. Sanji is walking next to Chopper and Usopp who are riding on Matsuge. Nami stands beside a defeated Miss Doublefinger gathering her thoughts out loud. Crocodile defeats Chaka.\n",
  "long_summary": "At the palace of Alubarna, before Chaka could attack Crocodile, a number of mysterious figures appear to interrupt him, revealed to be the Tsumegeri Guards. Having gotten through the palace gates that were blocked by Miss All Sunday, the Tsumegeri Guards prepare to attack, respectfully ignoring Cobra's pleas to not attack Crocodile. Crocodile gives them one chance to retreat, however they ignore him, and Chaka notices strange marks on the Tsumegeri Guards, showing immediate concern. Miss All Sunday offers to fight them, however Crocodile declined. Cobra and Vivi also notice something \"off\" about the Tsumegeri Guards, and they realize they drank the Hero Water, special water that increases their power for a brief period of time, which will later kill them. Desperate to show Crocodile how much Arabasta has suffered, the Tsumegeri Guards attack him, however he evades by turning into sand. Mocking the Tsumegeri Guards, Crocodile sits behind and waits while they suffer from the fatal side effects of drinking the Hero Water.\nChaka, enraged, transforms and goes after Crocodile, who notices that he is a Zoan Devil Fruit eater. Chaka reveals he has eaten the Inu Inu no Mi, Model: Jackal, transforming into a jackal, and attacks Crocodile with Howling Fangs, however the Warlord evades again by turning into sand, commenting that Chaka is also the type to die for others.\nBack at the northern area, Mr. 1, defeated by Zoro, expresses surprise that Zoro grew so much in a single fight. Mr. 1 asks if Zoro is going to start cutting through diamond next, and Zoro replies that would be a waste, while Mr. 1 faints. While Zoro wonders how the others are doing, he collapses, having lost too much blood. Sanji reflects back to Usopp complaining over being paired with Matsuge, who is a camel, and tells Usopp he only saves ladies when Usopp demanded Sanji to save them when they are in trouble. Back in real time, Sanji asks why Usopp was crying, and Usopp said that he was told by Miss Merry Christmas that Luffy was dead. Sanji, telling Usopp and Chopper not to believe that, informs them that getting to the palace is their top priority. Nami, managing to untangle the wires around an unconscious Miss Doublefinger from her Clima-Tact, realizes the rebels are reaching farther into the city, and begins to make her way to the palace to rendezvous with the others.\nAt the palace, Vivi, Cobra, and the royal army are concerned for Chaka, who was effortlessly defeated by Crocodile. While an unknown figure calls out for Vivi, a timer until the bomb explosion is revealed, showing there are 25 minutes left.\n\n"
}