{
  "chapter_number": "Chapter 75",
  "title": "Of Sea Maps and Fish-Men",
  "short_summary": "Luffy and Sanji arrive on Nami's home island. The two of them regroup with Zoro and Johnny. Meanwhile, the Arlong Pirates show off their incredible power by easily destroying a Marine ship led by Commodore Pudding Pudding.\n",
  "long_summary": "The sea monster, Momoo, pulls Sanji and Luffy's boat at full speed onto the shore. Luffy and Sanji are then sent flying into the sky. Momoo crashes into the shore head-first and sinks into the sea in pain. At the same time, Zoro is urgently trying to find Usopp. He hears a loud noise but pays no attention to it until he is caught in Sanji and Luffy's unconventional landing. Zoro explains that they have to hurry in order to save Usopp, who has been captured by Arlong, before he is killed. Zoro is about to run off when Johnny appears and informs him that Usopp has already been killed by Nami. Everybody is in shock after hearing this.\nMeanwhile, the survivors of Gosa Village observe a Marine ship approaching the shore. It is led by Commodore Pudding Pudding with the intent of liberating the inhabitants of the island. The Commodore tells his men that their goal will be to rescue the survivors of the island as well as take out the pirates inhabiting it, as their sense of justice prevents them from overlooking a pirate base.\nArlong questions the existence of the 77th Branch of the Marines as he has never heard of them before. He concludes that they must be new, so he tells his lieutenants to either buy them off for 2,000,000 or to dispose of them if they turn down the bribe. Just as he finishes talking, his crew warns him of an impending cannonball coming towards him. Arlong then catches the cannonball with his open mouth and crushes it with his monstrous jaw strength. He spits out the remains and tells Kuroobi to cancel the negotiations. Arlong's top officers, Hatchan, Chew, and Kuroobi, offer to get rid of the Marines. Moments later, Chew jumps onto the deck of the Marine ship and attacks everyone on board. At the same time, Kuroobi tears off the ship's rudder, and Hatchan pushes it into the reef. The combination results in the creation of a massive whirlpool that sucks in the ship, presumably killing everyone on board.\nAs the officers return, Arlong apologizes for making the three go through all the trouble. They reply that it was nothing due to their fish-man strength and the maps Nami has drawn while claiming themselves to be \"invincible.\" Chew then asks Arlong whether he would let Nami go once she pays off her 100 million belly debt since she is an invaluable member of the Arlong empire. Arlong replies that he would rather die before he breaks a promise regarding money. Back to Luffy's side, Luffy yells at Johnny while grabbing him by the collar, telling him that what he is saying is nonsense and that Nami would never hurt one of her crewmates. Just then, Nami appears and asks Luffy who he is calling a crewmate.\n\n"
}