{
  "chapter_number": "Chapter 27",
  "title": "Plan",
  "short_summary": "Kaya and her servant are seen discussing Klahadore's anniversary present which is a new pair of glasses that Kaya ordered in from another town. In the village, nobody believes Usopp and he is chased away. Back at the shore, the Usopp Pirates had led Zoro and Nami there where they find Luffy who tells them about the assassination plan. Having run away from the villagers, Usopp finds himself at Kaya's mansion in an attempt to save her directly. However, she too believes it to be a lie, created as revenge for the harsh things Klahadore had said to Usopp earlier. With the villagers having caught up, and Kaya's servant holding a weapon to Usopp, the young man chooses to run instead. Meeting up with his followers, Usopp makes the decision to cover up the truth as another one of his lies, and protect the village himself. Witnessing his determination, Luffy, Zoro, and Nami all agree to help.\n",
  "long_summary": "At the mansion, Kaya and a servant discuss the glasses they brought Klahadore as an anniversary present from the next town.\nIn the village, Usopp is having trouble convincing the other villagers that the pirates really are coming and ends up fleeing in fear.\nAt the cliff, Luffy is awake, Nami, Zoro and the other Usopp Pirates are learning of the plan. Zoro questions why he was sleeping where he was, Luffy recalls being on the cliff before then. The Usopp Pirates realize they have to get away before the pirates coming tomorrow while they still have the chance to and run off. Luffy is more concerned with buying food from the butcher's shop before he is killed.\nAt the mansion Usopp arrives to save Miss Kaya. He tries to explain Klahadore is a pirate. Kaya does not believe Usopp and does not know what to make out of the story. As Kaya's other servant enters the room, Usopp is suddenly pounced upon by the two bodyguards out the front of the mansion, he struggles to break free. He knocks them out with his hand slingshot, Kaya beckons for him to stop. She believes Usopp is not the person she once knew. As the villagers come by the mansion, Usopp grabs Kaya, only to be slapped in the face and forced to let go. Kaya says Usopp is the worst person she knows and Usopp is forced to run when her servant gets a gun out and shots at him despite Kaya's plea. Usopp is hit by a shot in the arm, but manages to escape with his life. When Usopp is gone, Kaya faints onto his chest.\nAs he leaves the village, Luffy and the others catch up with him. He hides his wound from them and tries to say it was a lie to get back at the butler. The Usopp pirates believe him. The three kids wonder off home.\nLater that night Usopp explains to Luffy, Nami and Zoro that because he always lies, the villagers did not believe him. Since the villagers think Usopp is lying, Usopp decides he will make the lie become just that, tomorrow he will wait for the pirates and face them off so the villagers will think it was indeed a lie. The others announce they will help him fight the pirates so he does not have to face them alone.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Kaya",
    "Merry",
    "Usopp",
    "Piiman",
    "Ninjin",
    "Tamanegi"
  ],
  "ssum_frequencies": [
    [
      "the",
      11
    ],
    [
      "to",
      7
    ],
    [
      "and",
      6
    ],
    [
      "usopp",
      6
    ],
    [
      "a",
      3
    ],
    [
      "in",
      3
    ],
    [
      "up",
      3
    ],
    [
      "his",
      3
    ],
    [
      "kaya",
      2
    ],
    [
      "her",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      38
    ],
    [
      "usopp",
      16
    ],
    [
      "to",
      15
    ],
    [
      "and",
      12
    ],
    [
      "is",
      12
    ],
    [
      "he",
      12
    ],
    [
      "kaya",
      7
    ],
    [
      "pirates",
      7
    ],
    [
      "a",
      6
    ],
    [
      "him",
      6
    ],
    [
      "at",
      5
    ],
    [
      "villagers",
      5
    ],
    [
      "luffy",
      5
    ],
    [
      "not",
      5
    ],
    [
      "mansion",
      4
    ],
    [
      "they",
      4
    ],
    [
      "as",
      4
    ],
    [
      "in",
      4
    ],
    [
      "that",
      4
    ],
    [
      "was",
      4
    ]
  ]
}