{
  "chapter_number": "Chapter 3",
  "title": "Introducing Pirate Hunter Zoro",
  "short_summary": "Luffy and Koby arrive at an island with a Marine base, where a man named Roronoa Zoro is being held prisoner. Despite the fact that Zoro is seen as being a demon, Luffy is insistent on having him on his crew, and goes to meet him. There, he and Koby meet Rika, a young girl that Zoro protected, causing him to be imprisoned.\n",
  "long_summary": "Out at sea, Koby and Luffy are discussing Luffy's decision to recruit Zoro. Sometime later, they arrive at the Marine base Zoro is being held at. Luffy is surprised that they actually arrived, and Koby points out that these are the basics of navigation. Koby points out that Luffy can not just float around out at sea and that he must find a navigator soon. Luffy then says they should go eat.\nAt a restaurant, when Koby and Luffy discuss parting ways, Luffy mentions Zoro's name with shocking results from the other customers. When Koby mentions the name of the Marine in charge of the base, Morgan, the same effect occurs. In the street Koby comments on the reactions for the villagers here in the town, understanding why they reacted out of fear for Zoro due to his reputation, but not Morgan's name.\nAt the Marine base, after Luffy climbs up the wall to see Zoro, he climbs up another part of the wall to get a better view of someone he saw in the base. Koby also climbs up, but falls down again out of fear after sighting Zoro. Zoro offers the two the head of a bounty carrier if they will free him due to him going without food for 9 days.\nAs they talk with Zoro, Rika suddenly appears next to them as she climbs using a ladder, hushing them to be quiet. Rika climbs over the wall; Koby beckons her to come back as she walks towards Zoro. She offers him some onigiri since he has not eaten in several days. Zoro refuses and tells her to go away.\nJust then, Morgan's son, Helmeppo, appears with a few Marines and starts mocking Zoro. He snatches the rice balls from Rika and eats one of them. However, he soon spits it out due to the fact she made them using sugar instead of salt. He knocks them to the ground and stomps on them, much to Koby's shock at seeing someone affiliated with the Marines do such a cruel thing. She cries, lamenting on how she worked hard to make them. Helmeppo then points out the law made by his father, which states that anyone who assists a prisoner will also be found guilty of the crimes the prisoner has committed. Helmeppo says that since she is a child, she will be let off the hook. He then orders one of the Marines to toss her over the wall. When he refuses, he reminds them who his father is and the Marine throws her over the wall, forcing Luffy to catch her. Helmeppo continues to mock Zoro, but Zoro remains strong about his situation.\nAfter Helmeppo is gone, Luffy talks to Zoro about joining his crew. Zoro states that he will not join a pirate crew and become a criminal as he has his own dream to follow. After they finish talking, Zoro asks Luffy to give him the rice balls to eat despite the state they are now in. He then tells Luffy to tell Rika that he ate them all and that they were tasty.\nLater, Luffy explains how Zoro ate the rice balls and enjoyed them to Rika. Koby is surprised at how considerate Zoro was, despite the reputation he holds. She explains that Zoro is not a bad person and that he was arrested for killing Helmeppo's pet wolf, Soro, while defending her from him, as Soro was running wild, terrorizing the town at the time. As Rika finishes explaining the story, Helmeppo appears bragging about going back on his promise to Zoro and says that he plans on having him killed in three days. Luffy hits him out of anger and after Helmeppo runs away, Luffy decides Zoro is joining his crew.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Morgan (mentioned only)",
    "Helmeppo",
    "Rika",
    "Koby",
    "Roronoa Zoro",
    "Soro (flashback)",
    "Mikio Itoo (on wanted poster)"
  ],
  "ssum_frequencies": [
    [
      "a",
      4
    ],
    [
      "and",
      3
    ],
    [
      "zoro",
      3
    ],
    [
      "is",
      3
    ],
    [
      "him",
      3
    ],
    [
      "luffy",
      2
    ],
    [
      "koby",
      2
    ],
    [
      "being",
      2
    ],
    [
      "that",
      2
    ],
    [
      "on",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      37
    ],
    [
      "to",
      23
    ],
    [
      "zoro",
      20
    ],
    [
      "he",
      17
    ],
    [
      "and",
      15
    ],
    [
      "luffy",
      14
    ],
    [
      "of",
      13
    ],
    [
      "that",
      12
    ],
    [
      "a",
      12
    ],
    [
      "them",
      10
    ],
    [
      "out",
      9
    ],
    [
      "at",
      9
    ],
    [
      "koby",
      9
    ],
    [
      "they",
      9
    ],
    [
      "she",
      9
    ],
    [
      "is",
      8
    ],
    [
      "his",
      8
    ],
    [
      "in",
      7
    ],
    [
      "him",
      7
    ],
    [
      "helmeppo",
      7
    ]
  ]
}