{
  "chapter_number": "Chapter 159",
  "title": "Come On",
  "short_summary": "After being saved by Ace, the Straw Hat Pirates reach the Going Merry and depart to the desert. While Luffy explains his friends that Ace and he are brothers, Ace jumps on board for a quick family reunion.\n",
  "long_summary": "The Baroque Works association has some strange rules. In order to reach the envied agent seats, its members do not hesitate to kill each other. Mr. 11, who had been arrested by the Marines, learns this at the cost of his life.\nMeanwhile, the Straw Hats have escaped the Marines, thanks to Ace, and are heading back to the Going Merry, intending to sail the ship up the river, then continue on to the desert. Prior to departing, Vivi entrusts Karoo with an important task: to carry a letter detailing the situation and explaining what she and Igaram have discovered in regards to the Baroque Works conspiracy to her father, Cobra, in Alubarna, in order to give him hope.\nOn board of the Merry, Luffy tells his friends about Ace. He is his elder brother by three years, and is a pirate as well. Luffy also expresses his surprise that Ace has eaten a Devil's Fruit - the Mera Mera no Mi. Suddenly, Ace appears on board. He proposes that Luffy and his crew join the Whitebeard Pirates, an offer Luffy flatly denies. Ace tells Luffy of his admiration for Whitebeard, and his desire to see him become the Pirate King, to which Luffy replies that he will just have to fight him for the title.\nIn Nanohana, Smoker appears concerned: not only because Ace's intervention prevented him from apprehending Luffy, but also because he recognized the princess of Arabasta among the Straw Hat Pirates. He expresses his contempt for the Warlord, telling Tashigi that tigers never change their stripes - once a pirate, always a pirate.\nBack on the Going Merry, Ace hands Luffy a strange piece of paper, which he says will help them see each other again, and thanks Luffy's crewmates for taking care of his younger sibling before returning to his ship. Ace is currently chasing after a pirate named Blackbeard, his former subordinate, who committed the unforgivable crime of killing a crewmate. As the boats of the Baroque Agents Billions close in, the members of the Straw Hat crew express their surprise and admiration at the two brothers' relationship. Ace then single-handedly takes down the many Billions ships, urging his brother to meet him, 'at the top'.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Tony Tony Chopper",
    "Whitebeard (shadowed)",
    "Portgas D. Ace",
    "Yurikah (cover)",
    "Jango (cover)",
    "Smoker",
    "Fullbody (cover)",
    "Tashigi",
    "Nefertari Vivi",
    "Karoo",
    "Mr. 11",
    "Mr. Mellow"
  ],
  "ssum_frequencies": [
    [
      "ace",
      3
    ],
    [
      "the",
      3
    ],
    [
      "and",
      2
    ],
    [
      "after",
      1
    ],
    [
      "being",
      1
    ],
    [
      "saved",
      1
    ],
    [
      "by",
      1
    ],
    [
      "straw",
      1
    ],
    [
      "hat",
      1
    ],
    [
      "pirates",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      29
    ],
    [
      "to",
      16
    ],
    [
      "his",
      12
    ],
    [
      "of",
      9
    ],
    [
      "ace",
      8
    ],
    [
      "and",
      8
    ],
    [
      "a",
      8
    ],
    [
      "luffy",
      8
    ],
    [
      "in",
      6
    ],
    [
      "he",
      6
    ],
    [
      "him",
      5
    ],
    [
      "pirate",
      5
    ],
    [
      "on",
      4
    ],
    [
      "that",
      4
    ],
    [
      "for",
      4
    ],
    [
      "baroque",
      3
    ],
    [
      "at",
      3
    ],
    [
      "straw",
      3
    ],
    [
      "have",
      3
    ],
    [
      "merry",
      3
    ]
  ]
}