{
  "chapter_number": "Chapter 175",
  "title": "Release",
  "short_summary": "The Straw Hats escape from the cage, thanks to Sanji.\n",
  "long_summary": "The chapter begins with Chopper dashing while Sanji explains to Vivi that Chopper is their decoy. When Vivi asks what happened, Sanji has a flashback of him and one of the Millions talking to Crocodile. After he makes Crocodile believe Sanji was captured by the Millions and was beaten up, Sanji tells Chopper to go on a rampage, shouting out that he is Mr. Prince, which Chopper does. When Crocodile comes to the scene, he sees Chopper and tries to kill him, but Chopper switches from Heavy Point to Brain Point and quietly tiptoes past the enraged Crocodile.\nMeanwhile, the trapped Straw Hats are screaming because of the room that is quickly filling with water. Nami tells everyone to make the Bananawani mad so that it would chomp the cage apart, but they find out that the cage is able to resist even the Bananawani's jaws, much to their horror. Usopp and Luffy yell at Smoker asking why he was so calm in such a situation, but Smoker responds by asking how much of Crocodile's plan the Straw Hats know. He reveals that Miss All-Sunday has been running from the government for over 20 years, he then tells them that Crocodile and Miss All Sunday's plan may shake the entire world, but Luffy says that no reasons are needed to beat Crocodile up. When Smoker asks how they are going to escape, the Straw Hats remember their situation and start panicking again, and Luffy starts to feel weak because of the seawater touching him.\nWhen everyone becomes desperate, Sanji finally appears, defeating a Bananawani with a single kick, to everyone's surprise. Everyone becomes full of hope once again, and Luffy gives Vivi a thumbs-up, saying she did a good job. As more Bananawanis close in, Smoker tells the Straw Hats that the third Bananawani that came in is the one that ate the key. When Luffy asks how he knows, Smoker says the growl is the same. Elsewhere, a frustrated Crocodile walks back to where the cage is saying it was smart of the Straw Hats to think of a decoy.\nMiss All Sunday asks what if the Straw Hat Pirates already found the key, and Crocodile answers by saying that the key was a fake in the first place and he has the real one. By the time Crocodile arrives in the room, the cage is swinging open underwater, while beaten up Bananawanis and a beaten up Mr. 3 floats in the water with a piece of paper on him that says \"See ya, shitty Croc - Mr Prince\" on it, much to Crocodile's enragement.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Tony Tony Chopper",
    "Smoker",
    "Nefertari Vivi",
    "Crocodile",
    "Miss All Sunday",
    "Mr. 3 (K.O)"
  ],
  "ssum_frequencies": [
    [
      "the",
      2
    ],
    [
      "straw",
      1
    ],
    [
      "hats",
      1
    ],
    [
      "escape",
      1
    ],
    [
      "from",
      1
    ],
    [
      "cage",
      1
    ],
    [
      "thanks",
      1
    ],
    [
      "to",
      1
    ],
    [
      "sanji",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      33
    ],
    [
      "to",
      16
    ],
    [
      "that",
      13
    ],
    [
      "a",
      12
    ],
    [
      "and",
      12
    ],
    [
      "of",
      9
    ],
    [
      "crocodile",
      9
    ],
    [
      "is",
      8
    ],
    [
      "he",
      8
    ],
    [
      "chopper",
      6
    ],
    [
      "straw",
      6
    ],
    [
      "in",
      6
    ],
    [
      "sanji",
      5
    ],
    [
      "when",
      5
    ],
    [
      "was",
      5
    ],
    [
      "hats",
      5
    ],
    [
      "luffy",
      5
    ],
    [
      "smoker",
      5
    ],
    [
      "with",
      4
    ],
    [
      "asks",
      4
    ]
  ]
}