{
  "chapter_number": "Chapter 71",
  "title": "Lords of All Creation",
  "short_summary": "Usopp discovers Nami's family and what her true intentions were when joining the Straw Hats. Zoro is captured by Arlong in Arlong Park and discovers that Nami has been working with Arlong from day one.\n",
  "long_summary": "When Nojiko tells Usopp that the house he is currently in is the house where Nami lived as a child as well as informing him that they are adopted sisters and telling him that their \"mother\" is dead. Usopp says that Nami betrayed her village since she joined Arlong Pirates, who control her hometown, Cocoyasi Village. Nojiko questions Usopp's business with Nami. Usopp replies that he has some things to think about due to all the info he has received. Additionally, he says that all she wanted from the crew was for the treasure and asks why she saved his village and looked happy with them. Nojiko questions Nami being happy and then restates that he shouldn't start anything with the Arlong Pirates since it will lead to death. Usopp replies that he will just leave since he has found the ship. After Nojiko points out the Going Merry, Usopp realizes that they landed near Cocoyasi Village and Usopp begins to panic. Nojiko asks what's wrong and Usopp replies that he remembered that one of his crewmates was captured by the fish-men and is in a critical condition.\nIndeed, Zoro has been taken to Arlong Park where he is questioned by Arlong. Zoro insults Arlong by calling him a half-fish mutant and restates that he is looking for a girl. Arlong says he will forgive Zoro once for the insult and says fish-men are superior to humans. Shortly after, Nami appears much to Zoro's surprise seeing her aligned with Arlong. Arlong says she is an exception to the human race and informs him that she is the Arlong Pirates' cartographer. Zoro questions why Nami would side with Arlong. Arlong questions if they know each other. Nami replies that he was just another victim. Then Zoro asks Nami if this is her \"true self\" and she answers, \"yes\" and that she had been aligned with Arlong all along. After Nami's statement, Arlong laughs and calls her a \"cold-blooded witch\" who only wants money. Nami hides her scowl upon hearing Arlong make such a statement. Zoro notices this and jumps into the pool, shocking everyone. Nami dive into the water and saves Zoro. After the rescue, Nami asks what he was doing to which Zoro remarks that he should be asking that question to her and says she shouldn't be acting tough. Nami replies that she does not want him involved in this anymore. Afterwards, Nami tells the fish-man to lock Zoro up and she will kill him later. Shortly after, a fish-man approaches Arlong saying that a longed nose human got away. Arlong says that the human is probably in Cocoyasi Village and says he has business to attend to their anyway.\nIn Cocoyasi Village, the villagers hear of Arlong's coming and wonder what business he has since he already collected the tribute. Genzo answers by saying that Arlong found his weapons. Arlong arrives and begins questioning Genzo on the possession of weapons. Genzo answers that it is a hobby to collect weapons. Arlong says he cannot possess any weapons since all they do is bring violence. A frightened Usopp says he is not human. Nojiko replies that he is a fish-man, and says that Nami must be at Arlong Park since she is not with Arlong. Arlong threatens Genzo by stating back when he destroyed Gosa Village due to no one paying tributes. Nojiko explains to Usopp that a tribute is the money they pay every month in order for them live under Arlong's protection. If one person does not pay in the village, the entire village is destroyed. Before leaving, Arlong tells the town to work hard for money since tribute time is approaching.\nBack at Arlong Park, Nami rushes Zoro to escape before Arlong's return.\n\n"
}