{
  "chapter_number": "Chapter 144",
  "title": "Snowy Tale",
  "short_summary": "Dr. Hiriluk's sacrifice.\n",
  "long_summary": "After eating the Amiudake soup, Hiriluk feels much stronger. But while he was eating the medicine, a reaction happened in his lab. That was the reaction he was researching since so long ago. In joy after this miracle, he departs, suddenly telling Chopper to rest. He heads toward Dr. Kureha's house and begs her to complete two things, pretending he has not enough time to fulfill them: to continue his research on the Sakura powder and to teach Chopper medical knowledge so that he can become a good doctor. Kureha is angered by the favors and the request for them to be completed for free. She kicks Hiriluk out.\nIn town, people are desperate. The Isshi-20 are sick and there are no more doctors left to help them, the reasons for Hiriluk to hurry back to town. He is determined to cure the sick doctors and rushes toward the castle, despite the fact he is blocked by Wapol's soldiers.\nMeanwhile, Kureha is worried because she does not understand why Hiriluk is in such hurry while he has still 2 weeks to live. When she rushes into his house, she encounters Chopper, who claims that the doctor is much better thanks to his mushroom soup. The old woman is in shock, as the mushroom is poisonous and Hiriluk has only one hour left before he dies. Chopper does not understand and he shows the pirate sign that Hiriluk told him was a symbol of a magic cure next to the mushroom picture he found in a book. Kureha tells the distraught reindeer that the skull in the book means poison and there is no cure for all diseases. She further explains that good intentions are not enough to help people and he can do nothing without learning medical knowledge and the skills to use them. Chopper then starts wailing uncontrollably because of his foolishness as Kureha pities him. Hiriluk has reached the castle so that he could die there.\n\n",
  "characters": [
    "Nami (cover)",
    "Wapol",
    "Dalton",
    "Kureha",
    "Hiriluk",
    "Tony Tony Chopper",
    "Nefertari Vivi (cover)",
    "Karoo (cover)"
  ],
  "ssum_frequencies": [
    [
      "dr",
      1
    ],
    [
      "hiriluks",
      1
    ],
    [
      "sacrifice",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      21
    ],
    [
      "to",
      15
    ],
    [
      "he",
      14
    ],
    [
      "and",
      10
    ],
    [
      "is",
      9
    ],
    [
      "hiriluk",
      7
    ],
    [
      "in",
      7
    ],
    [
      "that",
      7
    ],
    [
      "a",
      5
    ],
    [
      "his",
      5
    ],
    [
      "chopper",
      5
    ],
    [
      "she",
      5
    ],
    [
      "was",
      4
    ],
    [
      "has",
      4
    ],
    [
      "not",
      4
    ],
    [
      "them",
      4
    ],
    [
      "kureha",
      4
    ],
    [
      "for",
      4
    ],
    [
      "are",
      4
    ],
    [
      "so",
      3
    ]
  ]
}