{
  "chapter_number": "Chapter 177",
  "title": "30 Million vs. 81 Million",
  "short_summary": "Luffy saves Vivi from Crocodile's hook but ends up being separated from the others. Vivi is worried about him but the Straw Hat reassures her: Luffy will win this battle and they will stop the rebellion and find each other in Alubarna.\n",
  "long_summary": "As Luffy is being flung out to the dessert he asks everyone to get Vivi safely to the royal palace, while Vivi warns him that there are two of them, Zoro then orders Chopper to take them straight to Alubarna, while Nami tells Vivi that Luffy will be fine and everyone in the crew encourages her. Vivi then shouts at Luffy that they will be waiting for him at Alubarna, miss all Sunday laughs at the fact that Vivi has gotten away, but Crocodile is unfazed asking her to contact their agents in Alubarna. Luffy then comments that though Vivi is weak she is still trying to save everyone, that she wants the rebellion to end without anyone dying, Crocodile scoffs at this saying it is foolish and asking Luffy what he thinks, to which he responds that it is foolish. but he also adds that he will stop Crocodile so that Vivi does not have to work so hard, Crocodile also laughs at this as well saying that he has crushed hundreds of people like Luffy into dust. Luffy responds that Crocodile is pretty stupid which angers him immensely but makes Miss All Sunday laugh, Crocodile then questions what she is laughing at calling her by her real name: Nico Robin, she then leaves for Alubarna while Crocodile throws down an hourglass saying that he will only give Luffy three minutes which is fine with Luffy. Luffy then starts to attack Crocodile who manages to evade his attacks easily or else just lets them pass through him, he then tries to tell Luffy that it is pointless to fight him, but Luffy does not listen and keeps up his assault which angers Crocodile even more.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Tony Tony Chopper",
    "Nefertari Vivi",
    "Crocodile",
    "Nico Robin",
    "Matsuge",
    "Hasami"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "luffy",
      2
    ],
    [
      "vivi",
      2
    ],
    [
      "from",
      2
    ],
    [
      "but",
      2
    ],
    [
      "will",
      2
    ],
    [
      "and",
      2
    ],
    [
      "saves",
      1
    ],
    [
      "crocodiles",
      1
    ],
    [
      "hook",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      14
    ],
    [
      "that",
      13
    ],
    [
      "luffy",
      12
    ],
    [
      "is",
      10
    ],
    [
      "crocodile",
      9
    ],
    [
      "he",
      8
    ],
    [
      "vivi",
      7
    ],
    [
      "then",
      7
    ],
    [
      "at",
      6
    ],
    [
      "the",
      5
    ],
    [
      "him",
      5
    ],
    [
      "alubarna",
      4
    ],
    [
      "will",
      4
    ],
    [
      "her",
      4
    ],
    [
      "but",
      4
    ],
    [
      "she",
      4
    ],
    [
      "which",
      4
    ],
    [
      "everyone",
      3
    ],
    [
      "while",
      3
    ],
    [
      "them",
      3
    ]
  ]
}