{
  "chapter_number": "Chapter 26",
  "title": "Captain Kuro's Plan",
  "short_summary": "Talking about their assassination plan in more detail, Jango reveals that Klahadore is actually a fake name, and he is in fact the previous captain of the Black Cat Pirates who faked his death, Kuro. In a rash attempt to stop them, Luffy reveals their presence and tells them to leave Kaya alone. Jango responds by putting Luffy to sleep using his hypnotism, only for Luffy to tilt forward and fall off the cliff. Thinking him dead, Kuro disregards Usopp's presence as he is a well known liar, and the chances of anybody believing him are none. Rushing to the village, Usopp tries his best to warn of the incoming attack only for the villages to think it is another of his stories. The scene changes to the Black Cat Pirate's ship where Kuro readies his men, and Luffy is shown to be sleeping.\n",
  "long_summary": "Klahadore asks Jango to not mention the word \"murder\" and to stop calling him Captain Kuro. Usopp and Luffy spy on the pair and Usopp suddenly remembers the name \"Captain Kuro\". Usopp recalls he was a feared pirate who raided many towns and was finally put to death three years ago after he was captured by the Marines.\nJango finds it amusing his captain declared he was bored with a pirate's life, made him captain and secretly settled in the village, but so long as there is a reward he is happy doing whatever Kuro asks of him. According to Kuro, all Jango has to do is hypnotize Kaya to sign a will so he rightfully owns the mansion because \"Klahadore\" is not a member of the family and therefore cannot inherit her fortune otherwise. Once the task is done he must then kill her without making it look like she was murdered. Jango mocks his former captain, stating that if it was him, he would just invade the mansion and takes the riches, however Kuro reminds him that would make him a pirate again. Jango mocks him once again for asking for a peaceful life when he plans to kill everyone to get Kaya's money, but Kuro states he did not expect some things like Kaya's parents death as they died unexpectedly in an accident.\nAs Usopp slowly comes round to the realization of what they are hearing, he has to contend with Luffy who does not have a clue on what is going on. While he deals with thoughts related to the problem at hand, Luffy stands up and shouts to the pair below them. While Usopp is horrified at what Luffy did, Usopp grabs him to pull him down before he is seen, but Kuro and Jango look up the cliff and see the pair.\nAll of a sudden, Jango holds up his ring and begins to hypnotize the pair, while Usopp looks away in time, Luffy is clueless about the ring to do so. While Luffy has fallen asleep, so apparently has Jango, Usopp yells to Luffy but Luffy falls off the cliff seemingly to his death. While Usopp yells about killing Luffy, Jango asks if Usopp should be killed as well but Kuro just states even if he tells the village no one will believe Usopp on what he heard, due to Usopp's reputation as a liar.\nAs he rushes to the village, he passes Nami, Zoro, and the other Usopp Pirates. As Usopp enters the village and warns them, they think it is a prank again and are angry he has used the joke twice in one day. They tell him they have to punish him this time for lying as his joke has gone too far and that he is untrustworthy, telling him they would believe him if only he had been a trustworthy man like Klahadore.\nBack at the coast, Kuro has gone to greet his men after three years away from them and ensure the plan in the morning. At the mansion, Kaya asks for Klahadore, another servant tells her he went to the next town. Back at the coast at the bottom of the cliff, Luffy is sound asleep.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Kuro",
    "Jango",
    "Kaya",
    "Merry",
    "Usopp",
    "Piiman",
    "Ninjin",
    "Tamanegi"
  ],
  "ssum_frequencies": [
    [
      "the",
      9
    ],
    [
      "to",
      9
    ],
    [
      "is",
      5
    ],
    [
      "and",
      5
    ],
    [
      "his",
      5
    ],
    [
      "of",
      4
    ],
    [
      "luffy",
      4
    ],
    [
      "in",
      3
    ],
    [
      "a",
      3
    ],
    [
      "kuro",
      3
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      31
    ],
    [
      "to",
      22
    ],
    [
      "he",
      20
    ],
    [
      "and",
      16
    ],
    [
      "him",
      13
    ],
    [
      "usopp",
      13
    ],
    [
      "a",
      12
    ],
    [
      "is",
      12
    ],
    [
      "luffy",
      10
    ],
    [
      "jango",
      9
    ],
    [
      "kuro",
      9
    ],
    [
      "as",
      8
    ],
    [
      "has",
      7
    ],
    [
      "was",
      6
    ],
    [
      "his",
      6
    ],
    [
      "they",
      6
    ],
    [
      "at",
      6
    ],
    [
      "captain",
      5
    ],
    [
      "in",
      5
    ],
    [
      "but",
      5
    ]
  ]
}