{
  "chapter_number": "Chapter 23",
  "title": "Captain Usopp Appears",
  "short_summary": "As Luffy, Zoro and Nami continue to sail through East Blue, Nami points out how unprepared they are for the Grand Line, and they decide to get a larger ship. As the perspective changes to a nearby island, Usopp is introduced, running through his village warning them of approaching pirates. When it is revealed he was lying, he is chased off by the villagers, and meets up with his Usopp Pirates further down the road. One of the members, Tamanegi, warns that actual pirates are approaching, and the crew goes to spy on them. When the pirates turn out to be Luffy and the others, Usopp winds up having a meal with them. Before the chapter ends, a young, bedridden girl is shown.\n",
  "long_summary": "The chapter starts with Nami scolding Luffy for being reckless and ill prepared for the Grand Line. While Luffy and Zoro say the only important things they need are food and alcohol, Nami begins to plan their future. She tells them they need to head south to a nearby island to get a ship and supplies.\nOn an island, Usopp stands looking out to sea. He dashes into his village and begins shouting \"The pirates are coming!\", but as he runs further, he announces that he was lying. The villagers begin to chase him and throw objects, but he outruns them all. As the villagers lose sight of him and wonder where he went, he laughs and brags to himself that they were tricked once again. As he rests back in the tree he was hiding in, Piiman and Ninjin show up. As they wonder where their fourth member is, Tamanegi rushes up, saying that there are pirates approaching the island.\nThe others accuse him of lying, but he claims the ship even has the flag of the Buggy Pirates on it. After hearing this, Usopp tries to make up excuses to run away, but the others see through it. When Tamanegi mentions he could only see three pirates, Usopp changes his mind and prepares to repel the attackers.\nLuffy, Nami and Zoro reach the island and land, unaware at first that Usopp and the others are watching them, but Zoro spots them. Piiman, Ninjin and Tamanegi run away, leaving Usopp alone. Usopp claims to be the toughest pirate of the village, with a vast army of followers. When Nami accuses him of lying, he accidentally admits to it: in trying to recover, he makes Luffy laugh, and he claims to be \"Usopp the Proud\".\nAt a restaurant, Luffy and the others dig into a meal. Usopp tells them that if they want a ship, they should try the mansion in town, where a sick young girl lives. Her parents died the year before, leaving all their fortune and servants to her, and making her incredibly wealthy. Nami says that they should move onto the next village and try there. Usopp offers to be their captain, but the Straw Hats refuse and keep eating, much to his despair.\nAt the mansion, the young girl Kaya asks her butler Klahadore if she can meet Usopp.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Kaya",
    "Klahadore (shadowed)",
    "Mornin",
    "Usopp",
    "Piiman",
    "Ninjin",
    "Tamanegi"
  ],
  "ssum_frequencies": [
    [
      "the",
      9
    ],
    [
      "and",
      5
    ],
    [
      "to",
      5
    ],
    [
      "a",
      4
    ],
    [
      "is",
      4
    ],
    [
      "pirates",
      4
    ],
    [
      "usopp",
      3
    ],
    [
      "them",
      3
    ],
    [
      "as",
      2
    ],
    [
      "luffy",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      26
    ],
    [
      "and",
      20
    ],
    [
      "to",
      17
    ],
    [
      "he",
      14
    ],
    [
      "usopp",
      10
    ],
    [
      "they",
      7
    ],
    [
      "a",
      7
    ],
    [
      "but",
      6
    ],
    [
      "that",
      6
    ],
    [
      "of",
      6
    ],
    [
      "nami",
      5
    ],
    [
      "luffy",
      5
    ],
    [
      "them",
      5
    ],
    [
      "are",
      4
    ],
    [
      "their",
      4
    ],
    [
      "island",
      4
    ],
    [
      "pirates",
      4
    ],
    [
      "as",
      4
    ],
    [
      "him",
      4
    ],
    [
      "in",
      4
    ]
  ]
}