{
  "chapter_number": "Chapter 124",
  "title": "The Tea is Good",
  "short_summary": "While trying to save his friends, Luffy falls into Miss Goldenweek's Colors Trap. She is able to use the power of color to influence people's behavior and Luffy, being so simple-minded, is very easily influenced.\n",
  "long_summary": "Nami asks Luffy to free them from the candle, but Luffy seems unwilling to help even thought he realizes the danger.\nMeanwhile, Usopp and Karoo are hiding in bushes and are suddenly found by Mr. 5 and Miss. Valentine. They explain that Luffy is under the spell of Color Trap, where she can influence the behavior of a victim based on the colors she draws on them, before attacking the duo. Usopp and Karoo try to escape, while Vivi realizes that Luffy's lethargic attitude must be due to of Miss Goldenweek, who explains her \"color trap\" ability.\nVivi then tricks Luffy into stepping out of the trap which returns Luffy to normal. Unfortunately, he then gets caught in another of Miss. Goldenweek's traps as she paints it directly on his shirt.\nNami, Zoro and Vivi look on in horror of their impeding doom.\nMeanwhile, Mr. 5 and Miss Valentine are still chasing Usopp and Karoo, who frees Luffy from his trap but he is once again unable to combat Miss Goldenweeks' abilities. As the fight between the two duos continue, Mr. 5 realizes that he is not fast enough to catch Usopp and Karoo, while Usopp heads back to the candle and finds he friends waxed. Mr. 5 reveals a new weapon: a .44 revolver that can shoot 6 bullets at the same time.\nHowever, instead of trying to help himself, Usopp fires at Luffy destroying his shirt and freeing him from color trap once more. Usopp is promptly shot by Mr. 5. Luffy becomes furious and declares that he will defeat them.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji (cover)",
    "Nefertari Vivi",
    "Karoo",
    "Miss Goldenweek",
    "Mr. 5",
    "Miss Valentine"
  ],
  "ssum_frequencies": [
    [
      "to",
      3
    ],
    [
      "luffy",
      2
    ],
    [
      "is",
      2
    ],
    [
      "while",
      1
    ],
    [
      "trying",
      1
    ],
    [
      "save",
      1
    ],
    [
      "his",
      1
    ],
    [
      "friends",
      1
    ],
    [
      "falls",
      1
    ],
    [
      "into",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      11
    ],
    [
      "and",
      11
    ],
    [
      "to",
      9
    ],
    [
      "luffy",
      8
    ],
    [
      "usopp",
      7
    ],
    [
      "of",
      7
    ],
    [
      "he",
      6
    ],
    [
      "mr",
      5
    ],
    [
      "5",
      5
    ],
    [
      "miss",
      5
    ],
    [
      "that",
      5
    ],
    [
      "trap",
      5
    ],
    [
      "karoo",
      4
    ],
    [
      "is",
      4
    ],
    [
      "on",
      4
    ],
    [
      "them",
      3
    ],
    [
      "from",
      3
    ],
    [
      "realizes",
      3
    ],
    [
      "are",
      3
    ],
    [
      "in",
      3
    ]
  ]
}