{
  "chapter_number": "Chapter 189",
  "title": "2",
  "short_summary": "Having discovered Mr. 2's weakness, Sanji is able to beat him. However, he lets him live as a thanks for the good fight. At the palace, Vivi and Chaka are discussing what they should do now when suddenly Crocodile appears. Meanwhile, Zoro has lost Nami. Nami is running for her life, chased by Mr. 1 and Miss Doublefinger who prefer to fight against the weakest first.\n",
  "long_summary": "Attacking Mr. 2 with a fierce kick, Sanji begins to barrage him with kicks, while Mr. 2 lands some attacks of his own. The two manages to attack with simultaneous finishing blows, with Sanji falling to his knees and Mr. 2 being knocked into a building, losing the fight and declaring Sanji as the winner. While Sanji comments that if Mr. 2 changes into Nami, he cannot kill him, Mr. 2 dismisses this, saying he cannot move, and that Baroque Works will probably terminate him anyway for losing. Sanji extends his hand, saying it was a good fight, with Mr. 2 grabbing it, crying to himself that this is the friendship of fighting. Sanji walks away after taking back Usopp's goggles, while an injured Mr. 2 notes that Sanji finished him off anyway.\nBack at the palace, Chaka orders the soldiers to load a lot of gunpowder so the palace can be destroyed. He hesitates, but is consoled by Vivi, telling him that it is because of him that a difference can be made. She then apologizes for leaving the country so suddenly, also pointing out that there can be no peace in this country as long as \"that man\" is still alive. She then grows worried about the other Straw Hat Pirates, but remembers Zoro's words to go on and continue living no matter what may happen to them. Chaka then compliments Vivi for developing an independent personality, and shares her promise to Luffy to give the Straw Hats a huge feast when this battle is over. Crocodile then appears at the palace, pointing out that Vivi managed to cause a lot of trouble.\nAt the Northern area of Alubarna, Zoro shows concern for Nami, as she ran away even though Zoro told her to hide. Zoro, running off to look for her, heads off in another direction as a panicking Nami is trying to run from a pursuing Mr. 1 and Miss Doublefinger. While Nami violently asks where the stupid swordsman went, Mr. 1 and Miss Doublefinger continue with their calm pursuit, exclaiming that as pro assassins, it is common practice to target the weakest first.\n\n",
  "characters": [
    "Monkey D. Luffy (flashback)",
    "Roronoa Zoro",
    "Nami",
    "Sanji",
    "Hatchan (cover)",
    "Nefertari Vivi",
    "Chaka",
    "Crocodile",
    "Mr. 1",
    "Miss Doublefinger",
    "Mr. 2 Bon Kurei",
    "Goldfish Princess (cover)",
    "Kentauros",
    "Hikoichi"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "mr",
      2
    ],
    [
      "is",
      2
    ],
    [
      "to",
      2
    ],
    [
      "him",
      2
    ],
    [
      "for",
      2
    ],
    [
      "fight",
      2
    ],
    [
      "and",
      2
    ],
    [
      "nami",
      2
    ],
    [
      "having",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      14
    ],
    [
      "the",
      14
    ],
    [
      "that",
      10
    ],
    [
      "mr",
      9
    ],
    [
      "a",
      9
    ],
    [
      "2",
      7
    ],
    [
      "sanji",
      7
    ],
    [
      "and",
      7
    ],
    [
      "is",
      7
    ],
    [
      "with",
      6
    ],
    [
      "him",
      6
    ],
    [
      "of",
      6
    ],
    [
      "as",
      6
    ],
    [
      "for",
      5
    ],
    [
      "while",
      4
    ],
    [
      "nami",
      4
    ],
    [
      "this",
      4
    ],
    [
      "it",
      4
    ],
    [
      "then",
      4
    ],
    [
      "his",
      3
    ]
  ]
}