{
  "chapter_number": "Chapter 184",
  "title": "Molehill 4th St.",
  "short_summary": "Usopp discovers the trap that Mr. 4 and Miss Merry Christmas have planned at the outer east gate. Chopper has already discovered the tricky explosive base balls launched by the dog-gun Lassoo and tries to warn Usopp about them. With her Devil Fruit, Miss Merry Christmas dug into the soil to create many tunnels allowing them to completely control the battlefield. Chopper is unable to use his Rumble Ball as his enemies are not visible most of the time. However, Usopp, after he fought against his usual cowardice took advantage of the tunnels to hide himself and to punch Mr. 4 in the head with a 5 ton hammer.\n",
  "long_summary": "At the southeast gate of Alubarna, Usopp and Chopper recover from the explosion caused by Mr. 4's dog, although Usopp still struggles to comprehend any of it. They then see the dog, Lassoo, and Usopp is appalled at its appearance as it has several gun features on its body. Lassoo sneezes out another exploding baseball, and the two pirates dodge it, but Mr. 4 hits it right toward Usopp with his bat. Usopp ducks under the ball, but it explodes right over him. Chopper holds the dazed Usopp as he notes that the balls are time bombs, and are too much for him to catch due to being heavy as cannonballs, which makes Mr. 4's power to hit them inhuman. Mr. 4 sets down his bat against the wall, but its weight causes it to fall through the wall, making Usopp bewildered at Mr. 4's strength.\nMiss Merry Christmas then arrives and berates Mr. 4 for not killing Usopp and Chopper yet, and the two pirates are frightened to see her again. Usopp leaves the fighting to Chopper while he tries to succumb to his injuries, causing Chopper to get angry, and Usopp wonders how he can deal with a bizarre creature like Lassoo. Miss Merry Christmas then reveals that Lassoo is a gun that \"ate\" the Inu Inu no Mi, Model: Dachshund thanks to special technology allowing inanimate objects to gain Devil Fruit powers. Usopp expresses his disbelief, but Miss Merry Christmas says that it does not matter since him and Chopper are about to die. She tells the two that their territory is named Molehill 4th St. as she partially transforms into a mole, although Usopp thinks that she more resembles a penguin. Miss Merry Christmas burrows into the ground, and Usopp takes the opportunity to escape, but Chopper tells him to look out as Lassoo emerges from the ground and fires a baseball bomb at him.\nThe ball suddenly curves away from Usopp at the last second, and Mr. 4 hits it high into the air. Usopp mocks Mr. 4's bad hit as the ball lands a ways away from him, but the ball suddenly begins rolling toward his back. Miss Merry Christmas says that Mr. 4 is not an ordinary cleanup hitter as Chopper enters Walk Point and saves Usopp from the blast. Miss Merry Christmas notes that Chopper is a Zoan like her as Lassoo fires more baseball bombs at the two pirates, which they attempt to dodge by remaining in constant motion. Chopper attempts to get rid of Mr. 4 by hurling a baseball back at him, but Miss Merry Christmas grabs him by the ankle as Mr. 4 hits the ball back at Chopper. However, Chopper enters his normal hybrid form, causing the ball to fly over him as he attacks Miss Merry Christmas and Mr. 4. However, the two agents disappear into the mole tunnels as Chopper reflects that using the Rumble Ball would take too much time with them. Mr. 4 and Miss Merry Christmas emerge behind Chopper and start looking for him as Chopper wonders where Usopp is; however, Usopp emerges from the mole tunnel and hits Mr. 4 with a five-ton hammer. Miss Merry Christmas wonders how he is strong enough to wield that, and Usopp tells her that people call him the Lord of Destruction, introducing himself as Captain Usopp.\n\n",
  "characters": [
    "Usopp",
    "Tony Tony Chopper",
    "Hatchan (cover)",
    "Mr. 4",
    "Miss Merry Christmas",
    "Lassoo",
    "Panda Shark (cover)"
  ],
  "ssum_frequencies": [
    [
      "the",
      9
    ],
    [
      "to",
      6
    ],
    [
      "usopp",
      3
    ],
    [
      "and",
      3
    ],
    [
      "his",
      3
    ],
    [
      "mr",
      2
    ],
    [
      "4",
      2
    ],
    [
      "miss",
      2
    ],
    [
      "merry",
      2
    ],
    [
      "christmas",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      31
    ],
    [
      "usopp",
      20
    ],
    [
      "to",
      19
    ],
    [
      "and",
      18
    ],
    [
      "chopper",
      15
    ],
    [
      "mr",
      14
    ],
    [
      "as",
      13
    ],
    [
      "him",
      11
    ],
    [
      "that",
      11
    ],
    [
      "4",
      10
    ],
    [
      "miss",
      10
    ],
    [
      "merry",
      10
    ],
    [
      "christmas",
      10
    ],
    [
      "a",
      9
    ],
    [
      "at",
      8
    ],
    [
      "it",
      8
    ],
    [
      "is",
      7
    ],
    [
      "but",
      7
    ],
    [
      "ball",
      7
    ],
    [
      "from",
      6
    ]
  ]
}