{
  "chapter_number": "Chapter 200",
  "title": "Water Luffy",
  "short_summary": "After rejoining the Straw Hats and Pell, Vivi tells them that a bomb is going to explode in ten minutes, and they scatter to search for the bomb. Meanwhile, Luffy and Crocodile continue their second fight. By getting water on the Warlord, Luffy is able to hit him, but the power of Crocodile is still fearsome.\n",
  "long_summary": "In Alubarna, Usopp is asked to find the shooter that will set off the bomb to blow up the city. Usopp states that since the bomb will produce a five kilometer blast radius, the shooter must be about 2.5 kilometers away. However, Vivi states that the shooters could be very close, as Crocodile would be the kind of person to kill his own comrades. Zoro and Sanji react in surprise, but suddenly notice and knock out a Baroque Works soldier trying to attack Vivi, stunning the group. Looking up, they see a large group of Baroque Works soldiers who say that if they kill Princess Vivi, they will earn a promotion. Sanji asks Zoro how much time he plans on taking, and Zoro states that they have to make every second count. Turning back to the soldiers, they state \"two seconds\" and begin their attack. Chopper, Usopp, Nami, Pell, and Vivi escape, looking to find somewhere safe. With the soldiers taken care of, Zoro and Sanji leave too, as Vivi wonders if they will be able to make it with only ten minutes left.\nAt the palace, Crocodile asks Luffy if he wants to defeat him, and Luffy answers with a yes. Crocodile says that even though Luffy was in danger, he could still see through his ability, but due to his age, Luffy thinks that with the knowledge, he will be able to defeat Crocodile. Crocodile says that this is wrong, and that he is one of the Seven Warlords of the Sea, prompting Luffy to say he is the eighth god. Nefertari Cobra is surprised to see Luffy, and Miss All Sunday tells him that Luffy is a pirate and that Luffy will be able to live a little longer. Cobra states that Luffy is the one who brought Vivi to Arabasta, and Luffy launches a punch aimed at Crocodile's head. However, Crocodile easily dodges and grabs Luffy's arm, aiming to suck it dry with his powers. Luffy, having forgotten, kicks at Crocodile's head but misses and flies by. He drinks some more water and pours it over his head, saying that Crocodile had said that a Devil Fruit becomes stronger if it is used in different ways. Luffy then punches again, but strums his arm, making it appear as several punches at once, using Gomu Gomu no Shotgun. Crocodile attacks with Desert Spada, destroying part of the palace, but Luffy dodges and punches at Crocodile again.\nCrocodile says that Luffy always uses the same technique, but this time, Luffy runs at Crocodile and smacks him in the face, saying that he is totally confident. Crocodile falls, and Luffy tries to soak the Warlord by throwing the whole water barrel at him; however, Crocodile uses Sables to create a sandstorm that nearly blows Luffy away. Luffy barely manages to save the water barrel, and Crocodile laughs at him, saying that Luffy is really getting into the fight. Crocodile continues, saying the fight is no different, because if Luffy loses the water barrel then he is out of tricks. Luffy then states that he is different from last time, and drinks all the water, causing Crocodile to wonder if he is serious. However, he springs a leak, causing Miss All Sunday to laugh and causing Crocodile to wonder if he understands the situation. Crocodile yells at Luffy, asking him if he is joking, but Luffy spits water on him before hitting Crocodile with a Gomu Gomu no Bazooka, saying he is always serious.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Tony Tony Chopper",
    "Hatchan (cover)",
    "Macro (cover)",
    "Camie (cover)",
    "Pappag (cover)",
    "Nefertari Cobra",
    "Nefertari Vivi",
    "Pell",
    "Crocodile",
    "Nico Robin"
  ],
  "ssum_frequencies": [
    [
      "the",
      4
    ],
    [
      "and",
      3
    ],
    [
      "is",
      3
    ],
    [
      "to",
      3
    ],
    [
      "bomb",
      2
    ],
    [
      "luffy",
      2
    ],
    [
      "crocodile",
      2
    ],
    [
      "after",
      1
    ],
    [
      "rejoining",
      1
    ],
    [
      "straw",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      27
    ],
    [
      "luffy",
      23
    ],
    [
      "to",
      22
    ],
    [
      "and",
      20
    ],
    [
      "that",
      19
    ],
    [
      "crocodile",
      19
    ],
    [
      "is",
      16
    ],
    [
      "he",
      15
    ],
    [
      "a",
      12
    ],
    [
      "at",
      9
    ],
    [
      "if",
      8
    ],
    [
      "of",
      7
    ],
    [
      "but",
      7
    ],
    [
      "with",
      7
    ],
    [
      "him",
      7
    ],
    [
      "will",
      6
    ],
    [
      "be",
      6
    ],
    [
      "vivi",
      6
    ],
    [
      "his",
      6
    ],
    [
      "they",
      6
    ]
  ]
}