{
  "chapter_number": "Chapter 183",
  "title": "Commander Karoo",
  "short_summary": "Karoo acts like a true hero to save Vivi. Meanwhile in the southeast gate of Alubarna, Usopp finds a wounded Chopper.\n",
  "long_summary": "The chapter begins with a flashback of the Straw Hats deciding on their code mark. Since Zoro came up with the idea of putting an X below some bandages, Sanji became suspicious if Zoro was already switched with the transvestite guy. Zoro yells at Sanji that he will cut him to pieces, which assures everyone that it is the real Zoro.\nBack in the current time, a half-dead Karoo runs away from Bon Kurei with Vivi on his back. Karoo runs so quickly that he miraculously runs up a vertical cliff to their shock, but just when they reach the top, Karoo loses footing. As Bon Kurei laughs at Karoo, waiting for them to fall, Karoo flaps his wings and flies to the top of the cliff, much to Bon Kurei's shock. When Vivi compliments Karoo and says Bon Kurei will not be able to chase them anymore, she looks down to see Mr. 2 dashing up the cliff yelling there is nothing an okama cannot do, much to their horror.\nVivi asks Karoo if he can get past the battlefield in front of them, and Karoo starts running into the battlefield. As they run from Mr. 2, a passing bullet hits Karoo and Karoo falls to the ground painfully. Vivi cries, asking Karoo if he is ok, and Karoo tells Vivi to go quickly. As Mr. 2 approaches the two, the Super Spot Billed Duck Troops come to the rescue, head-butting Bon Kurei.\nSanji appears, telling the ducks they can go now, and Vivi tells them that she is ok. Vivi tells them to take care of Karoo instead, and Sanji tells her to go, which she nods to. As Vivi runs away, Mr. 2 is enraged and attacks Sanji, telling him to die. Sanji guards by kicking at Mr. 2's leg, telling him to give his sniper's goggles back. Sanji tells Mr. 2 that he is not as weak as the other guys, and Mr. 2 asks Sanji if he is the \"Mr. Prince\" everyone was talking about. Sanji's glasses fall off and he states that he's not; he's the first-rating cook of the sea, Sanji. Bon Kurei says that he's a first rating okama of the sea himself, and tells Sanji that cooks shouldn't be fighting with dark organizations. Sanji says that he's a cook and a pirate, so that goes for Mr. 2 as well. Mr. 2 agrees, and Sanji tells him to leave the country alone.\nMeanwhile in the southeast gate of Alubarna, Usopp finds a wounded Chopper and asks if he is okay. Chopper says he is, and tells Usopp to watch out since the enemy is still here. A pillar falls by itself and Usopp is confused, as there was nobody near it. Chopper tells Usopp that they are underground, explaining that Miss Merry Christmas is a Devil Fruit user of the \"Mogu Mogu no Mi\", and Mr. 4, her partner, is a \"fourth batter\" with a dog. Usopp is even more confused at this. Then there is a bark and a baseball comes flying at them. Chopper tells Usopp to get out of its way, and someone hits the ball with a bat. The ball ticks as it gets closer, and right when it's in front of Usopp's nose, it explodes.\n\n"
}