{
  "chapter_number": "Chapter 80",
  "title": "A Crime is a Crime",
  "short_summary": "Nojiko tells the Straw Hats of Nami's burden in saving Cocoyasi Village. She tells them that Nami had spent the last eight years trying to raise 100,000,000 so that she could buy the village's and her own freedom from Arlong. Meanwhile, the Marine Captain of the 16th Branch, Nezumi, arrives at Cocoyasi Village to steal all the money that Nami had earned over the years. Nami realizes that the Marines coming after her money was actually Arlong's doing, so she confronts him, saying he broke their agreement. Arlong laughs and grabs Nami by the mouth, saying he technically never broke their agreement.\n",
  "long_summary": "Nojiko continues to tell the Straw Hats the story of why Nami joined the Arlong Pirates. She tells them that Nami sacrificed herself at a young age so that no one else in the village would get killed by Arlong, like their mother did. Sanji and Usopp are infuriated by this. Meanwhile, Zoro sleeps through the story. Sanji exclaims that he would kill those pirates, but he gets hit on the head by Nojiko. She warns him not to speak in such a manner. Nojiko tells the crew that by going around and calling Nami their friend, they are putting her eight years of hard work in jeopardy by making the Arlong Pirates doubt her. She tells them not to make Nami suffer any more than she already has. In the meantime, Nojiko continues telling her stories of her and Nami's past. Flashbacks show Nami entering Arlong's crew so that she could earn 100,000,000 and buy the village's freedom back along with her own. She remembers just how recently Nami only had 7,000,000 more to collect before her goal would be realized. \nBack at the village, Genzo arrives at Nami's house with the company of the Marine captain of the 16th Branch, Nezumi. The Marine captain asks her if she is the criminal he heard about. Nami replies that she guesses she is, noting that she is working for Arlong. She tells him that she is part of his pirate crew and that he should let her be. Nezumi laughs and says that he has no idea what she is talking about. He denounces Nami as a petty thief and says that the money she stole from many pirates is property of the government. Nami threatens Nezumi once again that she is part of Arlong's crew, but he remains unfazed. Nezumi orders the Marines to ignore her and search the premises for the money. Nami angrily yells at them to get away, and attacks them with her staff. Genzo yells at Nezumi, telling him that the money was being used to save the village since the Marines wouldn't do anything about their current conditions under Arlong. Nami is surprised that Genzo knew about the money. Genzo reveals that he and the villagers knew about the money and what Nami was trying to do all along. They learned about it from Nojiko and never told Nami that they knew, because they were afraid of pressuring her, and ended up making her run away from it all. At the same moment, Nojiko also arrives at the scene and denounces the Marines for their actions and for failing to save the village. Once again, Nezumi ignores the accusations. \nNami is suspicious of Nezumi because he knew exactly how much money Nami was hiding and laughed when Nojiko said that Arlong would attack his ship if he lingered around too long. Nami finally understands that Nezumi is a corrupt Marine and that he has been sent by Arlong to take her money. Nami then goes to confront Arlong for breaking their agreement. Annoyed, Arlong grabs Nami by the mouth and laughs, telling her he did no such thing. He says he technically never broke the agreement. Nami curses him for deceiving her by way of using a loophole.\n\n"
}