{
  "chapter_number": "Chapter 35",
  "title": "Neo Hill Road",
  "short_summary": "After Luffy's punch, Kuro decides to take care of him while he asks Jango to take care of Kaya. Zoro is unable to prevent Jango from going after her because of the hypnotized Buchi. However, Usopp asks the Usopp Pirates to help her escape.\n",
  "long_summary": "The Black Cat Pirates are amazed Luffy hit Kuro from down at the bottom of the slope. Although Kuro just lays there, his former crew are aware this silence means Kuro is angry now.\nBefore anything else can happen, the rest of the Usopp Pirates come running towards Kuro and hit him with various objects (a shovel, a baseball bat, and a frying pan). Ninjin, Tamanegi, and Piiman are all angry that their captain, Usopp, came to fight without them. Usopp begs them to run away, but they only do so when Kuro suddenly appears behind them. Kuro walks past the boys and straight up to Usopp and kicks him hard. Then ignoring Usopp, Kuro asks Luffy if he got his powers from a Devil Fruit. Luffy explains he ate the Gomu Gomu no Mi which made him like rubber. Jango is amazed the rumors are true and that they do indeed exist.\nKuro calls to Jango, telling him to just deal with Kaya and the Usopp pirates while he deals with Luffy. Zoro makes an attempt to block Jango's path to Kaya, but Buchi attacks. Buchi leaps into the air, but Zoro knows Buchi's trademark attack is about to hit him and while it does not hit him, the attack is more powerful than ever. Kuro comments on how Buchi does not know his own strength. Buchi manages to pin Zoro against the walls of the slope, however Zoro refuses to lose to someone he already defeated once before and pushes Buchi away from him.\nJango walks past Zoro, who is still being blocked by Buchi and Usopp can only stare on as his body refuses to move. Usopp gives his Usopp Pirates the most important task of all: protect Kaya and get her to a safe place. They escort Kaya into the forest, with Jango close behind them determined not to let them get away. As Jango goes to throw his ring again, Usopp hits him with his slingshot. Jango turns his attention to Usopp, but he is reminded he has a task to do by Kuro.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Kuro",
    "Jango",
    "Buchi",
    "Buggy (cover)",
    "Kaya",
    "Usopp",
    "Piiman",
    "Ninjin",
    "Tamanegi"
  ],
  "ssum_frequencies": [
    [
      "to",
      4
    ],
    [
      "of",
      3
    ],
    [
      "after",
      2
    ],
    [
      "take",
      2
    ],
    [
      "care",
      2
    ],
    [
      "asks",
      2
    ],
    [
      "jango",
      2
    ],
    [
      "her",
      2
    ],
    [
      "the",
      2
    ],
    [
      "usopp",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      17
    ],
    [
      "the",
      15
    ],
    [
      "usopp",
      11
    ],
    [
      "and",
      11
    ],
    [
      "kuro",
      10
    ],
    [
      "his",
      8
    ],
    [
      "him",
      8
    ],
    [
      "is",
      6
    ],
    [
      "a",
      6
    ],
    [
      "he",
      6
    ],
    [
      "jango",
      6
    ],
    [
      "buchi",
      6
    ],
    [
      "with",
      5
    ],
    [
      "them",
      5
    ],
    [
      "zoro",
      5
    ],
    [
      "pirates",
      4
    ],
    [
      "are",
      4
    ],
    [
      "luffy",
      4
    ],
    [
      "hit",
      4
    ],
    [
      "of",
      4
    ]
  ]
}