{
  "chapter_number": "Chapter 146",
  "title": "Battle to Defend the Kingdom",
  "short_summary": "Wapol and his two lieutenants try to take back their castle but Chopper has decided that no one will enter what had become Hiriluk's grave.\n",
  "long_summary": "Surprised that Luffy dares to attack the King of Drum, Chess and Kuromarimo help their chief recover from the punch he just took. Sanji helps Luffy to realize to identify their opponents asks him how he is not cold in his shorts and vest. After a pause, Luffy suddenly realizes both of his mistakes and the crew is shocked at Luffy's slow response time. Luffy runs back into the castle and searches for a jacket in Nami's room.\nWapol is infuriated by the disrespectful behavior of his former subjects. Dr. Kureha and Chopper refuse to let him enter, claiming it has become Dr. Hiriluk grave and that no one will be allowed to take out the quack doctor's flag. To protect his master's place, Chopper transforms into his human form. The trio then realize that he is the monster who attacked them in the past.\nKuromarimo starts to attack Dr. Kureha with an electrostatic ball made of his own hair. Sanji is able to stop the Eleki-Marimo balls by kicking them but finds them stuck to his body suddenly and is unable to kick them off. Sanji asks Chopper for help but suddenly becomes the target for Chess' fire arrows. Chopper takes opportunity of them targeting Sanji by trying to punch Chess. Unfortunately, he is stopped by Wapol who starts to eat the reindeer.\nLuckily, Luffy has come back, wearing Nami's jacket. Thanks to Sanji's powerful kick, Luffy grabs a hold of his leg and is launched at Wapol, landing a punch to Wapol's stomach and causes him to spit out Chopper.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Nami",
    "Sanji",
    "Jango (cover)",
    "Wapol",
    "Chess",
    "Kuromarimo",
    "Robson",
    "Fullbody (cover)",
    "Kureha",
    "Tony Tony Chopper"
  ],
  "ssum_frequencies": [
    [
      "wapol",
      1
    ],
    [
      "and",
      1
    ],
    [
      "his",
      1
    ],
    [
      "two",
      1
    ],
    [
      "lieutenants",
      1
    ],
    [
      "try",
      1
    ],
    [
      "to",
      1
    ],
    [
      "take",
      1
    ],
    [
      "back",
      1
    ],
    [
      "their",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      15
    ],
    [
      "the",
      12
    ],
    [
      "and",
      9
    ],
    [
      "is",
      8
    ],
    [
      "his",
      8
    ],
    [
      "luffy",
      6
    ],
    [
      "of",
      6
    ],
    [
      "chopper",
      5
    ],
    [
      "them",
      5
    ],
    [
      "he",
      4
    ],
    [
      "sanji",
      4
    ],
    [
      "a",
      4
    ],
    [
      "by",
      4
    ],
    [
      "that",
      3
    ],
    [
      "chess",
      3
    ],
    [
      "punch",
      3
    ],
    [
      "him",
      3
    ],
    [
      "in",
      3
    ],
    [
      "suddenly",
      3
    ],
    [
      "for",
      3
    ]
  ]
}