{
  "chapter_number": "Chapter 22",
  "title": "You're the Rare Breed",
  "short_summary": "Luffy and the others sail near an unpopulated island, and Luffy insists they will find somebody there. After discovering the island is filled with unusual hybrid animals, they are confronted by the island's guardian. Luffy and Nami discover the island is actually inhabited by a strange man trapped in a chest, Gaimon. They learn that Gaimon stayed on the island for twenty years to obtain some treasure, but is unable to reach it while trapped. Luffy offers to help, but when he reaches the treasure he finds that it was all taken before Gaimon ever landed on the island. Gaimon was upset when he heard this, but Luffy's positive attitude helps Gaimon get over his depression. Gaimon chooses to stay on the island and protect the animals rather than join Luffy's crew, and the young pirates leave for the next island.\n",
  "long_summary": "Nami fixes Luffy's straw hat after Buggy damaged it previously, much to his delight. Despite her warnings, he pokes the hat and puts a hole in it, causing Nami to stab him in the forehead with her sewing needle. Zoro wakes up due to the noise and starts asking for food. Nami spots an island in the distance, and Luffy directs the ship towards the island as fast as possible in the hopes of food.\nThe crew lands to find the island is deserted and covered in forest. Luffy calls to Zoro, but since he is asleep, he and Nami go exploring without him. They find a dog/chicken hybrid creature, then a snake/rabbit and a pig/lion. Suddenly, a voice booms out a warning for them to leave before the curse of the island effects them, and that they will die. Nami and Luffy call the guardian's bluff, and Luffy is shot by a bullet. After bouncing the bullet back using his Devil Fruit ability, Luffy and Nami follow the direction of the shot and find a strange object resembling a chest with hair on top.\nWhen they examine it, the strange object moves and runs away, but it trips and falls over, revealing a person inside it. Gaimon introduces himself, revealing he has been stuck in a treasure chest for 20 years and has not spoken to another human being in all that time. Luffy attempts to pull Gaimon out, but Gaimon claims his body will fall apart if he leaves the chest, because it has become molded to fit over the years. Gaimon explains he used to be a pirate and is happy to meet others who are pirates. As Luffy and Gaimon talk, the Grand Line is mentioned and they show Gaimon the map they have. Unfortunately, Gaimon lacks any specific knowledge, and cannot tell them where the Grand Line is.\nNami interrupts and explains the Grand Line to them. The world is separated into two parts with one continent - the Red Line - separating the parts. The Grand Line further divides up the world, splitting it into four seas and the Grand Line itself. The only person to conquer the Grand Line was Gold Roger. Gaimon states the Grand Line is known as the \"pirates graveyard\", and that although he has seen pirates that returned from that area of sea, they were changed men who had lost the will to live.\nGaimon goes on to explain the One Piece legend; in over twenty years, not one person has found the treasure left by Gold Roger at the end of the Grand Line. After hearing that it may not even be real, Nami has doubts about Luffy's goal. Gaimon tells the pair he cannot leave until his mind is set at ease about something.\nTwenty years ago, Gaimon came to the island to find treasure with a pirate crew, but could not find the treasure anywhere. Gaimon, determined that there is treasure, wanders off to look further. He finds a hill the crew had looked around, but not on the summit. He climbs the hill, and finds treasure chests in a dip on the top. Astonished to actually find the treasure, he fells down the hill into an empty chest his crew found earlier and fell unconscious. After he awoke, he was stuck inside the chest, and found that the crew had sailed away without him. Realizing that he now has a claim to all the treasure, he attempts to go back to retrieve it, but as he is stuck in the chest he cannot climb the hill to reach it. He returns to the shore to call to his crew, but they never returned.\nGaimon explains that over the years, a few pirates have come to the island to find the treasure, and Gaimon has scared them off with his threats of a curse. Nami and Luffy agree to get the treasures for Gaimon, as they rightfully belong to him for guarding them so long. As they approach the hill, Gaimon gets excited that the treasure he has desired for so long is finally within his reach.\nLuffy finds five chests on the top of the hill, but refuses to throw them down. Nami is furious, but Gaimon guesses what's wrong. After twenty years of guarding them, the treasure chest are revealed to be empty, looted before Gaimon ever set foot on the island.\nTearfully, Gaimon thanks Luffy and Nami for their kindness, despite learning  the fate of the treasure. Even though Gaimon is upset, Luffy lightens him up by saying that in another twenty years Gaimon might have died without knowing the treasure was gone. He then offers him the chance to join his crew and find One Piece, but Gaimon declines.\nAs Nami and Luffy leave, he explains that he already has another treasure to protect. Most of the people who come to the island are poachers, trying to kill the strange animals on the island. After guarding the treasure for twenty years, he feels attached to them and despite not having the treasure he can live happily protecting the island. Luffy promises to leave and find One Piece some day.\n\n"
}