{
  "chapter_number": "Chapter 161",
  "title": "The Green City Erumalu",
  "short_summary": "The Straw Hats cross the Sandora river, meet a pack of kung-fu dugongs, and Vivi talks about the Dance Powder incident occurred 2 years ago.\n",
  "long_summary": "The Straw Hat Pirates crosss the Sandora River and lands near a town. They then meet a colony of kung-fu dugongs. Vivi explains her friends that the animals normally live in sea water, but because of the current drought, the river has become salty. The same happened to the ghost town they enter. Erumalu was once called a green town, but three years without a drop of rain took the best of its inhabitants and nowadays, Erumalu is nothing but ruins. Vivi then tells them that the only town which did not suffer of lack of water was Alubarna, the capital of Arabasta and the king's residence.\nHowever, two years ago, an \"accident\" happened in Nanohana. A ship cargo is dropped, revealing its content: a huge amount of Dance Powder. The people in charge of the cargo looked terrified and mention that the powder was for the king. The Dance Powder is a forbidden material which has the power to generate rainfall but at the expense of the clouds in the surrounding area. After the scandal, it rained nowhere besides near the king's palace. People started to become suspicious of Vivi's father, unaware that it is part of the mischievous plan brought by Crocodile. Vivi is determined to not let him continue making her people suffer, and all the Straw Hats are ready to help her.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Tony Tony Chopper",
    "Yurikah (cover)",
    "Jango (cover)",
    "Fullbody (cover)",
    "Nefertari Vivi",
    "Crocodile",
    "Miss All Sunday",
    "Mr.1",
    "Miss Doublefinger",
    "Mr. 2 Bon Kurei",
    "Mr. 4",
    "Miss Merry Christmas",
    "Mr. Mellow (flashback)",
    "Erimaki Runners",
    "Kung-Fu Dugongs"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "straw",
      1
    ],
    [
      "hats",
      1
    ],
    [
      "cross",
      1
    ],
    [
      "sandora",
      1
    ],
    [
      "river",
      1
    ],
    [
      "meet",
      1
    ],
    [
      "a",
      1
    ],
    [
      "pack",
      1
    ],
    [
      "of",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      24
    ],
    [
      "of",
      12
    ],
    [
      "a",
      7
    ],
    [
      "and",
      5
    ],
    [
      "to",
      5
    ],
    [
      "is",
      5
    ],
    [
      "town",
      4
    ],
    [
      "that",
      4
    ],
    [
      "in",
      4
    ],
    [
      "but",
      4
    ],
    [
      "vivi",
      3
    ],
    [
      "her",
      3
    ],
    [
      "was",
      3
    ],
    [
      "powder",
      3
    ],
    [
      "people",
      3
    ],
    [
      "straw",
      2
    ],
    [
      "river",
      2
    ],
    [
      "near",
      2
    ],
    [
      "they",
      2
    ],
    [
      "then",
      2
    ]
  ]
}