{
  "chapter_number": "Chapter 195",
  "title": "Mr. Bushido",
  "short_summary": "As Mr. 1 deflects Zoro's attack, the latter contemplates Koushirou's words on what makes a good sword. Continuing his assault on Mr. 1; Zoro delivers a barrage of techniques that all fail to harm the assassin. Responding in kind, Mr. 1 lands several devastating attacks to Zoro before causing a building to collapse on the swordsman. Walking away, Mr. 1 is surprised to see Zoro standing up from the rubble and claiming he know where the boulders would land. Finally understanding his old sensei's words, Zoro manages to cut Mr. 1 with a new technique and end the match as the victor.\n",
  "long_summary": "Starting off from where Zoro had thrown a building at Mr. 1, the swordsman is frustrated over his inability to understand his old master's words concerning a swordsman's ability to cut steel or not. Stubbornly, Zoro continues to believe that his method of pushing with all his strength is the key to cutting steel.\nAs Mr. 1 destroys the thrown building with Atomic Spar, Zoro leaps forward through the debris and meets Mr. 1 head on. Beginning with a series of quick strikes, the swordsman spins around and strikes the assassin's jaw. Returning with a kick, Mr. 1's attack is parried by Zoro who again moves to land a blow on his opponent's jaw and sending him backwards. A third blow to the head, Zoro lands his Three Sword Style: Gazami Dori technique which throws the assassin into the air.\nCompletely unharmed, each fighter comments on the other's tenacity. Mr. 1 then gives Zoro a warning, and that is to not think of him as a swordsman but as a proper assassin. Creating circular blades that run down his forearms and begin to spin at high speeds, the two clash again with sparks being created from the spinning blades striking Zoro's swords. Landing a devastating blow across Zoro's chest, the assassin does not stop as he proceeds to land a direct strike into Zoro's gut which launches the swordsman into a nearby pillar. Not giving up, Zoro attempts to get up again only for Mr. 1 to question his determination. Choosing to end it, the assassin delivers a direct Spar Break to the critically injured swordsman, also cutting apart the support pillar behind the man.\nBelieving him finished, Mr. 1 begins to walk away as the building above gives way without its support pillar; the debris seemingly falling right on top of Zoro. Against all odds however, the swordsman stands up again despite his grave injuries. Shocked at how he wasn't struck by any of the falling rocks, Zoro mentally responds that he did not dodge them all, but knew that none would hit him. Sensing one of his swords underneath a nearby stone, Zoro retrieves it and begins to notice the 'breathing' of the world around him, cutting a nearby tree branch, however the tree branch remained unscathed.\nFinally understanding his old sensei's words; Zoro prepares to meet Mr. 1's final attack with one of his own, an One Sword Style technique. The assassin asks if one sword would be enough before charging ahead with Atomic Spurt, confident in his ability to finally kill Zoro. However using his new technique, One Sword Style Iai: Shishi Sonson, Zoro successfully cuts through Mr. 1's steel body for the first time and defeats the assassin.\n\n",
  "characters": [
    "Roronoa Zoro",
    "Hatchan (cover)",
    "Camie (cover)",
    "Pappag (cover)",
    "Koushirou (flashback)",
    "Mr. 1",
    "Seaboar (cover)"
  ],
  "ssum_frequencies": [
    [
      "the",
      7
    ],
    [
      "mr",
      5
    ],
    [
      "1",
      5
    ],
    [
      "to",
      5
    ],
    [
      "a",
      4
    ],
    [
      "zoro",
      4
    ],
    [
      "on",
      3
    ],
    [
      "as",
      2
    ],
    [
      "words",
      2
    ],
    [
      "his",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      28
    ],
    [
      "to",
      17
    ],
    [
      "a",
      15
    ],
    [
      "his",
      14
    ],
    [
      "zoro",
      13
    ],
    [
      "mr",
      9
    ],
    [
      "of",
      8
    ],
    [
      "with",
      7
    ],
    [
      "and",
      7
    ],
    [
      "1",
      6
    ],
    [
      "swordsman",
      6
    ],
    [
      "assassin",
      6
    ],
    [
      "not",
      5
    ],
    [
      "that",
      5
    ],
    [
      "as",
      5
    ],
    [
      "him",
      5
    ],
    [
      "one",
      5
    ],
    [
      "is",
      4
    ],
    [
      "on",
      4
    ],
    [
      "again",
      4
    ]
  ]
}