{
  "chapter_number": "Chapter 93",
  "title": "Going Down",
  "short_summary": "Luffy works to destroy the room where Arlong forced Nami to make maps, and he manages to break the fish-man's nose. He then sends Arlong crashing all the way through Arlong Park's tower, demolishing it.\n",
  "long_summary": "As Luffy breaks off part of Arlong's Kiribachi, he asks Arlong what he thinks Nami is. Arlong replies that while she is a human, he at least considers her useful and he will provide for her every want so long as she keeps drawing maps for him. As Johnny and Yosaku worry about what is happening to Luffy inside the tower, Luffy kicks Nami's desk out, and Nami is taken aback as it falls to the ground. Arlong angrily wonders why Luffy is destroying Nami's cartography supplies and sending them flying out of the tower, and as she watches them fall, Nami remembers Arlong showing her her cartography room for the first time when she was a child. Arlong swings Kiribachi at Luffy, but Luffy dodges it and he destroys more of Nami's maps in the process. Arlong is aghast at what is happening to his maps, remembering forcing Nami to work for long hours and abusing her in order to acquire them. Arlong grabs Luffy and shouts that it took Nami eight years to make those maps, and outside, Nami silently thanks Luffy while tears fall from her eyes.\nArlong bites Luffy in the neck, but Luffy grabs the fish-man's nose as he states that while he may not know anything about fish-men or cartography, he now knows how to help Nami. He snaps Arlong's nose out of place, and states that he cannot allow this room to exist. Luffy then kicks into the ceiling, and his leg stretches all the way through the roof. Arlong puts his nose back in place and scoffs at the idea of a human destroying Arlong Park as he spins toward Luffy. He bites Luffy in the chest, but Luffy brings his foot down on top of him, sending him crashing all the way to the ground floor. The impact causes the entire tower to crack, and the Straw Hats and citizens prepare to evacuate, but Nami does not want to leave Luffy inside the tower. However, she cries out to him as it collapses immediately afterwards.\n\n"
}