{
  "chapter_number": "Chapter 113",
  "title": "It's All Right!!!",
  "short_summary": "Vivi explains how she infiltrated Baroque Works and discovered that they plan to take control of her country. The Straw Hats promise to help her in reaching her island safely.\n",
  "long_summary": "After getting rid of Mr. 5 and Miss Valentine, Zoro and Luffy return to their fight. However, they are quickly stopped by Nami who does not want to lose an opportunity to earn 1 billion belly.\nEveryone explains to each other but Vivi is unable to promise the reward to Nami. Her country, Arabasta, is on the verge of a civil war, which had secretly been started by the Baroque Works organization. In order to help her country, Princess Vivi has infiltrated Baroque Works with her counselor, Igaram, in order to understand the organisation's true motives. She learned that their ultimate plan they call Dream Country, is in reality to conquer Arabasta by putting it into chaos. When Luffy asks Vivi who is pulling the strings, she accidentally reveals that Mr. 0 is Crocodile, one of the Seven Warlords of the Sea. Unfortunately for them, Baroque Works' Unluckies agents have overheard her revealing the information and they quickly put the three Straw Hat on their organisation's wanted list.\nNow that they share the same enemy as Vivi, Igaram proposes a plan: he will go directly to Arabasta, thanks to an Eternal Pose, while the Straw Hat will accompany Vivi through the standard road which will be longer but safer. However, as soon as he departs, Igaram's boat explodes. Luffy does not hesitate any further and states he will help Vivi reach her country.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp (K.O)",
    "Sanji (K.O)",
    "Nefertari Vivi",
    "Igaram",
    "Karoo",
    "Crocodile (shadowed)",
    "Mr. 5 (K.O)",
    "Miss Valentine (K.O)",
    "Mr. 13",
    "Miss Friday"
  ],
  "ssum_frequencies": [
    [
      "her",
      3
    ],
    [
      "to",
      2
    ],
    [
      "vivi",
      1
    ],
    [
      "explains",
      1
    ],
    [
      "how",
      1
    ],
    [
      "she",
      1
    ],
    [
      "infiltrated",
      1
    ],
    [
      "baroque",
      1
    ],
    [
      "works",
      1
    ],
    [
      "and",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      12
    ],
    [
      "to",
      11
    ],
    [
      "vivi",
      6
    ],
    [
      "is",
      5
    ],
    [
      "her",
      5
    ],
    [
      "of",
      4
    ],
    [
      "and",
      4
    ],
    [
      "they",
      4
    ],
    [
      "country",
      4
    ],
    [
      "will",
      4
    ],
    [
      "luffy",
      3
    ],
    [
      "their",
      3
    ],
    [
      "by",
      3
    ],
    [
      "arabasta",
      3
    ],
    [
      "baroque",
      3
    ],
    [
      "works",
      3
    ],
    [
      "in",
      3
    ],
    [
      "that",
      3
    ],
    [
      "as",
      3
    ],
    [
      "he",
      3
    ]
  ]
}