{
  "chapter_number": "Chapter 121",
  "title": "I Knew",
  "short_summary": "While Luffy is unable to free himself from being pinned under the rock, Mr. 5 and Miss Valentine capture Vivi and take her back to Mr. 3. Nami and Zoro have been captured as well thanks to Mr. 3's wax traps. Vivi reveals to Brogy that he was able to win against Dorry thanks to a bomb that was in the rum. Brogy becomes angry due to the deceptive manner in which he won. He attempts to evade the candle prison but is hit by Mr. 5's bombs. Meanwhile, Zoro, Vivi, and Nami are placed on a candelabra which will transform them into wax statues.\n",
  "long_summary": "Vivi is captured by Miss. Valentine and Mr. 5. Mr. 5 is surprised Luffy was strong enough to still be awake after the last bomb had gone off in his face. He then tells Luffy that he has captured his friends, Nami and Zoro. Luffy smiles and responds that if has captured Zoro he will soon be the one in trouble, and not Zoro. Luffy then continues to insult Mr. 5 until Mr. 5's patience is tried and bombs him once more with his Devil Fruit powers. Luffy is finally knocked unconscious and the baroque works agents leave with Vivi.\nMeanwhile, Brogy is completely immobilized by Mr. 3's wax. Mr. 3 tells Brogy how he helped him during his fight with Dorry. Brogy becomes angry due to his honorable victor being stolen due to a treacherous interceding. Vivi is delivered to Mr. 3. She insults him for his lack of morals. Mr. 3 smiles and makes a giant candelabra and gloats about completing his art collection. He informs them they will soon be turned into wax figures and be added to his collection. Brogy then states that at the beginning of the fight he knew something was wrong, but he realizes now that it was Mr. 3 that hurt his pride for defeating a weakened opponent. Brogy attempts to stand up once more only to be hit by one of Mr. 5's bombs.\nMeanwhile at Dorry's camp, Luffy has regained consciousness and strengthens his resolve to defeat the baroque works agents. Karoo and Usopp promise to fight gallantly to save their friends as well.\n\n"
}