{
  "chapter_number": "Chapter 116",
  "title": "Big",
  "short_summary": "While Zoro and Sanji encounter dinosaurs as they hunt, Luffy and Vivi meet Brogy and Nami and Usopp meet Dorry. The two of them are giants from Elbaf who are fighting in a duel to resolve an argument that has lasted for over 100 years.\n",
  "long_summary": "As he explores Little Garden, Sanji hears Nami screaming before encountering a tyrannosaurus rex, while Zoro comes face to face with a triceratops. On the Sunny, Nami and Usopp stare in shock in fear as they meet a giant named Brogy, who asks them if they have any rum. Brogy shouts when a dinosaur bites his backside, causing Nami and Usopp to scream in fear, and they grow even more afraid when Brogy quickly decapitates the dinosaur and holds up its head, proclaiming that he is Elbaf's strongest warrior. Brogy welcomes Nami and Usopp as guests, but they are so afraid that they are playing dead. Meanwhile, Luffy stands atop a brontosaurus' head as he views the island from high up. Vivi tells him to get down, but Luffy is unafraid and wants to go to a rock with strange-looking holes he saw. However, the dinosaur flips its head back and swallows Luffy, but it is immediately decapitated by the giant Dorry, causing Luffy to fall out of its throat and land in Dorry's hand. Dorry proclaims himself to be Elbaf's strongest warrior, and as Vivi looks at him in fear, he invites her and Luffy to his place.\nAt Brogy's home, the giant offers Nami and Usopp some of the dinosaur meat he cooked, but the duo see skeletons all around them and believe that Brogy is going to eat them as well. Nami asks how long it will take the Log Pose to record this island, and Brogy reveals that it takes a year, leaving her and Usopp aghast. At Dorry's home, Vivi watches as Luffy makes easy conversation with the giant while eating. Luffy asks about where Dorry came from, and Dorry reveals that he comes from a village on Elbaf, which is somewhere on the Grand Line. However, his village has a rule that quarrels that cannot be resolved will be decided by the gods through combat. He is currently fighting Brogy over a disagreement, although the two of them have now been fighting for over 100 years. Vivi is appalled by this custom and speaks out about it, but the volcano in the center of the island erupts, signaling for Dorry and Brogy to resume their battle. Luffy quiets Vivi's attempts to stop the fight, and Dorry affirms that he is now only fighting Brogy for pride, as the two of them had forgotten the reason for their original disagreement. The two giants clash, and Luffy collapses to the ground, being overwhelmed from interacting with the massive giants.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Koby (cover)",
    "Helmeppo (cover)",
    "Dorry",
    "Brogy",
    "Bronte Zaurus",
    "Nefertari Vivi",
    "Karoo"
  ],
  "ssum_frequencies": [
    [
      "and",
      4
    ],
    [
      "meet",
      2
    ],
    [
      "are",
      2
    ],
    [
      "while",
      1
    ],
    [
      "zoro",
      1
    ],
    [
      "sanji",
      1
    ],
    [
      "encounter",
      1
    ],
    [
      "dinosaurs",
      1
    ],
    [
      "as",
      1
    ],
    [
      "they",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      22
    ],
    [
      "and",
      19
    ],
    [
      "to",
      13
    ],
    [
      "a",
      10
    ],
    [
      "he",
      9
    ],
    [
      "brogy",
      9
    ],
    [
      "luffy",
      9
    ],
    [
      "as",
      8
    ],
    [
      "that",
      8
    ],
    [
      "is",
      8
    ],
    [
      "nami",
      6
    ],
    [
      "in",
      6
    ],
    [
      "dorry",
      6
    ],
    [
      "usopp",
      5
    ],
    [
      "they",
      5
    ],
    [
      "them",
      5
    ],
    [
      "but",
      5
    ],
    [
      "of",
      5
    ],
    [
      "with",
      4
    ],
    [
      "giant",
      4
    ]
  ]
}