{
  "chapter_number": "Chapter 107",
  "title": "Moonlight and Tombstones",
  "short_summary": "After the Straw Hats all fall asleep during their welcoming party on Whisky Peak, their welcomers, who are revealed to be Baroque Works agents, prepare to capture them for Luffy's bounty. However, Zoro confronts them after having pretended to pass out, and 100 Baroque Works agents come to deal with him. He manages to overwhelm several of them, and Mr. 8, Miss Monday, Mr. 9, and Miss Wednesday prepare to deal with him personally.\n",
  "long_summary": "As night falls on Whisky Peak, the welcoming party for the Straw Hats continues. Usopp regales the people with his stories, Zoro and Nami outlast them in drinking, Sanji woos several women, and Luffy eats enough food for 20 people. Meanwhile, Mr. 9 and Miss Wednesday report to their boss via letter that they succeeded in luring the Straw Hats to this island. Zoro collapses from drinking before Nami does, and all of the Straw Hats eventually pass out from exhaustion. Mr. 9 and Miss Wednesday confront Mr. 8 as he heads outside, and Mr. 8 reports that the Straw Hats have fallen into their doom.\nThe nun that Nami was drinking against then comes out, having actually drunk barley tea. As she removes her robes, Miss Monday wonders if this welcoming party was actually necessary, saying they should have just crushed the Straw Hats at the harbor. However, Mr. 8 shows them Luffy's bounty poster, to their shock. He orders them to tie up all the Straw Hats and take all the treasure from their ship, telling them to keep them alive to earn the entire reward. However, Zoro then calls out to them from a nearby rooftop, and the agents inside report to the ones outside that he had managed to escape. Zoro states that a true swordsman never allows alcohol to take control of himself, and looks forward to taking on the 100 Baroque Works agents confronting him.\nThe agents are shocked that he knows their organizations' name, and Zoro reveals that he was unsuccessfully recruited to join it back when he was a bounty hunter. Mr. 8 states that they must kill him for knowing their secrets, and place his tombstone among the many others at Cactus Rock. In their brief moment of distraction, they lose sight of Zoro, and he appears right among them. They rush to attack, but he overwhelms several of them before speeding away again. He appears behind Mr. 8 and plants his sword into the agent's hair. Mr. 8 desperately tells the agents to not shoot, and he brings out a saxophone that functions as a shotgun. Zoro quickly speeds away from the blast as many agents are taken out, and Mr. 8, Miss Monday, Mr. 9, and Miss Wednesday state that they will need to take on Zoro themselves.\n\n"
}