{
  "chapter_number": "Chapter 30",
  "title": "Great!!!",
  "short_summary": "Back at the mansion, Kuro begins to grow impatient as the Black Cat Pirates had failed to arrive in the village, and leaves for the shore vowing to kill them if they had forgotten. At the shore, Jango hypnotizes the recovering pirates to become stronger than before, however Luffy also falls for the hypnotism and attacks the pirates in a rage, resulting in the destruction of the pirate ship's bow. About to attack with the now separated bow, Jango quickly puts Luffy to sleep who then drops the bow onto himself and several other pirates. Thinking the Black Cat Pirates defeated, Nami, Zoro, and Usopp are proven wrong when Jango reveals they have two remaining fighters. Back in the village, Tamanegi finds it strange to see the butler walking around so early.\n",
  "long_summary": "On the mansion doors steps, Kuro sits and he says the word \"late\". He pictures the other servant laying on the floor, injured and the room cut up from his attack. He comments on if Jango and the others are late he would kill them, setting off to find out where they may have gone.\nOn the slope, Jango stands behind his fallen crew. While Jango is looking on in awe and commenting to his crew about being defeated by a bunch of kids, Zoro, Luffy, Nami, and Usopp argue. Jango hypnotizes the crew into thinking that they are stronger than before, with one demonstrating this new found strength by shattering the nearby cliff wall. Sending them after Luffy and the others however, it is revealed that Jango also hypnotized Luffy at the same time to Zoro's complete disbelief.\nThrown into a hypnotized induced rage, Luffy successfully knocks back the Black Cat Pirates with his Gomu Gomu no Gatling Gun. Proceeding to storm past the invading pirates, Luffy grabs the figurehead of their ship and tears it off, turning to face the pirates. Realizing Luffy's intent to whack the entire crew with it, Jango quickly hypnotizes Luffy into falling asleep, causing the latter to drop the bow and crush himself and several pirates with it, the figurehead barely missing Jango himself. With Luffy having defeated the crew, Nami, Zoro, and Usopp begin to celebrate only for Jango to remind his crew that they will face Kuro's wrath if they fail.\nWhile Zoro ensures the others know Luffy is not dead, two new voices suddenly call from on board the ship as somebody notices the stern missing; and Jango identifies them as the Nyaban Brothers.\nBack at the village, Kuro heads towards the north coast only for Tamanegi to sight him; wondering why the butler would be walking around that early.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Buchi (Off-screen)",
    "Kuro",
    "Jango",
    "Merry (K.O)",
    "Usopp",
    "Tamanegi"
  ],
  "ssum_frequencies": [
    [
      "the",
      15
    ],
    [
      "to",
      7
    ],
    [
      "pirates",
      5
    ],
    [
      "in",
      4
    ],
    [
      "and",
      4
    ],
    [
      "jango",
      3
    ],
    [
      "bow",
      3
    ],
    [
      "back",
      2
    ],
    [
      "at",
      2
    ],
    [
      "black",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      27
    ],
    [
      "and",
      11
    ],
    [
      "to",
      10
    ],
    [
      "jango",
      9
    ],
    [
      "luffy",
      8
    ],
    [
      "on",
      6
    ],
    [
      "crew",
      6
    ],
    [
      "his",
      5
    ],
    [
      "with",
      5
    ],
    [
      "he",
      4
    ],
    [
      "they",
      4
    ],
    [
      "that",
      4
    ],
    [
      "it",
      4
    ],
    [
      "pirates",
      4
    ],
    [
      "others",
      3
    ],
    [
      "them",
      3
    ],
    [
      "is",
      3
    ],
    [
      "zoro",
      3
    ],
    [
      "into",
      3
    ],
    [
      "kuro",
      2
    ]
  ]
}