{
  "chapter_number": "Chapter 103",
  "title": "The Whale",
  "short_summary": "The Straw Hats end up inside the whale, where they find an old man called Crocus living in the whale's stomach. After introducing himself, Crocus explains about the whale Laboon.\n",
  "long_summary": "The Going Merry has entered a weird place: a lake with an island in the middle of a whale's stomach. However, the weirdest part is the old man on the island with his flower-like hairs and annoying attitude. His name is Crocus and is the caretaker of the Twin Cape lighthouse. He reveals to the crew that they are, in fact, in the stomach of the whale who appears to have been \"customized.\" They can leave the whale through a door which Crocus been constructed in the stomach wall. Suddenly, the stomach lake becomes rough. Crocus once again gives the explanation—the whale is hitting his head against the Red Line which has given him numerous scars over the years.\nMeanwhile, Luffy also enters the whale strange inside as well as two mysterious characters, Mr. 9 and Miss Wednesday. Due to the whale's behavior, the three of them soon land in the whale's stomach too. They rejoin the others who are trying to escape. Crocus has disappeared into a special room where he can inject sedative to calm the whale through a gigantic syringe. The whale becomes calm once more and the Straw Hat question the 2 mysterious guests. As it appeared, they want to kill the whale. Crocus and Luffy prevent them from doing any harm to Laboon.\nFinally, taking advantage of the whale's better mood, Crocus explains his story. He belonged to a pirate crew who stopped by the cape to reach the Grand Line. Due to the danger of the sea, they asked Crocus to take care of Laboon until they returned. The two of them have stayed here waiting since their departure... 50 years ago.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Yorki (flashback)",
    "Buggy (cover)",
    "Smoker (cover)",
    "Crocus",
    "Mr. 9",
    "Miss Wednesday",
    "Laboon"
  ],
  "ssum_frequencies": [
    [
      "the",
      4
    ],
    [
      "whale",
      2
    ],
    [
      "crocus",
      2
    ],
    [
      "straw",
      1
    ],
    [
      "hats",
      1
    ],
    [
      "end",
      1
    ],
    [
      "up",
      1
    ],
    [
      "inside",
      1
    ],
    [
      "where",
      1
    ],
    [
      "they",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      32
    ],
    [
      "to",
      11
    ],
    [
      "of",
      8
    ],
    [
      "a",
      7
    ],
    [
      "crocus",
      7
    ],
    [
      "whale",
      7
    ],
    [
      "they",
      6
    ],
    [
      "in",
      5
    ],
    [
      "stomach",
      5
    ],
    [
      "and",
      5
    ],
    [
      "whales",
      4
    ],
    [
      "is",
      4
    ],
    [
      "his",
      4
    ],
    [
      "has",
      3
    ],
    [
      "he",
      3
    ],
    [
      "who",
      3
    ],
    [
      "as",
      3
    ],
    [
      "them",
      3
    ],
    [
      "lake",
      2
    ],
    [
      "with",
      2
    ]
  ]
}