{
  "chapter_number": "Chapter 95",
  "title": "Spin, Pinwheel",
  "short_summary": "The Straw Hats continue partying with the Cocoyasi Village residents to celebrate their freedom. Nami decides to replace her Arlong Pirates tattoo with a new one, consisting of an orange and a pinwheel. Genzo, who had started wearing the pinwheel to make her smile as a baby, makes Luffy promise to never take away Nami's smile. The next day, the Straw Hats part ways with the villagers, Johnny, and Yosaku, and Nami decides to leave all her stolen money with the villagers before she leaves. However, she does pickpocket them as she runs onto the ship, and happily bids everyone farewell as she and the crew sail away.\n",
  "long_summary": "Night falls in the East Blue, but the partying in Cocoyasi Village does not cease as the people continue celebrating their hard-fought freedom from the Arlong Pirates. Luffy stuffs himself with meat, and asks Sanji about a raw ham melon that the cook ate. Sanji goes to flirt with the women, while Usopp proclaims his achievements to the jubilant crowd. Meanwhile, Genzo goes to Bell-mère's grave and pours sake on it, telling her that her daughters have become strong women that remind him of her. He then says that they will all do their best to live life to the fullest from now on, for the sake of those who died in their struggle for freedom. Luffy then bursts onto the scene looking for raw ham melon, and attempts to leave after not seeing any, but Genzo stops him. Luffy notes the grave and offers his condolences, and Genzo tells him that if he takes away the smile from Nami's face, he will kill the pirate himself, which Luffy understands.\nMeanwhile, Nojiko notes that Chabo is not sulking about his dad's death, and Chabo replies that nothing good would have come from thoughts like that. Nojiko then pinches his cheek, as his response prevented her from picking on him. Inside a room, Dr. Nako tells Nami that her tattoo cannot be fully erased, as it would still leave a scar. Nami remembers telling Nojiko about her pain at being branded with the Arlong Pirates' tattoo, and how Nojiko proceeded to get her own tattoos to match her. Nami then asks Nako to tattoo something else in its place, showing him a piece of paper with what she has in mind.\nThe next day, the Straw Hat Pirates prepare to depart from the island. Johnny and Yosaku bid them farewell, as they intend to resume their lives as bounty hunters. Usopp wonders where Nami is, and Zoro suggests that she may not be coming. Genzo and Nako express their shock when they hear that Nami is leaving her 100,000,000 in the village, but Nojiko says that her sister was content with just stealing more money later. Nami then approaches the villagers and shouts for the Straw Hats to set sail before running toward the Going Merry. Genzo and the villagers realize in shock that Nami is not giving them the opportunity to thank her, and she bursts through the crowd and leaps from the dock onto the Merry. Nami then drops the wallets and money she stole from the villagers, and they shout at her in anger, though are still grateful to her. Genzo tells Luffy to remember their promise, and Nami happily shouts her goodbye to the villagers. Nako hands Genzo the paper that Nami gave him when getting her new tattoo, revealing its design: a tangerine attached to a pinwheel. Nojiko notices that Genzo is not wearing his pinwheel anymore, and he replies that he does not need it anymore. When Nami was a baby, Bell-mère got mad at Genzo for making her cry with his scary face. In response, Genzo put the pinwheel on his hat, which made her laugh. Now the pinwheel, as well as an orange, sits in front of Bell-mère's grave.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Bogard (cover)",
    "Koby (cover)",
    "Helmeppo (cover)",
    "Morgan (cover)",
    "Chabo",
    "Nojiko",
    "Genzo",
    "Bell-mère (flashback)",
    "Nako",
    "Yosaku",
    "Johnny"
  ],
  "ssum_frequencies": [
    [
      "the",
      9
    ],
    [
      "to",
      5
    ],
    [
      "and",
      5
    ],
    [
      "with",
      4
    ],
    [
      "she",
      4
    ],
    [
      "her",
      3
    ],
    [
      "a",
      3
    ],
    [
      "as",
      3
    ],
    [
      "straw",
      2
    ],
    [
      "hats",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      32
    ],
    [
      "and",
      18
    ],
    [
      "to",
      17
    ],
    [
      "her",
      17
    ],
    [
      "that",
      16
    ],
    [
      "nami",
      11
    ],
    [
      "in",
      10
    ],
    [
      "genzo",
      10
    ],
    [
      "from",
      8
    ],
    [
      "his",
      8
    ],
    [
      "not",
      7
    ],
    [
      "as",
      7
    ],
    [
      "a",
      7
    ],
    [
      "their",
      6
    ],
    [
      "with",
      6
    ],
    [
      "him",
      6
    ],
    [
      "then",
      6
    ],
    [
      "nojiko",
      6
    ],
    [
      "luffy",
      5
    ],
    [
      "he",
      5
    ]
  ]
}