{
  "chapter_number": "Chapter 141",
  "title": "Quack Doctor",
  "short_summary": "Wapol arrives to Drum castle but he discovers it will not be easy to recover his throne. Chopper and Doctorine, with the help of Luffy, are ready to defend what has become Dr. Hiriluk's grave, a quack doctor who rebelled against Wapol's doctor ban.\n",
  "long_summary": "In Bighorn, Zoro gets rid of Wapol's guards easily, which allows the villagers to search for Dalton, who was heavily injured before being buried into the avalanche. After some searching, he is found but is in a critical state.\nAt the castle, Chopper has smelled Wapol's return. The former king has decided to take his former castle back, but Doctorine and Chopper will not hand it back to Wapol. The castle, as shown by the pirate flag on its roof, is now the grave of Dr. Hiriluk.\n6 years ago, Wapol banned every doctor from Drum's kingdom. The only ones allowed to stay were the Isshi-20. However, two doctors resisted against the tyrant: Dr. Kureha and Dr. Hiriluk. However, the skills of Hiriluk were highly questionable, and the villagers fear his treatments more than Wapol, hence his surname of 'Fake Doctor'.\nOne day, after having escaped the kingdom guards, Hiriluk bumps into a wounded creature. Hunted by everyone so far, he does not trust the charlatan and beats him. However, Hiriluk stands up, and to prove his true feelings, stands naked and defenseless in front of him. Later, Chopper wakes up and his injuries had been cured by the doctor. He cannot retain his tears as he had finally been accepted by someone.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Wapol",
    "Chess",
    "Kuromarimo",
    "Robson",
    "Jango (cover)",
    "Dalton",
    "Kureha",
    "Hiriluk (flashback)",
    "Tony Tony Chopper",
    "Nefertari Vivi"
  ],
  "ssum_frequencies": [
    [
      "to",
      3
    ],
    [
      "doctor",
      2
    ],
    [
      "wapol",
      1
    ],
    [
      "arrives",
      1
    ],
    [
      "drum",
      1
    ],
    [
      "castle",
      1
    ],
    [
      "but",
      1
    ],
    [
      "he",
      1
    ],
    [
      "discovers",
      1
    ],
    [
      "it",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      15
    ],
    [
      "and",
      7
    ],
    [
      "his",
      6
    ],
    [
      "of",
      5
    ],
    [
      "to",
      5
    ],
    [
      "hiriluk",
      5
    ],
    [
      "he",
      4
    ],
    [
      "by",
      4
    ],
    [
      "in",
      3
    ],
    [
      "is",
      3
    ],
    [
      "castle",
      3
    ],
    [
      "chopper",
      3
    ],
    [
      "wapol",
      3
    ],
    [
      "dr",
      3
    ],
    [
      "doctor",
      3
    ],
    [
      "however",
      3
    ],
    [
      "wapols",
      2
    ],
    [
      "guards",
      2
    ],
    [
      "villagers",
      2
    ],
    [
      "into",
      2
    ]
  ]
}