{
  "chapter_number": "Chapter 14",
  "title": "Reckless!!",
  "short_summary": "Mohji returns to warn Buggy about Luffy, but collapses before he can give Buggy the full details. Back in the town, Nami's opinion of Luffy has begun to change, but the mayor is frustrated that while Luffy and Chouchou fought, he did nothing. Buggy then fires one of his Buggy Balls at the mayor's house where Zoro had been sleeping and destroys it. The swordsman emerges with no new injuries, and the mayor finally decides to stand up to the Buggy Pirates with Luffy, Zoro, and (reluctantly) Nami.\n",
  "long_summary": "Mohji reports back to Buggy; despite being afraid to tell Buggy about his failure, he feels he must warn him. However, he faints while he is warning him. The crew cannot make out what Mohji was trying to say, but Buggy becomes aware that he is facing a tough man and orders his men to hurry up the preparation of the Buggy Balls.\nOutside the town, Chouchou arrives at the camp the townsfolk are staying at, injured but safe (to everyone's relief). Since Boodle failed to return with the dog, they are now worried.\nBack in the town, Nami has changed her mind about Luffy being a pirate. The mayor gets frustrated at the pirates in the town, because while Chouchou and Luffy fought hard he stood back and did nothing. The mayor tells Luffy and Nami how only 40 years ago, the land was nothing but bare earth, and how the people moved here to forget all about the pirates that had previously done them wrong. The mayor declares the town is his treasure.\nAt that moment, Buggy launches a Buggy ball that hits the Mayor's house where Zoro was sleeping, making everyone fly from the ball's incredible damage. Luffy and the Mayor go crazy because Zoro is in the house, but Zoro simply gets up out of the rubble, awake and relatively unharmed. The mayor is in shock as his life's work is torn apart, and he cannot sit by while this is happening. Nami tries to calm him down, but the mayor is too upset about what is happening. As the mayor runs off, Luffy ensures Nami he will not let him die. Luffy asks Nami to join him, but Nami declares she will not become a pirate. However, she will help Luffy in exchange for any treasure they find.\nAs Buggy has a second shot readied, the Mayor shows up and stands in the way. He makes a stand against the pirates as elsewhere Luffy, Zoro, and Nami make their way to Buggy.\n\n"
}