{
  "chapter_number": "Chapter 128",
  "title": "Pride (Pirate Flag)",
  "short_summary": "The Straw Hats depart from Little Garden, and hurry to Arabasta. As Smoker intercepts their phone call and leaves for Arabasta as well.\n",
  "long_summary": "On a marine ship somewhere in the Grand Line Smoker asks an unknown marine to play back the intercepted message that they just recorded. He also demands that Tashigi hears it as well. Smoker has to shout at her to get her to listen. The message is played back and though it is poor reception a few important words can be heard, such as: princess Vivi, Straw Hat, Mr. 0, and orders. Tashigi then wonders if the message has something to do with Mr. 11, whom Smoker tricks into revealing that he is a part of it.\nSmoker then recalls that Vivi is the princess of Arabasta and decides to head there. Meanwhile back at Little Garden, everyone is happy that they managed to defeat the Baroque Works members, Sanji then shows up and reveals that he just had a conversation with Mr. 0 and obtained an eternal log pose. Sanji and Zoro then try and determine who won their hunting contest which reminds the giants why they started fighting.\nThe Straw Hats then leave for Arabasta and the giants tell them no matter what, just go straight.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Dorry",
    "Brogy",
    "Nefertari Vivi",
    "Karoo",
    "Smoker",
    "Tashigi",
    "Mr. 11"
  ],
  "ssum_frequencies": [
    [
      "and",
      2
    ],
    [
      "arabasta",
      2
    ],
    [
      "as",
      2
    ],
    [
      "the",
      1
    ],
    [
      "straw",
      1
    ],
    [
      "hats",
      1
    ],
    [
      "depart",
      1
    ],
    [
      "from",
      1
    ],
    [
      "little",
      1
    ],
    [
      "garden",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      9
    ],
    [
      "and",
      8
    ],
    [
      "to",
      7
    ],
    [
      "that",
      6
    ],
    [
      "is",
      5
    ],
    [
      "then",
      5
    ],
    [
      "a",
      4
    ],
    [
      "smoker",
      4
    ],
    [
      "back",
      3
    ],
    [
      "message",
      3
    ],
    [
      "they",
      3
    ],
    [
      "just",
      3
    ],
    [
      "he",
      3
    ],
    [
      "it",
      3
    ],
    [
      "mr",
      3
    ],
    [
      "marine",
      2
    ],
    [
      "an",
      2
    ],
    [
      "tashigi",
      2
    ],
    [
      "as",
      2
    ],
    [
      "has",
      2
    ]
  ]
}