{
  "chapter_number": "Chapter 168",
  "title": "Rainbase, The Town of Dreams",
  "short_summary": "The Straw Hats finally arrive at Rainbase. Unfortunately, while they are buying some water, Luffy and Usopp bump into Smoker and Tashigi. The marine captain was suspicious about Crocodile's activities and decided to come to Rainbase as well. A pirate hunt starts. Cornered by the marines, the Straw Hat Pirates (except Chopper who left for a personal break) decide to split and meet up at Crocodile's casino. After the chase, Luffy, Usopp, Nami, and Zoro arrive at the casino followed by Smoker. Meanwhile, Sanji is fighting marines and Vivi is alone in an unknown place.\n",
  "long_summary": "With one hour until Operation: Utopia starts, the Straw Hat Pirates make it to Rainbase, while Usopp gives Nami her new weapon: the Clima-Tact which causes Sanji to comment that Nami and Vivi do not need weapons and that all they need is him. He then asks them to call him Mr. Prince, which causes Zoro to mockingly call him Mr. Prince, much to the annoyance of Sanji. Vivi then comments that the Baroque Works agents probably know that they are there and that they should be careful. The Straw Hat Pirates debates on what to do once they encounter the Baroque Works.\nAt Rainbase, Smoker and Tashigi are in a bar. Smoker is saying that he feels that something will happen in Rainbase, when, Luffy and Usopp comically arrive, demanding for water. As each duo recognizes the other, Luffy and Usopp comically spews out their water at Smoker and Tashigi and then flee from the bar.\nThe rest of the Straw Hat Pirates are waiting for Luffy and Usopp when they see the pair running towards them, with Smoker and Tashigi chasing after them. Nami screams at the pair not to run towards them, and Vivi is worried about Chopper but Zoro tells her not to worry about him. The Marines spot the Straw Hat Pirates and start to chase after them as well. Unfortunately, this causes several Baroque Works agents to notice the events and they recognize the Straw Hat Pirates. Luffy then tells them all to meet up at Croc's house. Smoker decides to chase Luffy, while Sanji decides not to run but to fight as well as Zoro, but he runs at the sight of Tashigi. Meanwhile Usopp and Nami are being chased by several Baroque Works members but manage to lose them, only to encounter another group, but they are quickly defeated by Zoro who shows up. All the Straw Hats then show up in front of Raindinners and enter it while being chased by Marines, Crocodile who has been informed of this, is pleased.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Tony Tony Chopper",
    "Jango (cover)",
    "Smoker",
    "Fullbody (cover)",
    "Tashigi",
    "Nefertari Vivi",
    "Matsuge",
    "Crocodile",
    "Miss All Sunday"
  ],
  "ssum_frequencies": [
    [
      "the",
      6
    ],
    [
      "and",
      6
    ],
    [
      "at",
      3
    ],
    [
      "to",
      3
    ],
    [
      "straw",
      2
    ],
    [
      "arrive",
      2
    ],
    [
      "rainbase",
      2
    ],
    [
      "luffy",
      2
    ],
    [
      "usopp",
      2
    ],
    [
      "smoker",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      18
    ],
    [
      "to",
      16
    ],
    [
      "and",
      15
    ],
    [
      "that",
      7
    ],
    [
      "they",
      7
    ],
    [
      "them",
      7
    ],
    [
      "straw",
      6
    ],
    [
      "hat",
      5
    ],
    [
      "pirates",
      5
    ],
    [
      "usopp",
      5
    ],
    [
      "then",
      5
    ],
    [
      "of",
      5
    ],
    [
      "are",
      5
    ],
    [
      "at",
      5
    ],
    [
      "smoker",
      5
    ],
    [
      "luffy",
      5
    ],
    [
      "but",
      5
    ],
    [
      "nami",
      4
    ],
    [
      "not",
      4
    ],
    [
      "is",
      4
    ]
  ]
}