{
  "chapter_number": "Chapter 188",
  "title": "Okama Kenpo",
  "short_summary": "When Chaka agrees to Vivi's demand to destroy the palace, understanding Arabasta's people are more important than the stone, Mr. 2 takes the upper hand in his fight against Sanji. When the okama is transformed into Nami, the cook's kicks are useless, as Sanji would never harm a girl. After playing several times with Sanji's weak heart, when he thinks he is giving the final blow, Sanji send him flying with a Joue Shoot kick. Indeed, he has discovered Okama Kenpo's weakness, Bon Kurei is unable to perform his attacks when transformed, hence he has to go back to his normal self before hitting Sanji. Mr. 2 then reveals his last trick, by putting the 2 swan heads from his costume to his feet, he is able to increase his attack range without diminishing their strength. However, Sanji notices that the time between two attacks increases. After evading the first attack, he has the advantage. Mr. 2 uses Sanji's weakness and transforms into Nami, but Sanji, with the classic \"you've got something on the cheek\" lie, is able to make the Okama back to normal and send him the final blow.\n",
  "long_summary": "Members of the royal army are surprised that Princess Vivi requested to destroy the palace, that has a 4,000 year old history. Chaka, hesitating at first, ordered everyone to follow the princess's every demand, bowing down to Vivi.\nBack at the South Block, Mr. 2, possessing Nami's face, presses down on a beaten and grounded Sanji, telling him he's not as strong as he says he is. Sanji comments to himself that even though he looks different, he's still an okama on the inside, and tells Mr. 2 not to get cocky, but becomes infatuated again when he looks at Nami's face. Mr. 2 proceeds to take off his clothes, saying this country is too hot, prompting Sanji to ask if he (\"she\") needs help, but he is knocked back by Mr. 2's Okama Kenpo. Every time Sanji prepares to attack, Mr. 2 changes his face back to Nami's to prevent him. After attacking Sanji with his Mascara Boomerang, Mr. 2 prepares to finish Sanji off, only for Sanji to notice he has his original face and kicks him away. Sanji points out the weakness of Mr. 2's Mane Mane no Mi powers, explaining that he cannot use Okama Kempo while impersonating Nami, and he changes back to normal by touching his face with his left hand.\nMr. 2, dismissing this, attacks Sanji with his Prima attack, which Sanji barely dodges, but not before noticing the attack left a clean hole in a building's wall. Sanji, deducing a weakness of the attack, dodges and proceeds to counterattack, prompting Mr. 2 to change into Nami again. Sanji tells Mr. 2 that there is something on his left cheek, prompting Mr. 2 to touch his face with his left hand, changing him back to normal. Sanji then uses Veau Shot on him.\n\n",
  "characters": [
    "Nami (as a face of Mr. 2)",
    "Sanji",
    "Hatchan (cover)",
    "Nefertari Vivi",
    "Chaka",
    "Mr. 2 Bon Kurei"
  ],
  "ssum_frequencies": [
    [
      "the",
      14
    ],
    [
      "to",
      9
    ],
    [
      "his",
      7
    ],
    [
      "sanji",
      6
    ],
    [
      "he",
      6
    ],
    [
      "is",
      5
    ],
    [
      "when",
      4
    ],
    [
      "2",
      4
    ],
    [
      "mr",
      3
    ],
    [
      "okama",
      3
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      17
    ],
    [
      "sanji",
      13
    ],
    [
      "mr",
      11
    ],
    [
      "his",
      10
    ],
    [
      "2",
      9
    ],
    [
      "he",
      9
    ],
    [
      "the",
      8
    ],
    [
      "face",
      6
    ],
    [
      "that",
      5
    ],
    [
      "a",
      5
    ],
    [
      "back",
      5
    ],
    [
      "and",
      5
    ],
    [
      "him",
      5
    ],
    [
      "on",
      4
    ],
    [
      "is",
      4
    ],
    [
      "attack",
      4
    ],
    [
      "with",
      4
    ],
    [
      "left",
      4
    ],
    [
      "of",
      3
    ],
    [
      "at",
      3
    ]
  ]
}