{
  "chapter_number": "Chapter 89",
  "title": "Trade-Off",
  "short_summary": "Sanji goes underwater to free Luffy, but Arlong overwhelms Zoro and a revived Hatchan chases after Sanji. However, Hatchan's wounds reopen and Sanji successfully frees Luffy. Luffy then begins his attack on Arlong.\n",
  "long_summary": "Sanji goes to free Luffy from his rock entrapment underwater, but as Zoro confronts Arlong, the fish-man states that he wishes to find out who interfered and kept Luffy alive. Wanting to distract Arlong, Usopp shouts at him and shoots a rubber band at him, but Arlong's attention remains on Zoro. Zoro swings his sword at Arlong's face, only for the fish-man's long nose to counter it. Arlong says that his unbreakable nose is his greatest pride as Hatchan gets back up. Initially frightened due to thinking that Usopp's rubber band was heading for him, Hatchan gets angry and dives into the water to kill Sanji, shocking Zoro. Arlong tells Zoro that his group will die no matter what before headbutting him in the chest, causing him to cry out in pain.\nSanji reaches Nojiko and Luffy at the bottom of the pool, and as he prepares to destroy Luffy's rock with a kick, Nojiko notices Hatchan pursuing him. She goes behind Sanji to shield him from Hatchan's rapid punches, and Sanji is shocked as he sees Hatchan attacking. Above water, Usopp shouts to Zoro as he climbs over the wall to Arlong Park, and Arlong lifts the swordsman by the neck. Wondering why Zoro is bandaged so much, Arlong rips the bandages off, and is shocked to see the gruesome wound on Zoro's chest. He prepares to kill Zoro, but Zoro exclaims that Hatchan's wounds would not have reopened if he had stayed down. Arlong initially thinks Zoro is talking about himself, but Zoro reveals who he was talking to, and underwater, Hatchan's wounds reopen before he can attack Nojiko and Sanji. With Hatchan taken out, Sanji quickly destroys Luffy's rock with a kick, and Luffy's body shoots up to where his head is, sending him flying over Arlong Park.\nThe Straw Hats, townspeople, and their allies rejoice at Luffy's arrival, and Luffy grabs Zoro and throws him out of the way in order to switch places with him. Luffy then unleashes a rapid string of attacks on Arlong, which overwhelm the fish-man and leave him lying at the foot of the tower. However, Arlong gets up without taking significant damage, but Luffy responds that that was just his warm-up exercise. Meanwhile, Zoro swears to kill Luffy after landing on the ground.\n\n"
}