{
  "chapter_number": "Chapter 67",
  "title": "Soup",
  "short_summary": "Luffy recovers from his fight after the departure of Krieg Pirates. He realizes that his debt to Zeff has been fulfilled and is now free to leave. He wants Sanji to come with but the stubborn cook does not want to leave the restaurant, despite his dream of finding the All Blue.\n",
  "long_summary": "After Luffy wins the battle with Don Krieg, Gin plans to bring Krieg with him. Patty and Carne try to stop him because poison gas was still in his body, but Gin ignores it and tells Sanji to tell Luffy \"See you again in Grand Line\". Suddenly, Gin vomits blood and believes he will die in two to three hours. He considers his stupidity because of his acceptance of an inevitable death and decides that he will do anything he wants in the meantime. He then recalls Krieg's teachings that if you decide something, do it without doubt, no matter how strong your opponent. Sanji listens to Gin's words, and asks Patty and Carne to give him their shopping ship. At first they disagree, but Sanji forces them with his very powerful kicking techniques.\nSuddenly, in the Baratie, Luffy wakes up, and asks where his straw hat is located. Sanji informs him that his hat is in Luffy's hand. Luffy opens his band-aid and asks about the Krieg Pirates. Sanji wonders if they have gone and tells Luffy about Gin's order. Luffy wonders if Gin wants to meet Sanji again, and is scolded because his stupidity. Suddenly, Luffy remembers Zeff has promised that today is the last day of work. Luffy continues to plead for Sanji to become a crew member of his. Sanji rejects it because he wants to keep working on the Baratie because Zeff has recognized his mastery. Finally, Luffy gives up hope. Sanji maintains his promise that he will go to the Grand Line someday. Sanji asks if Luffy knows about the All Blue. Sanji then informs him about his dream of finding the place and appears happy. Zeff sees the joy in Sanji as he dreams of the All Blue and makes plans.\nIt's now Luffy's break time. Luffy and Sanji come to the mess hall but there are no chairs for them. A cook tells them to sit on the floor. Suddenly, Patty asks who made the soup, to which Sanji said that he made it. Patty insults it, saying it tastes bad. Sanji is angered to hear that and insults Patty back. However, everyone in the room agrees with Patty that the soup that Sanji made is really bad. Zeff tastes it too, and agrees with the cooks. Sanji becomes furious and pulls Zeff's collar, but Zeff punches him, knocking Sanji out of the restaurant. Luffy eats the soup and grins while he announces that it is delicious. Zeff then explains the scenario and asks Luffy to bring Sanji with him on his journeys, because his dream is to go to Grand Line. Unfortunately, Sanji, outside, hears their conversation.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Krieg (K.O)",
    "Gin",
    "Pearl (flashback)",
    "Richie (cover)",
    "Zeff",
    "Sanji",
    "Patty",
    "Carne",
    "Kumate Tribe (cover)"
  ],
  "ssum_frequencies": [
    [
      "the",
      4
    ],
    [
      "to",
      4
    ],
    [
      "his",
      3
    ],
    [
      "of",
      2
    ],
    [
      "he",
      2
    ],
    [
      "leave",
      2
    ],
    [
      "luffy",
      1
    ],
    [
      "recovers",
      1
    ],
    [
      "from",
      1
    ],
    [
      "fight",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      20
    ],
    [
      "sanji",
      20
    ],
    [
      "to",
      18
    ],
    [
      "and",
      18
    ],
    [
      "his",
      14
    ],
    [
      "luffy",
      13
    ],
    [
      "he",
      10
    ],
    [
      "that",
      10
    ],
    [
      "in",
      8
    ],
    [
      "it",
      8
    ],
    [
      "is",
      8
    ],
    [
      "him",
      7
    ],
    [
      "of",
      7
    ],
    [
      "with",
      6
    ],
    [
      "patty",
      6
    ],
    [
      "because",
      6
    ],
    [
      "asks",
      6
    ],
    [
      "zeff",
      6
    ],
    [
      "gin",
      4
    ],
    [
      "but",
      4
    ]
  ]
}