{
  "chapter_number": "Chapter 83",
  "title": "Luffy in Black",
  "short_summary": "Luffy, Zoro, Usopp, and Sanji confront Arlong, Hatchan, Chew, and Kuroobi. Usopp accidentally attacks Chew and is chased out of Arlong Park, while Luffy ends up getting his feet stuck in the concrete. Arlong picks up the concrete Luffy is trapped in and throws him into the pool, leaving him stuck underwater.\n",
  "long_summary": "The citizens of Cocoyasi Village express their shock at Luffy knocking out Momoo with his windmill attack, and the Straw Hats prepare to take on the Arlong Pirates. Chew, Hatchan, and Kuroobi tell Arlong that he can sit back while they deal with the Straw Hats as if he were to fight, Arlong Park could end up being destroyed, and Hatchan shoots out a massive ink spray from his mouth. Luffy is caught by the ink spray and is blinded; he also accidentally planted his feet in the concrete and cannot move. Hatchan picks up a massive piece of the tower that Luffy damaged and slams it onto him, but Sanji steps in and destroys the piece with his leg. Sanji addresses the fish-men, who try telling him about their superiority to humans, while Usopp unsuccessfully tries pulling Luffy out of the ground.\nHatchan ignores Sanji to throw another chunk of the tower at Luffy, but he is confronted by Zoro. Hatchan throws the large chunk at Zoro and expresses his anger at what the human pirate did to his comrades earlier, but Zoro pays it little mind and simply states that the Arlong Pirates will be beaten. Usopp is relieved that Zoro took on Hatchan, but accidentally lets go of Luffy, causing him to snap back to where his feet are planted and hit Chew with the recoil. An enraged Chew chases after Usopp, who runs all the way out of Arlong Park. Chew stops in front of the citizens, and notes that their weapons indicate a rebellion against the Arlong Pirates, but Usopp then snipes him with Kaen Boshi. Usopp tells Chew that he is his enemy, but starts running once Chew chases him again, confusing the citizens.\nMeanwhile, Arlong gets up despite Kuroobi's protests, but says that he only wants to say something. Luffy throws a punch at him, but Arlong catches it. He asks Luffy if he really thinks he can beat them, and Luffy, Zoro, and Sanji affirm this. Arlong then decides to not say anything as he instead picks up a chunk of the concrete Luffy is stuck in, planning to throw it into the water and drown the pirate. Luffy tries attacking him, but Arlong catches the punch with his mouth and injures Luffy's arm with his teeth. Luffy retaliates by biting Arlong's arm, but this does nothing as Arlong throws him into the pool. Luffy becomes immobilized as he sinks due to the concrete and his Devil Fruit abilities, and Sanji tries to go in and save him, but Zoro says that the Arlong Pirates were baiting them into a trap and they would need to take out the fish-men to save Luffy.\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Usopp",
    "Sanji",
    "Arlong",
    "Hatchan",
    "Chew",
    "Kuroobi",
    "Momoo (K.O)",
    "Koby (cover)",
    "Helmeppo (cover)",
    "Nojiko",
    "Genzo",
    "Nako",
    "Yosaku",
    "Johnny"
  ],
  "ssum_frequencies": [
    [
      "and",
      4
    ],
    [
      "luffy",
      3
    ],
    [
      "arlong",
      3
    ],
    [
      "the",
      3
    ],
    [
      "usopp",
      2
    ],
    [
      "chew",
      2
    ],
    [
      "is",
      2
    ],
    [
      "up",
      2
    ],
    [
      "stuck",
      2
    ],
    [
      "in",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      27
    ],
    [
      "and",
      19
    ],
    [
      "luffy",
      14
    ],
    [
      "to",
      14
    ],
    [
      "arlong",
      12
    ],
    [
      "his",
      11
    ],
    [
      "he",
      11
    ],
    [
      "but",
      11
    ],
    [
      "him",
      9
    ],
    [
      "of",
      8
    ],
    [
      "that",
      8
    ],
    [
      "with",
      7
    ],
    [
      "chew",
      6
    ],
    [
      "hatchan",
      6
    ],
    [
      "a",
      6
    ],
    [
      "is",
      6
    ],
    [
      "zoro",
      6
    ],
    [
      "at",
      5
    ],
    [
      "out",
      5
    ],
    [
      "in",
      5
    ]
  ]
}