{
  "chapter_number": "Chapter 33",
  "title": "The Silent Man",
  "short_summary": "Kuro, having just arrived on the scene, wonders how the Black Cat Pirates could be having such problems from a bunch of children. Jango says that Kuro himself said that Usopp would not be a problem, and Sham and Buchi say that while Kuro was getting soft, they were out fighting. Sham and Buchi attack, but Kuro evades their attacks and states that he will kill everyone present if the Straw Hat Pirates are not dead in five minutes. Sham and Buchi attack Zoro once more, but Nami kicks Zoro his two stolen swords. With all three blades, Zoro then defeats Sham and Buchi in a single move. Buchi, however, survives and convinces Jango to hypnotize him in being stronger. While Zoro takes on Buchi, Nami runs to wake up Luffy, forcing Jango to throw a chakram at her.\n",
  "long_summary": "Kuro demands to know how the Black Cat Pirates were beaten by a bunch of children. Jango states it was Kuro himself that said Usopp would not be a problem, but Kuro just states that the Black Cats are weaker than he thought they were.\nBuchi and Sham cannot believe what they are hearing. They try to argue that while Kuro has been leading a peaceful existence in the village, they have been fighting hard against other pirates and plundering other villages and that in three years they have gotten a lot stronger. They attempt to kill Kuro before he kills them, but to their horror Kuro dodges the attack. He appears behind them but when they turn to strike, he once again appears behind them again with his special weapons, the Cat Claws, pointing at the pairs' throats. Jango comments how, with those weapons, Kuro can move silently and that Kuro's habit of lifting up his glasses still makes his hair stand on end. Kuro tells the Nyaban Brothers they have 5 minutes to kill them or he will kill everyone.\nWith renewed hope, the pair rush at Zoro. Nami kicks Zoro his swords, much to Zoro's annoyance. With all three swords in his hands, Zoro easily defeats the pair with a single move. Zoro points his sword at Kuro and states he is next. However, attention is drawn to Buchi, who still has survived Zoro's attack. Buchi demands that Jango hypnotize him so he can continue fighting.\nWhile Zoro tackles the hypnotized Buchi, Nami makes an attempt to wake Luffy up. Jango spots this and throws his ring at her.\n\n"
}