{
  "chapter_number": "Chapter 13",
  "title": "Treasure",
  "short_summary": "Mohji and Richie destroy the pet shop guarded by Chouchou. Luffy defeats Mohji and brings Chouchou one bag of pet food, which is all that remains of his store. Nami realizes that Luffy is not a destructive pirate like Buggy.\n",
  "long_summary": "After surviving an attack from Richie, Boodle and Nami struggle to believe Luffy could have lived. The mayor demands to know why Luffy is in Orange Town, and Luffy replies it's to acquire the map of the Grand Line and a navigator.\nMeanwhile Richie and Mohji approach the pet store, only to find out Chouchou will not allow them inside. Chouchou fights the lion, but even though he loses, he will not surrender his treasure and the memory of his owner. As Luffy walks over to find Zoro, Mohji is angry over the dog as it bit him. But as Luffy approaches the pet store, he finds it ablaze with Chouchou barking at the loss of his greatest treasure.\nReturning from the store, Mohji and his lion come across Luffy standing in the way. They cannot believe he is still alive and fail to understand what Luffy means by saying that he is a rubber man. Mohji sends Richie to attack, however to his shock and horror Luffy stops it with an attack. Mohji is astonished that Luffy has a Devil Fruit like his captain Buggy. Mohji begs for mercy, but Luffy explains he is not the one Mohji must say sorry to. Luffy stretches his arms to grab Mohji and throws him head first to the ground.\nNami and the mayor return at Chouchou's store's ruins. Nami expresses a strong dislike for all pirates for what has happened. When Luffy shows up, she takes her dislike for pirates out on him, but Boodle holds her back, preventing her from striking Luffy (although he states she could not kill him even if she tried). Luffy places a bag of pet food in front of Chouchou. Even though the bag of food is all that is left of the store, Chouchou is grateful to Luffy for what he has done. Nami is left wondering why Luffy did something so unlike a pirate.\nMeanwhile, Buggy gives the order to prepare the Buggy Balls, as he is ready to wipe the town out.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Buggy",
    "Mohji",
    "Richie",
    "Nami",
    "Boodle",
    "Chouchou",
    "Hocker (flashback)"
  ],
  "ssum_frequencies": [
    [
      "mohji",
      2
    ],
    [
      "and",
      2
    ],
    [
      "pet",
      2
    ],
    [
      "chouchou",
      2
    ],
    [
      "luffy",
      2
    ],
    [
      "of",
      2
    ],
    [
      "is",
      2
    ],
    [
      "that",
      2
    ],
    [
      "richie",
      1
    ],
    [
      "destroy",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      19
    ],
    [
      "luffy",
      16
    ],
    [
      "to",
      14
    ],
    [
      "is",
      11
    ],
    [
      "and",
      10
    ],
    [
      "he",
      9
    ],
    [
      "mohji",
      8
    ],
    [
      "of",
      7
    ],
    [
      "his",
      7
    ],
    [
      "a",
      6
    ],
    [
      "chouchou",
      5
    ],
    [
      "for",
      5
    ],
    [
      "nami",
      4
    ],
    [
      "store",
      4
    ],
    [
      "not",
      4
    ],
    [
      "but",
      4
    ],
    [
      "as",
      4
    ],
    [
      "him",
      4
    ],
    [
      "attack",
      3
    ],
    [
      "from",
      3
    ]
  ]
}