{
  "chapter_number": "Chapter 160",
  "title": "Spiders Cafe at 8 O'Clock",
  "short_summary": "The Straw Hat Pirates head to the Yuba Oasis to negotiate with the rebel leaders to stop the rebellion. Meanwhile, Crocodile and Miss All Sunday finish preparations for the operation, which is to occur in two days at 7 AM. They have the remaining Officer Agents - Mr. 1 and Miss Doublefinger, Mr. 2 Bon Kurei, and Mr. 4 and Miss Merry Christmas - gather at the Spiders Cafe, with Mr. 3 listening in from the outside. The Officer Agents, once assembled, leave for Rainbase to meet Mr. 0.\n",
  "long_summary": "After Ace's departure, the Straw Hat Pirates head to Yuba. They ask Luffy about the piece of paper Ace gave to him, which has nothing written on it. Despite that, Luffy wants to hold on to it because Ace wanted him to, so Nami sews the paper to the underside of Luffy's hat for safekeeping. The Straw Hats change into clothes that will protect them from the burning temperatures, which Vivi warns Luffy about. They arrive at the mouth of the Sandora River, and Vivi explains the way they will travel to Yuba with a map she sketched. They will exit the river and head inland, across from the town of Erumalu, where they will lay anchor. Afterwards, they will travel across the desert to the Yuba Oasis, so Vivi can meet the Rebel leader to explain the situation. Vivi is convinced that they can stop Baroque Works and save her country.\nMeanwhile Crocodile and Miss All Sunday are finalizing their plan, which begins in two days at 7 o'clock AM. Crocodile asks Miss All Sunday about the necessary preparations and Miss All Sunday answers reassuringly, telling him about the 150 Billions agents waiting at Nanohana. She also mentions Mr. 2 Bon Kurei's failure in finding and taking care of Mr. 3, much to Crocodile's annoyance. Miss All Sunday also reveals that the remaining Officer Agents are set to meet at Spiders Cafe that night at 8.\nSpiders Cafe is revealed to be the Baroque Works Arabasta Headquarters. Inside, a woman is reading a magazine while listening to a vinyl record. Immediately after, Mr. 4 and Miss Merry Christmas come into the Cafe with a ruckus. Miss Merry Christmas blames Mr. 4 for the long trip, which caused her hips to ache, and Mr. 4 apologizes very slowly. Miss Merry Christmas greets the woman, Paula, the owner of the Cafe, and asks her how business is. She notes how there isn't anybody else in the Cafe, and Paula explains that the Cafe is reserved for the Officer Agents that night. Paula mentions how she hasn't seen the Mr. 4 team in a while, and offers an orange pekoe tea to Miss Merry Christmas and an apple tea to Mr. 4. Miss Merry Christmas urges Paula to hurry with the drinks and impatiently bangs on the counter. Paula then asks about their work. Miss Merry Christmas snaps at her, saying work is dangerous as always, so Paula apologizes.\nSuddenly, singing is heard in the Cafe despite the music being played being a sonata. Outside, Mr. 2 Bon Kurei and his subordinate Billions dance towards the Spiders Cafe while singing about the okama Way. Mr. 2 Bon Kurei enters the building on tip-toe, causing Paula to ask if Mr. 2 is an idiot. Mr. 2 laughs it off saying he's an okama and asks Paula for an octofait, octopus parfait, which Paula doesn't serve. Mr. 2 then dismisses his billion subordinates, reminding them not to slack off on their dance practice. Meanwhile, Miss Merry Christmas is getting a massage from Mr. 4, and Mr. 2 observes that \"the fat old hag\" is also attending. He then asks Paula about the Mr. 1 pair, whom he has never met. Though he has heard rumors of Mr. 1's intimidating personality, they don't bother Mr. 2. From afar, it is revealed Mr. 3 is spying on the gathering through a window.\n\n"
}