{
  "chapter_number": "Chapter 36",
  "title": "After Them!!",
  "short_summary": "Usopp is unable to move anymore to protect Kaya but he has not lost his will. Zoro finally defeats Buchi and brings Usopp up on his back so they can catch up with Kaya and the children before Jango. Kuro tries to stop them but finding Luffy in his way, they start to fight each other. Meanwhile Jango has found where the escapee were hidden.\n",
  "long_summary": "Piiman asks the other Usopp Pirates to look back to see if Jango is following them as they escort Kaya through the forest. Just as they think they are safe, Jango's ring comes flying out through the trees in their direction, barely missing them but cutting up every tree they fly through. Jango tells them he is prepared to destroy the whole forest in order to find them.\nThe echoes of Jango chasing after the others can be heard back at the coastline. Kuro tells Usopp he has no feelings for Miss Kaya and if she does just happen to survive, he might thank her for being part of his scheme. As Usopp makes a break for it in order to aid Miss Kaya and the others, Buchi makes an attempt to once again get in the way, but Zoro once again blocks, this time he wastes no time with him. As Usopp makes another break for it, he falls to the ground too weak to continue on while Kuro laughs at his efforts. Usopp knows he cannot win, but is prepared to fight anyway.\nBuchi tosses Zoro aside again. The other Black Cat Pirates mock Usopp and get a boulder thrown at them from Luffy. Zoro loses his temper at Buchi and finally makes the finishing strike against him. With Buchi out of the way, Zoro takes Usopp and heads out after Kaya and the others. Kuro attempts to prevent Zoro and Usopp from leaving, but Luffy sees to it that they are allowed to leave. Unfortunately, Kuro dodges the attack. Kuro then strikes back at Luffy, whom in turn strikes at him. Kuro now concentrates on Luffy only. Kuro asks Luffy why he fights for the village as an outside. Luffy tells him there is someone in the village he won't let die.\nIn the forest, Zoro's bad sense of direction is hindering his attempt to locate Kaya, even with Usopp's help. Elsewhere in the forest, Kaya is beginning to feel the height of her illness as the running around is bringing on her fever. The Usopp Pirates urge her on, but she asks them to leave which they refuse to. Jango finally catches up with them.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Kuro",
    "Jango",
    "Buchi",
    "Mohji (cover)",
    "Richie (cover, K.O)",
    "Cabaji (cover)",
    "Kaya",
    "Usopp",
    "Piiman",
    "Ninjin",
    "Tamanegi",
    "Boodle (cover)",
    "Chouchou (cover)"
  ],
  "ssum_frequencies": [
    [
      "to",
      4
    ],
    [
      "his",
      3
    ],
    [
      "usopp",
      2
    ],
    [
      "kaya",
      2
    ],
    [
      "but",
      2
    ],
    [
      "has",
      2
    ],
    [
      "and",
      2
    ],
    [
      "up",
      2
    ],
    [
      "they",
      2
    ],
    [
      "the",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      22
    ],
    [
      "to",
      17
    ],
    [
      "usopp",
      9
    ],
    [
      "in",
      8
    ],
    [
      "he",
      8
    ],
    [
      "is",
      7
    ],
    [
      "them",
      7
    ],
    [
      "kuro",
      7
    ],
    [
      "and",
      7
    ],
    [
      "as",
      6
    ],
    [
      "they",
      6
    ],
    [
      "kaya",
      6
    ],
    [
      "at",
      6
    ],
    [
      "luffy",
      6
    ],
    [
      "but",
      5
    ],
    [
      "of",
      5
    ],
    [
      "for",
      5
    ],
    [
      "zoro",
      5
    ],
    [
      "jango",
      4
    ],
    [
      "forest",
      4
    ]
  ]
}