{
  "chapter_number": "Chapter 108",
  "title": "100 Bounty Hunters",
  "short_summary": "Zoro vs. Baroque Works bounty hunters.\n",
  "long_summary": "Zoro announces that he knows their secret company that they are \"Baroque Works\" while Luffy and the rest of the crew are sleeping. Baroque Works attempt to kill him to protect their secret identity. Zoro thinks it will be a good chance to test his new swords and have some fun. The fight between Zoro and the 100 bounty hunters begins.\nA bounty hunter sees him and shoots him from the top of a building but Zoro ducks into a house. Then he sees that he is surrounded by more bounty hunters. They shoot at him but he uses a table as his shield. Then Zoro escapes, using the Yubashiri and gets out of the building. He goes upstairs and a bounty hunter with a bazooka shoots at him but Zoro ducks down. Miss Monday sees him at the stairs and she throws a barrel full of liquor at him. Zoro cuts it in four pieces that hit four more members in front of Zoro. Someone with a stone hammer tries to hit him from behind but Zoro dodges it in time and cuts the stone saying that \"This one cuts through stone, the Sandai Kitetsu\" blade is remarkably sharp'. A young boy tries to attack him with a knife, but Zoro flips it away. A nun comes and hugs the kid saying \"God, please protect us\" then she pulls away her cross where smoke comes out in the middle. Zoro avoids the smoke, and hits the nun and boy. He climbs up a ladder, with a lot of members following him up the ladder but Zoro pushes the ladder off the building, and the bounty hunters fall with the ladder. He jumps to another building and tricks the bounty hunters on the building, to fall through a hole he made on the roof.\nMiss Monday surprises Zoro by trying to hit him from behind with one of the ladders. Zoro ducks in time, but then she catches him by his neck and punches him in the face with her super-human strength. Zoro then grabs her with his right hand and he challenges Miss Monday to a game of strength, which she loses. Mr. 8 thinks that the Marines got the bounty poster wrong, and that Zoro must be the real captain due to his strength.\n\n",
  "characters": [
    "Monkey D. Luffy (asleep)",
    "Roronoa Zoro",
    "Nami (asleep)",
    "Usopp (asleep)",
    "Sanji (asleep)",
    "Garp (cover)",
    "Bogard (cover)",
    "Koby (cover)",
    "Helmeppo (cover)",
    "Mr. 8",
    "Miss Monday",
    "Mr. 9",
    "Miss Wednesday",
    "Miss Catherina",
    "Mr. Beans"
  ],
  "ssum_frequencies": [
    [
      "zoro",
      1
    ],
    [
      "vs",
      1
    ],
    [
      "baroque",
      1
    ],
    [
      "works",
      1
    ],
    [
      "bounty",
      1
    ],
    [
      "hunters",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      27
    ],
    [
      "zoro",
      16
    ],
    [
      "and",
      16
    ],
    [
      "a",
      16
    ],
    [
      "him",
      13
    ],
    [
      "to",
      10
    ],
    [
      "he",
      9
    ],
    [
      "of",
      8
    ],
    [
      "with",
      8
    ],
    [
      "that",
      7
    ],
    [
      "bounty",
      7
    ],
    [
      "but",
      7
    ],
    [
      "in",
      6
    ],
    [
      "his",
      5
    ],
    [
      "building",
      5
    ],
    [
      "then",
      5
    ],
    [
      "it",
      4
    ],
    [
      "hunters",
      4
    ],
    [
      "at",
      4
    ],
    [
      "she",
      4
    ]
  ]
}