{
  "chapter_number": "Chapter 171",
  "title": "Koza, Leader of the Rebels",
  "short_summary": "The king had disappeared from the palace. Instead, he is seen in the street of Nanohana, announcing that he was the one who stole the rain from the country. When the guards that follows him starts to shoot the citizens, an enraged Koza rushes toward the king unable to forgive what the king is doing. The same Cobra who refused to lend him some Dance Powder despite villages dying, used it for his own purpose. When he is shot by one of the guards, the rebel leader understand it as a declaration of war. However the king was none other than Mr. 2 in disguise whose job was to start a riot. Meanwhile his Baroque Works partners Mr. 1 and Miss Doublefinger crash a ship into the harbor adding to the confusion.\n",
  "long_summary": "A guard alerts Chaka that the king has disappeared, Chaka then wonders how the king disappeared as there are guards around his room all the time, he then decides to send out search parties. A guard then returns to report to Chaka and tells him that they have found the king \"in a way\", Koza apparently has heard some disturbing news and is rushing towards where the king supposedly is. As he rides he remembers when his father told him not to give up on the king, the news about the rebels reaching 100,000 men, the fighting, the lack of water, his father's faith, his argument with the king, and his change of heart and support of the rebels. At Nanohana the \"king\" is there with an escort of armed guards saying that he has an apology to make and that he will destroy Nanohana, the guards then start to attack as a child confronts the kings. \"Cobra\" merely kicks the child, as Koza arrives, he demands what is going on and \"Cobra\" replies that he is apologizing for using Dance Powder, which enrages Koza, he is then shot by one of the soldiers while the king and his men leave. A giant ship then crashes into port as Mr.1 and Miss Doublefinger walk away, it is then revealed that the king was actually Mr. 2.\n\n",
  "characters": [
    "Jango (cover)",
    "Hina (cover)",
    "Fullbody (cover)",
    "Nefertari Cobra (flashback)",
    "Chaka",
    "Koza",
    "Erik",
    "Kebi",
    "Toto (flashback)",
    "Kappa",
    "Sam",
    "Mr. 1",
    "Miss Doublefinger",
    "Mr. 2 Bon Kurei",
    "Akumai"
  ],
  "ssum_frequencies": [
    [
      "the",
      16
    ],
    [
      "to",
      5
    ],
    [
      "king",
      4
    ],
    [
      "he",
      3
    ],
    [
      "is",
      3
    ],
    [
      "of",
      3
    ],
    [
      "was",
      3
    ],
    [
      "a",
      3
    ],
    [
      "from",
      2
    ],
    [
      "in",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      19
    ],
    [
      "king",
      9
    ],
    [
      "he",
      8
    ],
    [
      "and",
      8
    ],
    [
      "then",
      7
    ],
    [
      "is",
      7
    ],
    [
      "that",
      6
    ],
    [
      "his",
      6
    ],
    [
      "to",
      6
    ],
    [
      "a",
      5
    ],
    [
      "as",
      5
    ],
    [
      "of",
      5
    ],
    [
      "chaka",
      3
    ],
    [
      "has",
      3
    ],
    [
      "guards",
      3
    ],
    [
      "koza",
      3
    ],
    [
      "guard",
      2
    ],
    [
      "disappeared",
      2
    ],
    [
      "there",
      2
    ],
    [
      "him",
      2
    ]
  ]
}