{
  "chapter_number": "Chapter 40",
  "title": "The Usopp Pirates",
  "short_summary": "Luffy finishes his fight with Kuro and tosses him at the rest of the Black Cat Pirates, forcing them to leave the island, never to return. Usopp asks of Kaya and the Usopp Pirates to keep everything that had happened that morning a secret so that the villagers can continue their peaceful lives, free of fear from pirates. They all agree to keep everything a secret. The townspeople notice with surprise that Usopp hasn't come to tell his usual lies to the town as he always does. Meanwhile, Kaya tends to Merry's wounds and reveals her promise in keeping the battle a secret. Elsewhere, Usopp then reveals he has come to a decision: he will leave the village and become a pirate. In his preparation, he disbands the Usopp Pirates.\n",
  "long_summary": "Kuro falls to the ground with Luffy still holding onto him. The Black Cat Pirates are amazed Luffy was able to do so and cannot understand how. They demand to know who he is. Luffy explains he will never lose to a pirate who leaves the sea behind and that a pirate only leaves his name when he dies. Luffy tells them he will become the greatest pirate in the world. Luffy tosses Kuro at the pirates and tells them to leave and never come back again, and all the crew members run away. Luffy collapses, and Nami catches him. With the crew rushing to get away, Nami talks about pirates.\nIn the forest, Zoro ties his bandana around his arm and walks through the forest away from the defeated Jango.\nElsewhere in the forest Usopp has a chat with his Usopp Pirates and Kaya. He asks them to keep the event a secret form the rest of the village, even with pleas from all, he explains he is a liar, no one would believe them anyway. Usopp explains there will be no other pirate attacks, that life must continue on as normal with no one worrying over the possibility of what can happen. Everyone promises to keep the event a secret for the rest of their lives.\nBack in the village, seven o'clock passes by and everyone notices something is missing as Usopp has not done his usual antics. Piiman, Ninjin and Tamanegi return home and get scolded by their parents for one thing or another related to the events of Kuro's plan. At the coastline, Usopp thanks all the Straw Hat Pirates. Back to the mansion, Kaya tends to Merry's wounds and tells him about her promise.\nElsewhere, near a cliff, Usopp calls together his Usopp Pirates and speaks to them. Usopp declares he will leave the island and become a real pirate, to which the others are shocked. He recalls the day he met them. He asks them to chase their dreams and with a tearful farewell between all four members, the Usopp Pirates are declared defunct.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Buggy (cover)",
    "Kuro (K.O)",
    "Jango (K.O)",
    "Usopp",
    "Kaya",
    "Merry",
    "Piiman",
    "Ninjin",
    "Tamanegi",
    "Mornin",
    "Big Bird (cover)"
  ],
  "ssum_frequencies": [
    [
      "the",
      10
    ],
    [
      "to",
      8
    ],
    [
      "usopp",
      5
    ],
    [
      "a",
      5
    ],
    [
      "and",
      4
    ],
    [
      "pirates",
      4
    ],
    [
      "that",
      4
    ],
    [
      "he",
      4
    ],
    [
      "his",
      3
    ],
    [
      "of",
      3
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      27
    ],
    [
      "and",
      15
    ],
    [
      "to",
      14
    ],
    [
      "he",
      11
    ],
    [
      "a",
      9
    ],
    [
      "usopp",
      9
    ],
    [
      "pirates",
      7
    ],
    [
      "them",
      7
    ],
    [
      "with",
      6
    ],
    [
      "luffy",
      6
    ],
    [
      "his",
      6
    ],
    [
      "pirate",
      5
    ],
    [
      "will",
      4
    ],
    [
      "in",
      4
    ],
    [
      "all",
      4
    ],
    [
      "of",
      4
    ],
    [
      "him",
      3
    ],
    [
      "are",
      3
    ],
    [
      "is",
      3
    ],
    [
      "explains",
      3
    ]
  ]
}