{
  "chapter_number": "Chapter 190",
  "title": "Clima-Tact",
  "short_summary": "Mr. 1 and Miss Doublefinger are chasing after Nami who tries to run away. When they are about to catch her she is saved by Zoro who discovered that Mr. 1 has eaten a Devil Fruit which gives him sword-like abilities. When Mr. 1 is dealing with the swordsman, Miss Doublefinger starts to hunt after Nami who has hidden in the city. But she decides not run anymore and fight back with the new weapon Usopp had built for her. But her first attacks are far away from her expectation.\n",
  "long_summary": "Nami grows tired of running and says to herself that she must fight Mr. 1 and Miss Doublefinger, but continues running, disagreeing with herself. Growing tired of playing cat-and-mouse, Mr. 1 lunges towards Nami, who is saved at the last minute by Zoro. Zoro immediately notices that Mr. 1's attack split a building behind them, and after a further attack, Zoro notes that Mr. 1's body is not normal. Mr. 1, explaining that he ate the Supa Supa no Mi and became a human blade, identifies Zoro as the one who defeated 100 bounty hunters at Whisky Peak. Miss Doublefinger also points out that Zoro was invited to be a part of Baroque Works a couple years back by Mr. 7, but Zoro also points out that he refused, because he only wanted to join if he could be the boss. Mr. 7, wanting to recruit Zoro by force, attacked him, which prompted Zoro to kill him. Zoro also points out that even if he was invited again, he would decline even if he could be the boss, now knowing how they operate.\nAs Zoro begins his battle with Mr. 1, Miss Doublefinger decides to go after Nami, who has already fled from the scene. Nami, in a secluded location, has a flashback when she asks Usopp to make her a modified weapon so she could be useful in a fight for Vivi's sake. Commenting that Alubarna isn't far away, Usopp says he will create a weapon for Nami, which prompts her to hug him out of joy, however he still required proper funds and materials. Nami promises to herself that she will stop running and start fighting, now that she has a weapon.\nAs she says this, she is suddenly stabbed in her shoulder through the wall she is hiding behind, the attacker revealed to be Miss Doublefinger, who has eaten the Toge Toge no Mi and became a spike human. Nami prepares to fight her, equipping her Clima-Tact, and claiming that it can manipulate the weather, much to the shock of Miss Doublefinger. Nami prepares to use an attack, only for doves to fly out of her staff instead. Angry, Nami curses Usopp under her breath. Saying that she has to believe in her friends, Nami reads the instructions and prepares for another attack, only for flowers to come out of her staff. As Nami slams her Clima-Tact to the ground, Miss Doublefinger shows sarcastic sympathy for her.\n\n",
  "characters": [
    "Roronoa Zoro",
    "Nami",
    "Usopp (flashback)",
    "Tony Tony Chopper (flashback)",
    "Hatchan (cover)",
    "Mr. 1",
    "Miss Doublefinger",
    "Goldfish Princess (cover)"
  ],
  "ssum_frequencies": [
    [
      "her",
      4
    ],
    [
      "mr",
      3
    ],
    [
      "1",
      3
    ],
    [
      "are",
      3
    ],
    [
      "who",
      3
    ],
    [
      "to",
      3
    ],
    [
      "the",
      3
    ],
    [
      "and",
      2
    ],
    [
      "miss",
      2
    ],
    [
      "doublefinger",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      17
    ],
    [
      "the",
      13
    ],
    [
      "that",
      12
    ],
    [
      "a",
      12
    ],
    [
      "nami",
      11
    ],
    [
      "her",
      11
    ],
    [
      "zoro",
      10
    ],
    [
      "and",
      9
    ],
    [
      "she",
      9
    ],
    [
      "he",
      9
    ],
    [
      "mr",
      8
    ],
    [
      "of",
      7
    ],
    [
      "miss",
      6
    ],
    [
      "doublefinger",
      6
    ],
    [
      "out",
      6
    ],
    [
      "for",
      6
    ],
    [
      "be",
      5
    ],
    [
      "has",
      5
    ],
    [
      "1",
      4
    ],
    [
      "who",
      4
    ]
  ]
}