{
  "chapter_number": "Chapter 164",
  "title": "I Love This Country",
  "short_summary": "Vivi bumps into bandits who recognize her as the princess and decided to capture her. However Koza interposes and, with the help of the Suna Suna Clan, allows Vivi to hide in some ruins. However, she is soon found, but Koza once again saves her and knocks out one of the bandits. Soon after, Cobra and Igaram who was worried after the princess, arrived and stop the criminals.\n",
  "long_summary": "The Suna Suna Clan attacks the bandits while Vivi runs away, later Igaram finds the members of the suna suna clan lying around the sand, injured, he asks what happened to which a member tells him, and also tells him that Vivi ran to the ruins and was chased by a bandit who was chased by Koza. The leader of the bandits manages to find Vivi but is confronted by Koza, who stands up to him, and beats him but is stabbed in the process, the other bandits arrive but are stopped by the king and Igaram. Koza is then rushed to the hospital where he is treated, the next day he informs Vivi that he and his dad are going to start new town, by the name of Yuba. It is then revealed that the rebels plan to strike the capitol in one big invasion and take over the government, it is also revealed that Koza is the leader of the rebellion.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Tony Tony Chopper",
    "Jango (cover)",
    "Nefertari Cobra (flashback)",
    "Nefertari Vivi",
    "Igaram (flashback)",
    "Chaka (shadowed)",
    "Pell (shadowed)",
    "Koza",
    "Okame (flashback)",
    "Kebi (flashback)",
    "Natto (flashback)",
    "Toto",
    "Agotogi (flashback)",
    "Marine Headquarters Court (cover)",
    "Karoo (flashback)",
    "Matsuge"
  ],
  "ssum_frequencies": [
    [
      "the",
      6
    ],
    [
      "and",
      5
    ],
    [
      "her",
      3
    ],
    [
      "vivi",
      2
    ],
    [
      "bandits",
      2
    ],
    [
      "who",
      2
    ],
    [
      "princess",
      2
    ],
    [
      "to",
      2
    ],
    [
      "however",
      2
    ],
    [
      "koza",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      19
    ],
    [
      "to",
      7
    ],
    [
      "is",
      7
    ],
    [
      "and",
      6
    ],
    [
      "by",
      5
    ],
    [
      "suna",
      4
    ],
    [
      "vivi",
      4
    ],
    [
      "of",
      4
    ],
    [
      "he",
      4
    ],
    [
      "him",
      4
    ],
    [
      "that",
      4
    ],
    [
      "koza",
      4
    ],
    [
      "bandits",
      3
    ],
    [
      "but",
      3
    ],
    [
      "clan",
      2
    ],
    [
      "igaram",
      2
    ],
    [
      "a",
      2
    ],
    [
      "tells",
      2
    ],
    [
      "also",
      2
    ],
    [
      "was",
      2
    ]
  ]
}