{
  "chapter_number": "Chapter 24",
  "title": "Things That Can't Be Faked",
  "short_summary": "The Usopp Pirates (without Usopp) approach the restaurant Tamanegi saw Usopp enter with the pirates, and confront Luffy, Zoro, and Nami over the fate of their captain. Learning that Usopp had gone to \"that place\", the Usopp Pirates tell Luffy and the others about Usopp's trips to Kaya's mansion to tell her stories, in an attempt to help brighten her spirits. However her butler, Klahadore, disapproves of Usopp's interactions with Kaya, believing Usopp to be a bad influence for having the blood of a pirate. Luffy's group and the Usopp Pirates arrive just in time to see Klahadore insult Usopp down, before he strikes Klahadore and declares his pride at being the son of a pirate.\n",
  "long_summary": "Piiman, Ninjin, and Tamanegi sneak across town to the restaurant where Zoro, Nami and Luffy are eating. Afraid their captain is being held hostage, they approach with caution, until they simply barge in and find Usopp gone. Seeing Luffy eating meat scares them, and Zoro jokes about having just eaten their captain. After things settle down, the Usopp Pirates work out that Usopp has gone off to visit the mansion where the sick girl lives. He apparently goes there every day to lie and tell her stories.\nAt the mansion, Klahadore the butler explains to his mistress Kaya that he will not allow Usopp inside, on account of his lying. He explains that it is his duty to see she is safe and well on behalf of her late father, and mentions there are two bodyguards on the front gate. Despite his efforts, as soon as Klahadore leaves, Usopp appears outside Kaya's window, claiming nothing could keep him away. Usopp goes onto tell her a story about landing on a giant goldfish's excrement and thinking it was an island, making her laugh.\nBack at the restaurant the boys finish explaining to Luffy and the others why they like their captain, and Luffy announces they will go to the mansion, both to ask for a ship and to see Kaya.\nAfter they reach the mansion, Luffy climbs over the gate. After Merry tells Klahadore that there are intruders, he enquires about the bodyguards, and Merry says that they're having lunch. As Usopp finishes his story about feeding a giant goldfish to a tribe of dwarves, Luffy and Usopp's pirates appear and greet him. Usopp tells Kaya that they've heard how great he is and want to join him, but Luffy promptly states that that's a lie. As Luffy asks Kaya for a big ship, Klahadore appears and demands to know what they are doing. Klahadore tells Luffy he will not get a ship and that they all need to leave.\nKlahadore begins to insult Usopp because his father is a pirate, and that as far as he is concerned all pirates are filthy. When he asks what Usopp wants from Kaya, money or otherwise, Kaya becomes upset. She screams at Klahadore to stop, but the butler continues insulting Usopp, telling him to use one of his usual lies instead of admit to being the son of a pirate. Usopp loses his temper and punches Klahadore for insulting his father, shouting that he is proud to be the son of a pirate.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Kaya",
    "Klahadore",
    "Merry",
    "Usopp",
    "Piiman",
    "Ninjin",
    "Tamanegi"
  ],
  "ssum_frequencies": [
    [
      "the",
      9
    ],
    [
      "usopp",
      8
    ],
    [
      "to",
      6
    ],
    [
      "and",
      5
    ],
    [
      "pirates",
      4
    ],
    [
      "of",
      4
    ],
    [
      "her",
      3
    ],
    [
      "klahadore",
      3
    ],
    [
      "a",
      3
    ],
    [
      "with",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "and",
      19
    ],
    [
      "to",
      18
    ],
    [
      "the",
      17
    ],
    [
      "usopp",
      12
    ],
    [
      "a",
      11
    ],
    [
      "that",
      10
    ],
    [
      "luffy",
      9
    ],
    [
      "he",
      9
    ],
    [
      "his",
      9
    ],
    [
      "klahadore",
      8
    ],
    [
      "is",
      7
    ],
    [
      "they",
      7
    ],
    [
      "of",
      7
    ],
    [
      "kaya",
      6
    ],
    [
      "as",
      6
    ],
    [
      "are",
      5
    ],
    [
      "about",
      4
    ],
    [
      "mansion",
      4
    ],
    [
      "her",
      4
    ],
    [
      "on",
      4
    ]
  ]
}