{
  "chapter_number": "Chapter 84",
  "title": "Zombie",
  "short_summary": "Genzo and Nojiko go to rescue Luffy from his underwater entrapment while Zoro and Sanji take on the Arlong Pirates. Although Zoro is weakened by the injuries he suffered against Mihawk, and Sanji receives a powerful Fish-Man Karate blow, the two shake it off and press on.\n",
  "long_summary": "Zoro and Sanji confront Hatchan and Kuroobi as Luffy sinks helplessly to the bottom of the pool, and Arlong laughs at his weakness as a human. Zoro says he will finish off Hatchan in 5 minutes as he races toward the fish-man. Hatchan spits out ink at him, and Zoro dodges it, but he ends up only cutting off two sections of Hatchan's spiky hair. Hatchan says he will forgive Zoro since he can grow it back, and Sanji notices that Zoro is looking weak. Kuroobi tries attacking the distracted cook, but Sanji dodges his strike and says that a fish should not insult a cook. As Luffy starts to suffocate when he hits the bottom of the pool, Hatchan tells Zoro he is very strong against swordsmen. Zoro raises his sword to attack, and Hatchan claps his arms together to defend himself, but Zoro easily cuts his arms, leaving the swordsman at a loss as to what the fish-man is doing. Hatchan becomes sticky and jumps up to a pillar, which he sticks to. Zoro grows increasingly annoyed with him for wasting his time, and Hatchan notes that Zoro is only using one sword before he says that he has not gotten serious with him yet.\nOutside of Arlong Park, Johnny and Yosaku think that Hatchan is playing mind games with Zoro and decide to go help Luffy. However, Genzo stops them, reminding them that they are severely injured. He says he will go and help Luffy, and Nojiko and the other Cocoyasi Village residents offer to help him, but he refuses in order to be unseen by the Arlong Pirates. Nojiko insists on going despite having received injuries as well, pointing out that the Straw Hats were fighting for her sister's sake, and Genzo reluctantly relents as they head into Arlong Park.\nMeanwhile, Zoro collapses, and Sanji realizes that the wounds Mihawk gave him have still not healed. Seizing his opportunity, Hatchan punches the pillar to cause it to fall onto Zoro, but Zoro quickly gets up and throws the fish-man in front of him, causing the pillar to fall onto him. Zoro collapses again immediately afterwards, and Sanji, Johnny, and Yosaku reflect on the severity of his wounds. However, Sanji's distraction allows Kuroobi to land a hit on him, sending him flying all the way into the wall. Kuroobi states that he is a Level 40 Fish-Man Karate practitioner as Sanji, having gone through the wall, lands behind the Cocoyasi Village citizens. With the Straw Hats seemingly defeated, Arlong tells Kuroobi to throw Zoro into the pool. He asks Hatchan when he is going to come out of the rubble, and Hatchan bursts out in a rage, saying he is the number two swordsman on Fish-Man Island with his Six Sword Style. At first, Kuroobi mocks his display since Zoro was down, but Zoro then gets up, saying that the fish-man's six swords were nothing special and that he would not die until he meets Mihawk again. He tells Johnny and Yosaku to lend him their swords, and as this is happening, Sanji gets up and heads back to Arlong Park, saying that Zeff's kicks were ten times stronger than Kuroobi's punch. Meanwhile, Genzo and Nojiko dive down toward Luffy while Usopp continues running away from Chew.\n"
}