{
  "chapter_number": "Chapter 78",
  "title": "Bell-mère-san",
  "short_summary": "10 years ago, Arlong took a tribute from every adult and child in Cocoyasi Village as he declared it his property. Bell-mère could not pay for her and her two adoptive daughters. She sacrificed herself instead of admitting that the little girls were not related to her.\n",
  "long_summary": "In order to stay alive, every villager had to pay 100,000 and 50,000 more per child to the Arlong Pirates. Everyone in Cocoyasi Village was able to pay and they were preparing to leave. However, one noticed Bell-mère's isolated house when he noticed smoke coming up from a chimney in the trees.\nGenzo knew very well that she could not afford to pay such a high price. He asked her two adoptive daughters, Nami and Nojiko, to flee and hide. When the fish-men arrive at Bell-mère's house, she attacked them. However, she was no match against their brute force. When Genzo told her about the pirate's demands. She agreed and gave Arlong 100,000. The pirates believe she was paying for herself, as one adult. But, as they are about to leave, she told them that the money was for her two adoptive daughters. She could not abandon them and after expressing her love to the two, they attempted to run to her side. She accepted her fate as Arlong raised his gun to her head and told them it would be a warning to all villagers who could not pay. A loud bang erupted and the two children buried their crying faces in horror as their mother was executed.\n\n",
  "characters": [
    "Usopp (cover)",
    "Arlong",
    "Hatchan",
    "Chew",
    "Kuroobi",
    "Kaneshiro",
    "Pisaro",
    "Nojiko",
    "Genzo",
    "Nami",
    "Bell-mère",
    "Nako",
    "Kaya (cover, portrait)"
  ],
  "ssum_frequencies": [
    [
      "her",
      3
    ],
    [
      "and",
      2
    ],
    [
      "not",
      2
    ],
    [
      "10",
      1
    ],
    [
      "years",
      1
    ],
    [
      "ago",
      1
    ],
    [
      "arlong",
      1
    ],
    [
      "took",
      1
    ],
    [
      "a",
      1
    ],
    [
      "tribute",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      13
    ],
    [
      "and",
      8
    ],
    [
      "the",
      8
    ],
    [
      "she",
      8
    ],
    [
      "her",
      7
    ],
    [
      "was",
      5
    ],
    [
      "in",
      4
    ],
    [
      "pay",
      4
    ],
    [
      "a",
      4
    ],
    [
      "two",
      4
    ],
    [
      "them",
      4
    ],
    [
      "as",
      4
    ],
    [
      "arlong",
      3
    ],
    [
      "pirates",
      3
    ],
    [
      "they",
      3
    ],
    [
      "when",
      3
    ],
    [
      "could",
      3
    ],
    [
      "not",
      3
    ],
    [
      "their",
      3
    ],
    [
      "told",
      3
    ]
  ]
}