{
  "chapter_number": "Chapter 112",
  "title": "Luffy vs. Zoro",
  "short_summary": "Luffy is furious at Zoro because he believed Zoro had attacked the people who had kindly given them food and a warm welcome. Luffy attacks Zoro with all of his strength. The swordsman does not even have time to explain himself before being forced to avoid Luffy's punches.\n",
  "long_summary": "Zoro loudly asks Luffy what idiotic things is he saying to him, and Luffy replies that an ungrateful person like him should get beaten. Zoro wonders how he is ungrateful, and Luffy says that he can never forgive Zoro as he remembers standing by the defeated bounty hunters who had fed him, who said that Zoro had attacked them. Luffy yells at Zoro in anger for cutting down the townspeople that fed them the night before, and Nefertari Vivi wonders how dense Luffy is. Mr. 5 and Miss Valentine stand nearby, getting annoyed at the crewmates' argument and wanting to kill them off. Zoro attempts to explain to Luffy that the townspeople were actually bounty hunters, but Luffy cuts him off as he rushes to attack him in a fit of rage. Zoro dodges Luffy's punch, which shatters a building, and he wonders in amazement if Luffy is actually trying to kill him. Luffy replies that he indeed is trying to kill Zoro, and Zoro dodges more attacks as he futilely attempts to reason with Luffy.\nMr. 5 and Miss Valentine conclude that Luffy and Zoro are not interfering with their business and resume their mission to eliminate the princess of Arabasta. However, they accidentally receive Zoro's kick aimed at Luffy, which sends all three flying into buildings. Mr. 5 and Miss Valentine think that the pirates were trying to sabotage them all along, and Mr. 5 prepares to kill Luffy, causing the building they are in to explode. Miss Valentine flies away from the explosion into the air, revealing that she is now 1 kilogram due to the power of the Kiro Kiro no Mi. Vivi warns Zoro to get out of the way, but he silences her, not having time for anyone right now. He then watches as Luffy walks out of the damaged building dragging an unconscious Mr. 5, having burned enough calories to return to his normal size.\nVivi is shocked that Mr. 5, an Officer Agent, was defeated, and Zoro attempts to speak with Luffy, telling him that the townspeople were bounty hunters. As Miss Valentine hovers in the air, annoyed that everyone is ignoring her, Luffy calls Zoro a liar, saying that no enemies would feed them. Miss Valentine finally snaps and changes her weight to 10,000 kilograms, falling toward Zoro with great force, but he steps away as she plants into the ground. Zoro finally gets tired of Luffy's stupidity and prepares to get serious, appalling Vivi. The two crewmates rush at each other and clash, determined to test whether Luffy's unarmed strength or Zoro's swordsmanship is more powerful. They knock each other into opposite walls, and Vivi wonders if it is safe to escape, but her path is cut off as Luffy and Zoro rush at each other again. Meanwhile, Mr. 5 and Miss Valentine simmer in anger over their humiliating defeats, and decide to get revenge on Luffy and Zoro. However, the two pirates stop fighting and tell the agents that them getting in the way of their fight is annoying, and they blow Mr. 5 and Miss Valentine away.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Garp (cover)",
    "Bogard (cover)",
    "Koby (cover)",
    "Helmeppo (cover)",
    "Nefertari Vivi",
    "Karoo",
    "Mr. 5",
    "Miss Valentine"
  ],
  "ssum_frequencies": [
    [
      "zoro",
      3
    ],
    [
      "luffy",
      2
    ],
    [
      "had",
      2
    ],
    [
      "the",
      2
    ],
    [
      "to",
      2
    ],
    [
      "is",
      1
    ],
    [
      "furious",
      1
    ],
    [
      "at",
      1
    ],
    [
      "because",
      1
    ],
    [
      "he",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "and",
      24
    ],
    [
      "to",
      22
    ],
    [
      "the",
      21
    ],
    [
      "luffy",
      18
    ],
    [
      "zoro",
      17
    ],
    [
      "that",
      14
    ],
    [
      "is",
      12
    ],
    [
      "he",
      11
    ],
    [
      "mr",
      8
    ],
    [
      "5",
      8
    ],
    [
      "miss",
      8
    ],
    [
      "valentine",
      8
    ],
    [
      "him",
      7
    ],
    [
      "as",
      7
    ],
    [
      "in",
      7
    ],
    [
      "of",
      7
    ],
    [
      "them",
      6
    ],
    [
      "at",
      5
    ],
    [
      "vivi",
      5
    ],
    [
      "get",
      4
    ]
  ]
}