{
  "chapter_number": "Chapter 138",
  "title": "The Summit",
  "short_summary": "Luffy encounters Wapol and two of his followers who had decided to kill him. However, due to Nami and Sanji's conditions, he is unable to fight back. While he is barely able to evade the trio's attacks, who perfectly mastered battle in a snowy area, he is rescued by a group of lapahn, as a way of thanks for saving a baby lapahn parent earlier.\n",
  "long_summary": "Wapol confronts Luffy, who ignores him, and is attacked for his lack of respect. However, Luffy cannot fight back due to the fact that he is carrying his critically-injured crew mates. Fortunately, he is helped by the lapahns he helped out earlier.\nLuffy then arrives at the base of a nearly vertical cliff. He begins to climb the mountain wall while carrying Sanji and Nami on his back. Finally, after 3 hours of climbing, he reaches the top of the mountain right before he collapses.\nMeanwhile, Wapol and his men have defeated all the lapahns. He then vows to gain revenge on Luffy.\nAt the mountain top, Luffy has finally arrived but passes out due to sheer exhaustion. As he is about to fall off the mountain, a mysterious figure reaches out to save him.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Nami",
    "Sanji",
    "Jango (cover)",
    "Wapol",
    "Chess",
    "Kuromarimo",
    "Robson",
    "Tony Tony Chopper"
  ],
  "ssum_frequencies": [
    [
      "to",
      4
    ],
    [
      "a",
      4
    ],
    [
      "of",
      3
    ],
    [
      "he",
      3
    ],
    [
      "is",
      3
    ],
    [
      "and",
      2
    ],
    [
      "who",
      2
    ],
    [
      "lapahn",
      2
    ],
    [
      "luffy",
      1
    ],
    [
      "encounters",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      9
    ],
    [
      "he",
      8
    ],
    [
      "to",
      6
    ],
    [
      "luffy",
      5
    ],
    [
      "is",
      4
    ],
    [
      "his",
      4
    ],
    [
      "of",
      4
    ],
    [
      "mountain",
      4
    ],
    [
      "and",
      3
    ],
    [
      "out",
      3
    ],
    [
      "wapol",
      2
    ],
    [
      "him",
      2
    ],
    [
      "back",
      2
    ],
    [
      "due",
      2
    ],
    [
      "carrying",
      2
    ],
    [
      "helped",
      2
    ],
    [
      "lapahns",
      2
    ],
    [
      "then",
      2
    ],
    [
      "at",
      2
    ],
    [
      "a",
      2
    ]
  ]
}