{
  "chapter_number": "Chapter 49",
  "title": "Storm",
  "short_summary": "The \"hawk-eyed\" man that destroyed Don Krieg's fleet is revealed to be the same man that Zoro has been looking for. Learning that such strange incidences and powerful people will be common in the Grand Line, the Straw Hat Pirates receive even more inspiration to sail it. Despite having just barely made it back from the Grand Line, Don Krieg decides that they will be stealing the Baratie as a means to return to it. As they initiate their siege of the ship, their galleon is suddenly cut in half. As Luffy, Zoro, and Usopp run out to check on the Going Merry, they find it, as well as Nami, missing. Zeff peers into the distance and spots a man drifting towards them on a small boat that he appears to recognize.\n",
  "long_summary": "Zeff knows of a man with \"hawk eyes\" who seems to fill Gin's description. While the eyes alone aren't enough of a giveaway, the fact that he destroyed Krieg's entire fleet is more than enough proof that he is referring to the man he is thinking of. As Usopp and Luffy discuss never hearing of him, Zoro clarifies that is in fact the man he is looking for. Zoro's puzzled look from the previous chapter comes from the fact that he is looking for that same person, and that he was thought to be found nearby, according to some information Johnny gave him. As some of the chefs discuss a previous customer who get really drunk, Zoro decides that Johnny must have gotten his information mixed up. Sanji asks if perhaps the hawk-eyed man bore some kind of grudge against them, but Gin states that he recalls nothing like that, and that he just attacked them. Zeff proposes that maybe they disturbed his afternoon nap, enraging Gin at the possibility of that being the only reason. Zeff implores him not to get so upset, as such a thing is common in the Grand Line. This further excites Luffy, and he consequently decides that they must go to the Grand Line. Zoro agrees that his goals are undoubtedly tied to the Grand Line, prompting Sanji to label them all as idiots who would rush to their deaths. Zoro acknowledges that Sanji may be right, but warns against calling them idiots. He explains that the day he decided to become the World's Greatest Swordsman, he threw away all attachment to his own life, and thus he is the only person who has a right to call him an idiot. Luffy and Zoro chime in agreement. While Sanji expresses his disapproval, their conviction noticeably stirs something in him, prompting a smile from Zeff. Patty rushes in and reminds them all that Don Krieg's fleet is still parked in front of their ship.\nMeanwhile, Don Krieg's crew recovers thanks to Zeff's food offering. They are rejoicing at being saved, and finally making it back from the Grand Line, which is also known as the \"Pirates's Graveyard\". However, Krieg tells them the plan is to actually return to the Grand Line. When he sees the lack of motivation in his men to return to where they were almost killed, he fires on a man who criticizes his decision. The crew quickly changes their mind and obey Krieg's orders. He then explains that they will steal the Baratie, not worried about the opposition since they are mere chefs.\nWhen Krieg's men attack the restaurant, their galleon is suddenly cut in half. The men are in disbelief as nasty waves rock the boat. Krieg's subordinates try to tell him that the ship has been cut, but he refuses to believe that someone could cut a ship as big as theirs. Luffy, Zoro, and Usopp worry for the others, remembering that the Going Merry was outside in close proximity as well. When they head to where they left the Going Merry, they find Johnny and Yosaku almost drowning without a ship. The bounty hunters tell them the abominable truth; Nami fled with the Going Merry and all their belongings. At the same time, Zeff looks and notices a man on a small boat drifting towards them. \n\n"
}