{
  "chapter_number": "Chapter 197",
  "title": "The Leaders",
  "short_summary": "Koza has arrived to the castle and learns about the real person responsible for his country's sorrow. Vivi begs him to stop the rebellion, but when he rises a white flag in front of the rebel army to stop, he is suddenly shot by a bullet.\n",
  "long_summary": "The mysterious figure calling Vivi's name from the previous chapter is revealed to be Koza, who is shocked to see members of the royal army, including Chaka and Cobra, beaten and immobilized by Crocodile, the \"country's hero\". Crocodile and Miss All Sunday's words and presence make Koza realize the current situation, and asks Vivi who stole Arabasta's rain. Crocodile tells Koza it was him, and also mentions how amusing it was to have Koza, and the royal and rebel armies dancing on the palm of his hand. While Crocodile continues mocking Koza, Cobra tells Koza not to listen to him, and suggests to him to go out and try to prevent anymore needless bloodshed from happening. As Chaka tells Koza that Alubarna will be destroyed in less than half an hour, Koza hurries away from the palace, only to be stopped by Vivi. Vivi shouts at Koza that telling the rebels about the bomb would create too much confusion and the war would not stop and no one will be saved that way, prompting Crocodile to praise Vivi's judgment. While Vivi tells Koza to try and stop the rebellion, Crocodile steps forward, not wanting that to happen, and attacks Koza, however a greatly injured Chaka manages to block the attack. Chaka says that as long as he has breath in him, he will fight, and Crocodile mentions that was what stupidity is. As Chaka offers to hold back Crocodile, Koza has a flashback of training under Chaka as a child.\nIt is then announced that the rebels are making their way to the northern area and has almost reached the palace. Vivi and Koza yell to the confused royal army members to hold up white flags, signaling their surrender. Koza, wanting to stop the war altogether, also wishes to tell the rebel army that the entire fight was pointless. The rebels appear, only to realize the royal army, including Koza, are waving white flags. Koza attempts to tell the rebels the fight is over, however he is shot from behind by a few royal army members, shown to be Baroque Works members incognito. Thinking the royal army is rebelling, the rebels begin to attack.\n\n",
  "characters": [
    "Macro (cover)",
    "Gyaro (cover)",
    "Tansui (cover)",
    "Nefertari Cobra",
    "Nefertari Vivi",
    "Chaka",
    "Koza",
    "Farafra",
    "Kebi",
    "Toto (flashback)",
    "Crocodile",
    "Nico Robin"
  ],
  "ssum_frequencies": [
    [
      "the",
      4
    ],
    [
      "to",
      3
    ],
    [
      "stop",
      2
    ],
    [
      "he",
      2
    ],
    [
      "a",
      2
    ],
    [
      "koza",
      1
    ],
    [
      "has",
      1
    ],
    [
      "arrived",
      1
    ],
    [
      "castle",
      1
    ],
    [
      "and",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      26
    ],
    [
      "to",
      23
    ],
    [
      "and",
      17
    ],
    [
      "koza",
      16
    ],
    [
      "crocodile",
      8
    ],
    [
      "that",
      8
    ],
    [
      "is",
      7
    ],
    [
      "royal",
      6
    ],
    [
      "army",
      6
    ],
    [
      "chaka",
      6
    ],
    [
      "be",
      5
    ],
    [
      "vivi",
      5
    ],
    [
      "as",
      5
    ],
    [
      "rebels",
      5
    ],
    [
      "from",
      4
    ],
    [
      "members",
      4
    ],
    [
      "tells",
      4
    ],
    [
      "was",
      4
    ],
    [
      "him",
      4
    ],
    [
      "a",
      4
    ]
  ]
}