{
  "chapter_number": "Chapter 90",
  "title": "What Can You Do?",
  "short_summary": "Arlong proclaims his views of the superiority of fish-men over humans to Luffy, demonstrating the power of his teeth by biting into a stone pillar. Though Luffy admits that he lacks many innate talents, he states that he does have the strength to beat Arlong, and shatters the fish-man's teeth during their battle. Arlong's teeth grow back, and he brings out two sets of them to hold in his hands as weapons. However, Luffy uses one of Arlong's beaten henchmen to intercept Arlong's weapons, and gets an idea from this.\n",
  "long_summary": "After receiving some blows from Luffy, Arlong acknowledges the Straw Hat captain's strength, but says it would have been better for Luffy to die underwater as he will now have to deal with Arlong's rage at his crew's actions. The nearby onlookers grow tense at the confrontation between Luffy and Arlong, and Sanji casually remarks that they will all die if Arlong beats Luffy, with Nojiko adding that all of East Blue will be doomed as well. Arlong asks Luffy if he knows what the difference between them is, and Luffy answers with sincerity that it is their different body parts (noses, etc.). This shocks Johnny and Yosaku and enrages Arlong, who replies that it is their race as he lunges toward Luffy and tries to bite him. Luffy barely manages to repeatedly dodge Arlong's rapidly encroaching jaws, and his situation seems to be hopeless when Arlong pins him to a pillar by the neck, but he manages to pull his head out of the path of Arlong's jaws by stretching his neck. This causes Arlong to bite into the pillar behind Luffy, and Usopp is initially confident that the fish-man's teeth will break, only for the opposite to happen as Arlong's bite causes the stone pillar to shatter. Johnny and Yosaku are terrified, and Sanji notes that Luffy's body would be completely torn apart if Arlong manages to get his jaws around it. Arlong boasts in the power of his teeth, saying that the humans' lack of this power makes them the inferior species, but Luffy retorts by saying he can just crush stone with his fists. Johnny and Yosaku agree with Luffy's remark, but Arlong calls it frivolous as he charges at Luffy, shouting about how weak humans are, and how Luffy in particular can't even save himself from drowning. However, Luffy does not seem opposed to these accusations of weakness, saying he needs helps because of them as he grabs two swords from Arlong's beaten crewmates.\nSanji wonders if Luffy knows how to use a sword, but Luffy just swings them wildly at Arlong, much to the fish-man's bewilderment as he dodges the random swings. He then counters one of the swords with his nose, sending it flying out of Luffy's hand, and Luffy swings his other sword at Arlong, only for the sword to shatter upon contact with Arlong's nose. Arlong initially thinks Luffy is just playing around, but Luffy is not done yet as he immediately follows up his sword strikes with a cartwheel punch to Arlong's jaw, which sends the fish-man flying back and shatters his teeth. As the bystanders look on in shock, Luffy shouts at Arlong that he cannot fight with swords, or navigate, or cook, or lie like his crewmates can, and that without their help, he would die. Arlong questions Luffy's statement, wondering why anyone would follow someone who professes to be so weak. He asks Luffy what he can do that gives him the right to be a captain, and Luffy simply replies that he can beat Arlong.\nLuffy's crewmates and allies cheer at his statement, but Arlong expresses his exasperation with Luffy's talking as he quickly grows back another set of teeth, much to Luffy's shock. He reveals that he can do this as a shark fish-man, and that the new set is stronger than the old one every time. He then pulls out his new set of teeth and then the next one after that, allowing him to wield two sets of teeth in his hands as weapons while another set of teeth grows back in his mouth. Arlong uses this ability to proclaim again about the superiority of fish-men, and he attacks Luffy with the jaws in his hands. Eventually, he manages to draw blood, but with a shock realizes that it is from a fish-man that Luffy used as a shield. This causes Arlong to get angry, and gives Luffy an idea.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Usopp",
    "Sanji",
    "Arlong",
    "Koby (cover)",
    "Helmeppo (cover)",
    "Nojiko",
    "Genzo",
    "Nami",
    "Nako",
    "Yosaku",
    "Johnny"
  ],
  "ssum_frequencies": [
    [
      "of",
      5
    ],
    [
      "the",
      4
    ],
    [
      "to",
      4
    ],
    [
      "he",
      4
    ],
    [
      "his",
      3
    ],
    [
      "luffy",
      3
    ],
    [
      "teeth",
      3
    ],
    [
      "and",
      3
    ],
    [
      "arlongs",
      3
    ],
    [
      "arlong",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      25
    ],
    [
      "luffy",
      24
    ],
    [
      "to",
      23
    ],
    [
      "he",
      22
    ],
    [
      "and",
      21
    ],
    [
      "arlong",
      19
    ],
    [
      "his",
      18
    ],
    [
      "that",
      16
    ],
    [
      "of",
      14
    ],
    [
      "as",
      13
    ],
    [
      "with",
      12
    ],
    [
      "but",
      8
    ],
    [
      "is",
      8
    ],
    [
      "a",
      8
    ],
    [
      "it",
      7
    ],
    [
      "arlongs",
      7
    ],
    [
      "at",
      7
    ],
    [
      "teeth",
      7
    ],
    [
      "luffys",
      7
    ],
    [
      "this",
      6
    ]
  ]
}