{
  "chapter_number": "Chapter 72",
  "title": "Appropriate",
  "short_summary": "Arlong tries to kill Genzo in order to remind the people of Cocoyasi Village that it is useless to resist the will of the Arlong Pirates. Genzo is saved thanks to Usopp.\n",
  "long_summary": "Genzo is found to possess several weapons - which are forbidden by Arlong's rules. He announces to the crowd that weapons may be seen as the start of rebellion. As a result, Genzo shall be made an example of the inferiority of humans against fish-men and be executed in front of all the villagers. While the villagers of Cocoyasi Village attempt to save the life of their friend, Genzo begs them to stay quiet as it would mean that what they have endured for the past 8 years would have been for nothing.\nWhen Arlong is about to deliver the final blow to Genzo, he is struck by an explosion. Usopp laughs from the top of the buildings and delivers brave words of having 8,000 hardened killers ready to strike against him. Arlong go berserk, and as an answer to Usopp's insult, he destroys the house on which he is staying. Afraid that their leader will destroy all the village which they need to get money, the Fish-Men restrain him and promise to catch Usopp and take him back to Arlong Park.\nAfter Arlong's departure, and while the Fish-Men are trying to capture the running Usopp, Nami appears in the village. Everyone ignores her besides her sister. She has come to deposit flowers on a grave. She tells Nojiko that she only needs 7,000,000 more until she can buy the village.\nMeanwhile, in Arlong Park, Zoro who has been freed by Nami, has defeated every Fish-Man at the park and awaits Arlong's return.\n\n",
  "characters": [
    "Roronoa Zoro",
    "Usopp",
    "Arlong",
    "Chew",
    "Kuroobi",
    "Nami",
    "Kaneshiro",
    "Pisaro",
    "Buggy (cover, shadowed)",
    "Mohji (cover, shadowed)",
    "Richie (cover)",
    "Cabaji (cover, shadowed)",
    "Alvida (cover, shadowed)",
    "Nojiko",
    "Genzo",
    "Kumate Tribe (cover, partly K.O)"
  ],
  "ssum_frequencies": [
    [
      "to",
      4
    ],
    [
      "the",
      3
    ],
    [
      "arlong",
      2
    ],
    [
      "genzo",
      2
    ],
    [
      "of",
      2
    ],
    [
      "is",
      2
    ],
    [
      "tries",
      1
    ],
    [
      "kill",
      1
    ],
    [
      "in",
      1
    ],
    [
      "order",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      18
    ],
    [
      "to",
      13
    ],
    [
      "of",
      8
    ],
    [
      "and",
      7
    ],
    [
      "genzo",
      4
    ],
    [
      "is",
      4
    ],
    [
      "he",
      4
    ],
    [
      "that",
      4
    ],
    [
      "as",
      4
    ],
    [
      "village",
      4
    ],
    [
      "arlong",
      4
    ],
    [
      "she",
      4
    ],
    [
      "which",
      3
    ],
    [
      "by",
      3
    ],
    [
      "arlongs",
      3
    ],
    [
      "be",
      3
    ],
    [
      "an",
      3
    ],
    [
      "fishmen",
      3
    ],
    [
      "in",
      3
    ],
    [
      "usopp",
      3
    ]
  ]
}