{
  "chapter_number": "Chapter 10",
  "title": "Incident at the Tavern",
  "short_summary": "Nami's plan goes wrong when Buggy appears behind her and tells her to kill Luffy. She hesitates and the Buggy Cannon is accidentally lit. She stops the cannon before it fires, and Zoro comes in and chops Buggy up into little pieces.\n",
  "long_summary": "Buggy celebrates the return of his map of the Grand Line and Nami joining his crew. During the celebrations, Nami begins to plan her next move; she will make all the pirates drunk to make clearing them out easier, as she has a bigger drinking capacity than them. Luffy, seeing the other pirates celebrating, wants to join in the fun too and Nami comes over to tease him about his current situation. However, she ends up feeding Luffy and tells him that his fate as a prisoner would end once her plan works.\nBuggy suddenly appears behind her to proclaim that Luffy should die. As a demonstration, he levels a street of buildings with his cannon and a Buggy Ball. Buggy reveals that he plans to use his Devil Fruit powers along with his cannons to conquer the Grand Line. Buggy then orders Nami to fire the cannon at Luffy to prove her loyalty to him. Nami hesitates to fire the cannon, as she had not planned to kill anyone, and even tries to revert Buggy's attention back to the party, without success. Luffy points out Nami is trembling and lacks the oath a pirate has to make. Nami wonders if such a big oath is to kill people like insects, to which Luffy replies it is the capacity to risk one's own life.\nWhen Nami does not lit the fuse on the cannon, one of Buggy's crew steps in to light it anyway, and Nami hits him away with her staff. She claims that no matter what she does, she does not want to become a cruel pirate because pirates killed the most important person in her life.\nWhile Nami is talking to Buggy, Luffy suddenly notices the fuse is lit. He tries to eat the cage in desperation to get out. As the fuse burns, Nami finds herself under attack by the Buggy pirates. Nami tries to swing her staff at the pirates, who easily dodge her attack, while Luffy continues to try and eat his way out of the cage. Nami quits defending herself from Buggy's crew and puts out the fuse with her bare hands. Suddenly Zoro appears and saves Nami, having found Luffy at last.\nBuggy approaches Zoro asking him if he came for Buggy's head. Zoro explains he is no longer a pirate hunter, but Buggy reveals interest in defeating Zoro to become more famous. Buggy attacks Zoro, who accepts the challenge and cuts Buggy into pieces, to the shock of Luffy and Nami. Buggy's crew simply laughs.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Buggy",
    "Acrobatic Fuwas",
    "Nami"
  ],
  "ssum_frequencies": [
    [
      "and",
      4
    ],
    [
      "buggy",
      3
    ],
    [
      "her",
      2
    ],
    [
      "she",
      2
    ],
    [
      "the",
      2
    ],
    [
      "cannon",
      2
    ],
    [
      "namis",
      1
    ],
    [
      "plan",
      1
    ],
    [
      "goes",
      1
    ],
    [
      "wrong",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      27
    ],
    [
      "the",
      24
    ],
    [
      "nami",
      15
    ],
    [
      "and",
      12
    ],
    [
      "buggy",
      11
    ],
    [
      "luffy",
      10
    ],
    [
      "her",
      9
    ],
    [
      "a",
      9
    ],
    [
      "his",
      8
    ],
    [
      "she",
      7
    ],
    [
      "of",
      6
    ],
    [
      "is",
      6
    ],
    [
      "pirates",
      5
    ],
    [
      "out",
      5
    ],
    [
      "as",
      5
    ],
    [
      "in",
      5
    ],
    [
      "him",
      5
    ],
    [
      "he",
      5
    ],
    [
      "buggys",
      5
    ],
    [
      "zoro",
      5
    ]
  ]
}