{
  "chapter_number": "Chapter 123",
  "title": "Luffy vs. Mr. 3",
  "short_summary": "Luffy confronts Mr. 3, and manages to use the agent's Doru Doru no Mi abilities against him by using his candle bindings as hammers. Luffy destroys part of Mr. 3's giant candle and lands a hit on him, but suddenly refuses to help save Nami, Zoro, and Vivi due to Miss Goldenweek's \"Colors Trap\".\n",
  "long_summary": "Luffy, Usopp, and Karoo arrive at Mr. 3's Giant Candle Service Set, and Luffy says he will destroy it. Nami and Zoro bicker about Zoro's plans while they are trapped, and Vivi notes how carefree they are despite still being in trouble. Mr. 3 does not think much of Luffy, but knows that he is stronger than Mr. 5 and Miss Valentine, so he has them take on the others while he attacks Luffy. Usopp says he will provide backup for Luffy from behind the trees, and Brogy asks why Zoro is no longer trying to get out. Zoro replies that there is now someone who will try to get them out, but Mr. 3 immediately manages to lock Luffy's feet into a candle with his Devil Fruit ability. However, Luffy seems to like the wax binding, and he dodges Mr. 3's attempt to lock his arms together as he wraps his arms around Dorry's sword impaled into Brogy's hand. Luffy apologizes to Brogy as he spins around, causing greater injury to the giant, but at the end of his spin he flies into the giant candle's pole and slams his candle binding into it, destroying both of them and causing the wax pumpkin on top to fall down.\nThe pumpkin misses Nami, Zoro, and Vivi, as Luffy did not realize they could not move. The wax encasement on their bodies increases, bringing them closer to complete suffocation, and Luffy works fast to destroy the giant candle. Mr. 3 attacks him with a wax harpoon, and Usopp tries to shoot an explosive bullet at him, but Mr. 5 swallows the shot, causing it to explode inside his body without dealing any harm. Luffy attempts to destroy the pumpkin, but Mr. 3 blocks his punches with a wall of wax. Luffy gets annoyed at Mr. 3, who uses Candle Lock again but only manages to encase one of Luffy's hands, and Luffy happily says that he has a hammer again. A perturbed Mr. 3 quickly tries to protect himself with a Candle Wall, but Luffy breaks through it and hits him, sending him flying far away. Nami tells Luffy to destroy the giant candle, but Luffy inexplicably refuses, saying that he does not feel like it. Miss Goldenweek then comes onto the scene, revealing that she is using \"Colors Trap\".\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Brogy",
    "Nefertari Vivi",
    "Karoo",
    "Mr. 3",
    "Miss Goldenweek",
    "Mr. 5",
    "Miss Valentine"
  ],
  "ssum_frequencies": [
    [
      "and",
      3
    ],
    [
      "to",
      3
    ],
    [
      "luffy",
      2
    ],
    [
      "mr",
      2
    ],
    [
      "doru",
      2
    ],
    [
      "him",
      2
    ],
    [
      "candle",
      2
    ],
    [
      "confronts",
      1
    ],
    [
      "3",
      1
    ],
    [
      "manages",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      16
    ],
    [
      "luffy",
      15
    ],
    [
      "and",
      14
    ],
    [
      "the",
      14
    ],
    [
      "he",
      11
    ],
    [
      "mr",
      10
    ],
    [
      "but",
      8
    ],
    [
      "candle",
      7
    ],
    [
      "his",
      7
    ],
    [
      "3",
      6
    ],
    [
      "a",
      6
    ],
    [
      "giant",
      5
    ],
    [
      "it",
      5
    ],
    [
      "of",
      5
    ],
    [
      "that",
      5
    ],
    [
      "wax",
      5
    ],
    [
      "at",
      4
    ],
    [
      "destroy",
      4
    ],
    [
      "zoro",
      4
    ],
    [
      "not",
      4
    ]
  ]
}