{
  "chapter_number": "Chapter 43",
  "title": "Introducing Sanji",
  "short_summary": "The Straw Hat Pirates arrive at the Baratie restaurant, where they come into conflict with the Marine Lieutenant Fullbody which results in Luffy indirectly damaging the nearby restaurant. While inside the Baratie, Fullbody attempts to impress his date, only for the Sous Chef serving them to make a fool out of the man. Meanwhile, Luffy tries to negotiate with the Head Chef about the damage inflicted upon his restaurant by the young boy. In an attempt to have revenge upon the waiter that embarrassed him, Fullbody fails and is left in a mangled state by said waiter.\n",
  "long_summary": "As the crew approaches the Baratie, a floating restaurant shaped like a fish, the Marine \"Iron Fist\" Fullbody appears to entertaining a young lady. Johnny and Yosaku hide as to not be seen while Johnny cries over loosing to the captain of a crew that has only existed for few days old. Fullbody acknowledges he knows who the bounty hunting pair are and insults them, they try to attack him but are pummeled for their efforts off-page. Luffy insults them for \"sucking\" at what they are. Fullbody gives them a warning he is off duty and will not defeat them this time, however if they are a problem again he will simply beat them.\nWhen Jonny fell to the ground, wanted posters flew out of his pocket, Nami picks one up and is suddenly distant. Despite what he said, Fullbody goes back on his word and decides to sink their ship. Luffy blows up like a balloon thanks to his Gomu Gomu no Mi powers and sends the cannonball back. However, he misses and hits the Baratie by mistake.\nInside, Fullbody and his date for the day are enjoying a meal, she notices all eyes are on him but he flatters her by saying all eyes are on her. He then drinks some wine and attempts to identify it asking for confirmation from the waiter, but the wine he ordered ahead of his date was not the wine he was given and the waiter turns out to be the sous chef, Sanji. Having being left red faced, Fullbody gets comments from his date.\nMeanwhile, Luffy is pulled up by Zeff the head chef. A deal is struck that Luffy must work for 1 year to repay his debt. Luffy's crew wonders where Luffy has got up to.\nFullbody attempts to get back at Sanji by putting a fly in the soup he was given. Sanji flirts with his date and when the insect is pointed out, Sanji passes it off and just says he is not an insect expert. With his date now laughing in his face, Fullbody smashes the table to the ground. Sanji just passes it off, saying he can take the insect off since its not important as Fullbody has finished his meal anyway. With his date screaming to stop, Fullbody goes to hit Sanji. The other chefs beg Sanji to not react. Fullbody is left bloodstained as Sanji beats his ideals as a chef into him. He passes a comment that he should not berate a chef in the middle of the sea as it is suicide.\n\n"
}