{
  "chapter_number": "Chapter 94",
  "title": "The Second",
  "short_summary": "Arlong Park is in ruins, but the citizens do not know who won the fight. Everybody is worried for Luffy's. When he appears at the top of the ruined building's roof everyone is filled with joy. The Arlong Pirates have been beaten, putting an end to eight long years of suffering. So when the Marine, Nezumi, makes his appearance and claims Arlong's money, the village becomes upset. Nami strikes him with her staff and tells him Arlong's money belongs to the villagers. Nezumi is forced out of the island but continues to threaten Luffy with revenge. Back at his base, he requests the Marine Headquarters to put Luffy on the Marine wanted list.\n",
  "long_summary": "Luffy destroys Arlong Park's roof and pieces of the building are scattered into the air. Zoro, who was sleeping, is struck and wonders what happened. Meanwhile at the foot of the building everyone wonders what happened inside and who won. Suddenly, Luffy emerges from the destruction to everyone's joy and then declares that Nami is his friend. Nami acknowledges his gesture.\nEverybody then celebrates the news of Arlong's defeat. However, they are soon interrupted by Nezumi, who thanks them for giving him an enjoyable fight to watch and then declares that all the riches of Arlong Park now belong to him. He then asks that everyone throw down their arms, but is interrupted by Zoro and then gets beaten up by the Straw Hat Crew. Nami then gives Luffy his straw hat back and attacks Nezumi as well. She tells him to give her back her money. Nezumi leaves and tells them that they will regret crossing him, while everyone continues to celebrate with Nami, Nojiko, and Genzo sitting by Belle-mère's grave. Back at Cocoyasi Village Dr. Nako is treating Zoro, who is in a lot of pain.\nLater at the Marine's 16th branch, Nezumi alerts Marine headquarters about the Straw Hat Crew.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Arlong (K.O)",
    "Nezumi",
    "Nojiko",
    "Genzo",
    "Nako",
    "Sam",
    "Yosaku",
    "Johnny"
  ],
  "ssum_frequencies": [
    [
      "the",
      11
    ],
    [
      "is",
      4
    ],
    [
      "to",
      4
    ],
    [
      "of",
      3
    ],
    [
      "with",
      3
    ],
    [
      "marine",
      3
    ],
    [
      "arlong",
      2
    ],
    [
      "but",
      2
    ],
    [
      "when",
      2
    ],
    [
      "he",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      10
    ],
    [
      "and",
      9
    ],
    [
      "then",
      6
    ],
    [
      "of",
      5
    ],
    [
      "is",
      5
    ],
    [
      "to",
      5
    ],
    [
      "who",
      4
    ],
    [
      "that",
      4
    ],
    [
      "nami",
      4
    ],
    [
      "by",
      4
    ],
    [
      "nezumi",
      4
    ],
    [
      "him",
      4
    ],
    [
      "luffy",
      3
    ],
    [
      "zoro",
      3
    ],
    [
      "at",
      3
    ],
    [
      "everyone",
      3
    ],
    [
      "his",
      3
    ],
    [
      "straw",
      3
    ],
    [
      "hat",
      3
    ],
    [
      "back",
      3
    ]
  ]
}