{
  "chapter_number": "Chapter 136",
  "title": "A Man Named Dalton",
  "short_summary": "Dalton attacks Wapol but is tricked by his good feelings. The lapahn, not able to catch Luffy and Sanji start an avalanche.\n",
  "long_summary": "Wapol threatens the inhabitants of Bighorn. he demands they accept him as their king once more. When he learns from his crewmates that the Straw Hats are nearby, he swears to get revenge. His men spot his castle is intact and that Dr. Kureha is living in it. Wapol is surprised and he decides to take it back and to take his revenge.\nHowever, his plan is halted by Dalton who has run towards his village. He delivers a critical hit Wapol. However, the former King has a highly skilled personal medical team, the Isshi-20. It is revealed that Wapol got rid of every doctor in Drum, beside the 20 best ones whom only works for him. Due to the medical notoriety of the town, when people could no longer get treatment due to the monopoly of medical services, the town was abandoned by the medical professionals.\nThis act of selfishness and the cowardice he has shown is unforgivable to Dalton. As he is about to attack Wapol again, Chess and Kuromarimo threaten they know him too well. They attack the citizens who had come to help Dalton. In order to protect the villagers, Dalton sacrifices himself and takes the arrows directly in his chest.\nMeanwhile, the angry lapahn chase Luffy and Sanji. But, they are unable to catch them and act strangely by jumping on the ground. Soon, a giant avalanche begins to rush down the mountain, putting everyone in danger.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Nami",
    "Usopp",
    "Sanji",
    "Wapol",
    "Chess",
    "Kuromarimo",
    "Isshi-20",
    "Robson",
    "Jango (cover)",
    "Dalton",
    "Nefertari Vivi"
  ],
  "ssum_frequencies": [
    [
      "dalton",
      1
    ],
    [
      "attacks",
      1
    ],
    [
      "wapol",
      1
    ],
    [
      "but",
      1
    ],
    [
      "is",
      1
    ],
    [
      "tricked",
      1
    ],
    [
      "by",
      1
    ],
    [
      "his",
      1
    ],
    [
      "good",
      1
    ],
    [
      "feelings",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      17
    ],
    [
      "to",
      11
    ],
    [
      "and",
      8
    ],
    [
      "he",
      7
    ],
    [
      "his",
      7
    ],
    [
      "is",
      7
    ],
    [
      "wapol",
      5
    ],
    [
      "of",
      5
    ],
    [
      "in",
      5
    ],
    [
      "they",
      4
    ],
    [
      "dalton",
      4
    ],
    [
      "medical",
      4
    ],
    [
      "him",
      3
    ],
    [
      "that",
      3
    ],
    [
      "it",
      3
    ],
    [
      "by",
      3
    ],
    [
      "has",
      3
    ],
    [
      "a",
      3
    ],
    [
      "as",
      2
    ],
    [
      "king",
      2
    ]
  ]
}