{
  "chapter_number": "Chapter 88",
  "title": "Die!!!",
  "short_summary": "Usopp defeats Chew. Nami starts heading to Arlong Park. Sanji and Zoro are having a hard time against Arlong. The fish-man tries to convince her to be his cartographer by blackmailing her with the villagers life, but Nami refuses. Luffy wakes up and Sanji starts swimming to free his legs, while Zoro keeps Arlong occupied. Usopp arrives and shoots Arlong to distract him. Hatchan begins to get up.\n",
  "long_summary": "The chapter begins right after Usopp lit Chew on fire. Chew begins to run towards the pool of water, but Usopp comes from behind and hits him with Usopp Hammer towards the water. As Chew begins to get up, Usopp strikes him again with Usopp Hammer three times, then with Usopp Wagomu, and then again with Usopp Hammer. Following this succession of attacks, Chew is K.O.ed and Usopp begins to celebrate his victory. He starts shouting that even he can do it, and that the fish-man shouldn't underestimate him.\nThe scene moves to Cocoyasi Village, behind Nami and Nojiko's house. Nami is sitting on a chair with her Bo-staff, bandaging her shoulder after she cut herself with a knife. Nami begins to think that she cried and complained enough and now she has to go to Arlong Park since everyone else is fighting.\nThe scene moves to Arlong Park, where Arlong is sitting in the middle of a scene in front of Zoro and Sanji knocked down on the ground. A citizen of Cocoyasi Village can't believe his eyes. Yosaku wonders what did Arlong do. Johnny mentions that the fish-man only threw some water, but this knocked down both Zoro and Sanji and had them cough up blood. Meanwhile, Luffy is still sitting on the sea floor, with Nojiko trying to pump water out of him, and with his head in Genzo's hands stretched just above the surface. One of Luffy's fingers starts to move. As Sanji begins to get up, Yosaku shouts to him not to stand up. Johnny is worried about Luffy's situation. Arlong mocks the two, saying that he doesn't even need to touch them and that a little water is enough to kill them. He comments that that is the difference between their species. Sanji tells him to shut up and attacks him with Poitrine Shoot, which Arlong easily evades and then attacks Sanji again with water, knocking him down. Sanji coughs up blood and thinks that fighting is only a game for the fish-man, and that water splashes feel like a shotgun blast. Sanji realizes that Arlong is on a whole other level. Arlong mocks Sanji again, saying that he should just die, and that he's life is worth nothing.\nThen, Nami appears, to everyone's surprise. Arlong tells her that he was about to kill the pirates, and asks her why did she come. Nami answers that she came in order to kill him. Arlong begins to laugh at this, commenting on the numerous times that she tried to kill him in the past 8 years: by assassination, poisoning, or surprise attacks. He then tells her that she should know that it's impossible for humans to kill him. Arlong follows, saying that he's not going to kill her or let her escape, and that she will be her cartographer forever.\nThe fish-man continues by commenting that he is an understanding guy, and that he doesn't want to chain a young woman if possible, so it would be better for him if Nami joined him out of her own will. He then makes Nami an offer: even though he's planning to kill everyone present, if Nami joins Arlong as his cartographer, he will spare the Cocoyasi Village citizens' lives, but he won't spare Sanji and Zoro because they made him angry. Arlong asks Nami if she chooses to side with him and spare the villagers, or if she sides with the pirates and attempt to fight him. He then comments that because their strongest fighters have been incapacitated, losing is inevitable. Arlong asks Nami again if she sides with him or with the pirates. Nami begins to think about what to choose, thinking that a single word from her can decide everyone's lives. She then remembers Luffy's words that he will save her. While the villagers get angry that Arlong is anyway forcing Nami to join him, Nami thinks that she can't doubt her friends' words. She then apologizes to all the villagers, and asks them if they would die with her. All the villagers scream in approval.\nThen Luffy woke up, shooting a jet of water out of his mouth. Sanji comments that the plan worked and that all they need to do is free Luffy's legs. Zoro realizes what the plan was. Johnny and Yosaku realize that Luffy is back. Genzo asks Luffy if he is awake. Zoro and Sanji get up and the swordsman tells the cook that he has 30 seconds, because he won't last more than that. Sanji then jumps into the water saying that that's more time than he needs. Arlong also realizes that Luffy is back. Zoro tells Arlong that he shouldn't pay attention to that, and calls him a half-fish mutant. The fish-man threatens Zoro, saying that he told him not to call him that again. Sanji is close to reaching Luffy.\nSuddenly, Usopp appears and shoots Arlong with Tamago Boshi. Usopp starts shouting that he will back Zoro. Johnny and Yosaku start wondering where the sniper is, commenting that he is brave. Usopp tells Zoro to fight without any worries, as everyone realizes that he was hiding in the hole in the wall made by Sanji earlier when he was hit by Kuroobi. Usopp happily tells Nami that he defeated one of the officers of the Arlong Pirates by himself. Genzo asks Luffy if he pulls himself out on his own, but Luffy answers that he can't feel any strength in his body. As Sanji almost reaches Luffy's body, he says to himself that he is counting on Luffy, their only hope. However, Hatchan starts to get up saying that he won't let them do as they please.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Usopp",
    "Sanji",
    "Arlong",
    "Hatchan",
    "Chew",
    "Ripper (cover)",
    "Koby (cover)",
    "Helmeppo (cover)",
    "Morgan (cover)",
    "Nojiko",
    "Genzo",
    "Nami",
    "Nako",
    "Yosaku",
    "Johnny"
  ],
  "ssum_frequencies": [
    [
      "to",
      6
    ],
    [
      "arlong",
      4
    ],
    [
      "and",
      3
    ],
    [
      "usopp",
      2
    ],
    [
      "nami",
      2
    ],
    [
      "starts",
      2
    ],
    [
      "sanji",
      2
    ],
    [
      "zoro",
      2
    ],
    [
      "the",
      2
    ],
    [
      "her",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "that",
      45
    ],
    [
      "to",
      38
    ],
    [
      "the",
      36
    ],
    [
      "and",
      31
    ],
    [
      "he",
      30
    ],
    [
      "is",
      22
    ],
    [
      "him",
      21
    ],
    [
      "arlong",
      19
    ],
    [
      "with",
      16
    ],
    [
      "sanji",
      15
    ],
    [
      "nami",
      14
    ],
    [
      "she",
      14
    ],
    [
      "her",
      13
    ],
    [
      "usopp",
      12
    ],
    [
      "of",
      12
    ],
    [
      "a",
      12
    ],
    [
      "then",
      11
    ],
    [
      "water",
      9
    ],
    [
      "up",
      9
    ],
    [
      "in",
      9
    ]
  ]
}