{
  "chapter_number": "Chapter 29",
  "title": "Hill Road",
  "short_summary": "Usopp arrives first to the other shore and tries to warn the Black Cat Pirates away with a bold lie. Not falling for it, they discover Nami's treasure and claim it as their own. Just as Usopp is about to be hypnotized Nami herself arrives and saves him. The pair are soon forced to fight for themselves while Luffy and Zoro still struggle to find the right shore. While distracted Usopp suffers a heavy blow to the head, however while unable to stand he continues to struggle against the invading pirates until Luffy and Zoro finally arrive.\n",
  "long_summary": "Usopp realizes he is in trouble, as he is the only one standing to face off against the Black Cat Pirates. Jango mistakes Usopp's lie about having a large number of pirates as the truth, much to the disbelief of the crew.\nThe Black Cat pirates find a ship with treasure on it next to theirs. Usopp comments on how it's his treasure and tries to bribe them into leaving for it, but Jango and the others just state they'll take it anyway and that they will not leave. As Jango pulls out his ring to hypnotize Usopp, Nami shows up and bashes him on the head for trying to give them her treasure meanwhile Jango has put himself to asleep (again). With no sign of Luffy, Nami tells Usopp to go fight the pirate while she supports him. As the Black Cats begin to advance forward, Usopp and Nami throw some caltrops at the pirates that Usopp brought along.\nBack at the other slope, Zoro lays on his back, tired from trying to get past the oil he slipped down. Finally he resorts to using his swords to climb up with. However he faces his next problem - he does not know which direction is north. Meanwhile Luffy is rushing around with no clue as to which direction is north either.\nBack at the slope, the caltrops are working and Usopp pulls out his slingshot to fire at the pirates. After taking out a few, Nami comments on how she thinks she will have a rest now, only to find some of the caltrops are behind them, which Usopp blames on her. As she turns around, she sights Usopp getting hit as the crew finally makes it up the slope.\nThe crew pass by him, Usopp grabs the leg of the man who hit him, claiming he will make sure the next day is as peaceful as the last for the village. As a pirate goes to kill Usopp, Nami finally steps in and knocks him away, but in turn is knocked away also. Jango orders the crew to just ignore the pair as they must get to the village before Kuro's plan goes wrong and Kuro kills them all. Usopp makes another attempt to stop the pirates; suddenly they are knocked away as Zoro and Luffy finally arrive.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Jango",
    "Usopp"
  ],
  "ssum_frequencies": [
    [
      "to",
      8
    ],
    [
      "the",
      6
    ],
    [
      "and",
      5
    ],
    [
      "usopp",
      3
    ],
    [
      "while",
      3
    ],
    [
      "arrives",
      2
    ],
    [
      "shore",
      2
    ],
    [
      "pirates",
      2
    ],
    [
      "a",
      2
    ],
    [
      "for",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      29
    ],
    [
      "to",
      19
    ],
    [
      "usopp",
      12
    ],
    [
      "as",
      12
    ],
    [
      "and",
      9
    ],
    [
      "he",
      7
    ],
    [
      "is",
      7
    ],
    [
      "pirates",
      6
    ],
    [
      "on",
      6
    ],
    [
      "his",
      6
    ],
    [
      "jango",
      5
    ],
    [
      "a",
      5
    ],
    [
      "of",
      5
    ],
    [
      "nami",
      5
    ],
    [
      "him",
      5
    ],
    [
      "she",
      5
    ],
    [
      "crew",
      4
    ],
    [
      "with",
      4
    ],
    [
      "it",
      4
    ],
    [
      "them",
      4
    ]
  ]
}