{
  "chapter_number": "Chapter 185",
  "title": "Oh... Is That So?",
  "short_summary": "Usopp's 5 ton hammer was in reality a fake one and Mr. 4 recovers quickly from it. When Miss Merry Christmas realizes she had been fooled, she became enraged and starts to beat Usopp badly by making him crash into several walls with her Mogurazuka Highway attack. Chopper then decided to eat a Rumble Ball, in Brain Point mode, he discovered that the tunnels are all connected. By making Lassoo fire balls directly into the tunnels, the two Baroque Works agents are taken into a gigantic explosion.\n",
  "long_summary": "Usopp is hitting Mr. 4 and Miss Merry Christmas with a fake 5 ton hammer which is actually a paper mache hammer weighing approximately 4.4 lbs. Mr.4 easily (but slowly) recovers from being hit by the hammer after Usopp hits him. Usopp then charges Miss Merry Christmas with the hammer and attempts to hit her. Miss Merry Christmas burrows in and out of holes to dodge the hammer very similar to the arcade game \"Whack a Mole\". Usopp then stops to catch his breath, also telling tall tales to Miss Merry Christmas about how great he is, though Chopper full heartedly believes him and is amazed. Miss Merry Christmas grows tired of the game, and claws her way to Usopp, and then violently claws him across the face knocking him backwards. She then yells at Lassoo to take out the reindeer-man. Lassoo fires a gigantic amount of balls, which Mr. 4 hits at Chopper, causing another explosion. Miss Merry Christmas then begins to chase Usopp. Usopp notices there are short walls around which he decides to run over, hoping that Miss Merry Christmas will run directly into the wall. Miss Merry Christmas does run into the wall, but instead of getting injured, she easily takes out the wall. She then grabs Usopp and starts dragging him, bashing him through the walls too. After a while, Chopper finally figures out that their weakness is that all the tunnels Miss Merry Christmas dug are connected. Chopper takes advantage of this by pointing Lassoo's head into a tunnel, causing him to fire repeatedly. Usopp and Chopper then bolt out of the scene, and since all the tunnels are connected, the balls Lassoo fired into them cause a mass explosion all around the tunnels.\n\n",
  "characters": [
    "Usopp",
    "Tony Tony Chopper",
    "Hatchan (cover)",
    "Mr. 4",
    "Miss Merry Christmas",
    "Lassoo",
    "Panda Shark (cover)"
  ],
  "ssum_frequencies": [
    [
      "a",
      3
    ],
    [
      "into",
      3
    ],
    [
      "the",
      3
    ],
    [
      "in",
      2
    ],
    [
      "and",
      2
    ],
    [
      "she",
      2
    ],
    [
      "to",
      2
    ],
    [
      "by",
      2
    ],
    [
      "making",
      2
    ],
    [
      "tunnels",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      16
    ],
    [
      "to",
      10
    ],
    [
      "usopp",
      9
    ],
    [
      "and",
      9
    ],
    [
      "miss",
      9
    ],
    [
      "merry",
      9
    ],
    [
      "christmas",
      9
    ],
    [
      "a",
      7
    ],
    [
      "him",
      7
    ],
    [
      "then",
      7
    ],
    [
      "of",
      6
    ],
    [
      "is",
      5
    ],
    [
      "hammer",
      5
    ],
    [
      "out",
      5
    ],
    [
      "chopper",
      5
    ],
    [
      "into",
      4
    ],
    [
      "which",
      3
    ],
    [
      "she",
      3
    ],
    [
      "lassoo",
      3
    ],
    [
      "are",
      3
    ]
  ]
}