{
  "chapter_number": "Chapter 176",
  "title": "Rush!!",
  "short_summary": "Mr. 3, who had survived in the bananawani's stomach by putting himself into a wax ball, is ejected out thanks to Sanji's kick. Thanks to Mr. 3's power, they are able to force him to create a key that opens the cell's door. When they are about to escape the room, the room collapses, but everyone manages to swim to the surface safely, even Smoker who is carried by Zoro. When the marine asks the swordsman about the reason of his actions, Zoro tells him it was an order from Luffy. Annoyed by the Straw Hat captain's illogical behavior, Smoker does not arrest them. Instead he asks his men to call for marine reinforcements. When escaping, the Straw Hat Pirates are rejoined by Chopper riding a giant crab.\n",
  "long_summary": "A bananawani just spat out a wax ball, while the Straw Hats wonder what it is, Mr. 3 then appears from the inside of the ball, overjoyed at his freedom which surprises everyone. He then notices a key attached to his ball, to which the straw hats shout that it is the key to their cage, Sanji then demands that he hand it over, which just makes him throw it away. Sanji, angered at this prepares to attack, but it stopped by Usopp who reasons that Mr. 3 could just create another key using his powers, Sanji then forced Mr. 3 to make another key to free his friends, which he does. After freeing everyone Sanji says that they have to get out quick, but Vivi says that will be hard with all the bananawani, but much to her shock they are already defeated. Unfortunately the walls then break and water gets through, though luckily the straw hats are able to get out alive, as well as Smoker who was saved by Zoro on Luffy's orders. Vivi then asks Nami to put on her perfume, while the Marines found the straw hats and rushed over to capture them, while Smoker decided to let them go. The straw hats then run away, while Smoker calls the marines back and asks one to call in more reinforcements, meanwhile Chopper has found Nami's scent and located the straw hats while riding on top a giant crab. The crew gets on as Chopper explains that the crab is one of Matsuge's friends, suddenly Vivi is grabbed by Crocodile's hook, but Luffy is able to unhook her and grabs on himself, telling the crew to go on without him as he prepares to fight Crocodile.\n\n"
}