{
  "chapter_number": "Chapter 69",
  "title": "Arlong Park",
  "short_summary": "Yosaku explains to Luffy and Sanji about the Seven Warlords of the Sea. Meanwhile, Nezumi, a corrupt Marine officer, pays a visit to Arlong and his pirate crew.\n",
  "long_summary": "Luffy looks forward to entering the Grand Line with newest Straw Hat Pirate, Sanji. However, Yosaku warns them about the dangers of this sea. In particular he warns them of the presence of the Seven Warlords of the Sea, of which Dracule Mihawk and a fish-man pirate named Jinbe belong. He explains that years ago Jinbe had a relation with his strongest lieutenant in the East Blue, Arlong. He suspects that Nami will be near Arlong. Sanji has his doubts as he always trusts beautiful woman and had recently become smitten with Nami. Yosaku mentions that due to Nami's suspicious behavior being connected to their copy of Arlong's wanted poster, he and Johnny suspected earlier that there had to be a connection between Nami and Arlong.\nMeanwhile in Arlong Park, base of Arlong's Fish-Men pirates, Arlong makes a deal with a Marine, Nezumi. He presses Nezumi to relax and celebrate in the common language that they understand, money. However, Nezumi tells him he must press on before anyone recognizes his ship in port. Suddenly, Nami is introduced as one of the Arlong pirate officers and the only human Arlong can trust.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Usopp",
    "Sanji",
    "Dracule Mihawk (image)",
    "Arlong",
    "Hatchan",
    "Chew",
    "Kuroobi",
    "Nami",
    "Nezumi",
    "Chabo",
    "Yosaku",
    "Johnny"
  ],
  "ssum_frequencies": [
    [
      "to",
      2
    ],
    [
      "and",
      2
    ],
    [
      "the",
      2
    ],
    [
      "a",
      2
    ],
    [
      "yosaku",
      1
    ],
    [
      "explains",
      1
    ],
    [
      "luffy",
      1
    ],
    [
      "sanji",
      1
    ],
    [
      "about",
      1
    ],
    [
      "seven",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      9
    ],
    [
      "of",
      8
    ],
    [
      "he",
      7
    ],
    [
      "arlong",
      7
    ],
    [
      "and",
      6
    ],
    [
      "to",
      5
    ],
    [
      "in",
      5
    ],
    [
      "a",
      5
    ],
    [
      "that",
      5
    ],
    [
      "with",
      4
    ],
    [
      "nami",
      4
    ],
    [
      "pirate",
      3
    ],
    [
      "had",
      3
    ],
    [
      "his",
      3
    ],
    [
      "nezumi",
      3
    ],
    [
      "sanji",
      2
    ],
    [
      "however",
      2
    ],
    [
      "yosaku",
      2
    ],
    [
      "warns",
      2
    ],
    [
      "them",
      2
    ]
  ]
}