{
  "chapter_number": "Chapter 38",
  "title": "Pirate Crew",
  "short_summary": "Kuro, laying on the ground after Luffy's punch, stands up and is cheered on by his crew. Kuro lashes out at them, saying that he is going to kill everyone, even Jango, once he is done. In the forest, Jango is trying to hypnotize Kaya when he is ambushed by the Usopp Pirates. Jango fights back, but the noise brings Zoro and Usopp running. Meanwhile, Kuro continues about how his crew must die in order for his plan to be complete. Luffy punches him again and insults him, causing Kuro to unleash a technique that makes him attack everything indiscriminately.\n",
  "long_summary": "On the coastline, Kuro lays flat on his chest after Luffy has broken one of his Cat Claws. He gets up, the Black Cat Pirates encourage Kuro to kill Luffy and call his real name and not his fake name, which they remember that he told them not to call him Kuro. Kuro tells them to shut up, he already plans to kill the crew, including Jango once his plan is successful.\nBack in the forest, Jango is having a hard time trying to hypnotize Kaya. She refuses to open her eyes. The Usopp Pirates (minus Usopp) lay pretending to be asleep having already been hypnotized themselves. When she refuses, he tries to force them open, the Usopp Pirates then attack, throwing pepper in his eyes and kicking him in the groin. When Jango recovers, Kaya and the others have departed. As Jango wanders through the forest, looking for them, they ambush him. Zoro and Usopp hear their voices in the forest and go to check out the noise. The Usopp Pirates continue their attack on Jango, who throws Onion into a tree as he fights back.\nBack at the coastline, Kuro explains things would be more realistic if a few of the crew died here and that he planned on not letting any of his crew live in the beginning. In order to wipe out the name of Kuro, not only must his plan succeed, but his crew must die also so there is no one left who knows he is still alive. As Luffy speaks his mind about Kuro's ideas, Kuro return says more about the opinions of his own crew saying that in a true pirate fleet, all the member are pawns for the captain and should always follow orders no matter the sacrifice. Luffy states Kuro cannot beat Usopp even with the number of crew members he has. Kuro, humored by the thought, asks why to which Luffy replies its the way Kuro thinks. After punching Kuro, Luffy then states that he does not know what being a true pirate is.\nAfter Luffy's hit and remark, Kuro tells Luffy he had insulted him and states he will show him about what being a pirate is. Kuro does a strange stance, seeing it makes the other Black Cat Pirates panic. They each beg him not to use that move while a clueless Luffy watches on.\nOn board the Black Cat Pirates' ship, Nami with the crews treasure, watches, wondering if the fight is over. Suddenly the crew begins to be cut up, which Luffy cannot figure out how Kuro got past him so fast. The crew state that Kuro will not stop this technique until he grows tired and there is no use trying to talk him out of it. Luffy is angered at the sight of Kuro cutting up his own crew, much to the amazement of Nami.\n\n"
}