{
  "chapter_number": "Chapter 105",
  "title": "Log Pose",
  "short_summary": "Crocus tells Nami about the Log Pose and how the Straw Hats will need it to navigate through the Grand Line. Luffy acquires a Log Pose that Mr. 9 and Miss Wednesday left on their ship, but breaks it while fighting with Sanji; however, Crocus gives them another one out of gratitude to them. With their Log Pose lost, Mr. 9 and Miss Wednesday can no longer get to Whisky Peak and report to their boss. They plea for the Straw Hats to take them to Whisky Peak, and the crew reluctantly agrees to set sail for there.\n",
  "long_summary": "Luffy finishes painting his crew's Jolly Roger on Laboon's forehead as a symbol of his promise to come back and fight the whale again. Meanwhile, Nami charts out the navigation route, Sanji prepares some fish for cooking, and Usopp tries to make repairs on the Going Merry while Zoro sleeps. Suddenly, Nami screams, and as the crew takes a break to eat, she reveals that her compass is spinning around all over the place. Crocus is surprised at their lack of knowledge of the Grand Line, and reveals that the presence of minerals on the islands affects the ocean's magnetic fields. Not only that, but the winds are very unpredictable. He states that they will need a Log Pose, which is a special type of compass that records the magnetic field. Luffy ends up having one, to Nami's surprise, and he reveals that Mr. 9 and Miss Wednesday had left it on their ship.\nCrocus states that with the Log Pose, they will have to record the magnetic field interaction while on each island before they can move on to the next. There are seven possible magnetic field paths they could travel down, with each one of them leading to Laugh Tale, the legendary island at the end of the Grand Line. Usopp wonders if One Piece is located on Laugh Tale, and Crocus states that it is likely, but not confirmed. Luffy ends up eating all of the food Sanji made, and he kicks Luffy for eating the food he made specifically for Nami. However, he unwittingly sends Luffy slamming into the Log Pose, destroying it. Nami kicks Luffy and Sanji into the ocean and wonders what they are going to do now, but Crocus says he will give them one out of thanks for helping Laboon.\nMeanwhile, Mr. 9 and Miss Wednesday spy on the Straw Hats, confirming that they had left their Log Pose with the crew. Without it, they could not return to their town, and would face the wrath of their boss if they fail to report. They prepare to take it by force when the Unluckies, Mr. 13 the sea otter and Miss Friday the vulture, come flying in. Mr. 9 and Miss Wednesday desperately attempt to make excuses, but the Unluckies drop a package-shaped bomb onto them, blowing them into the ocean. They come back up to shore at the same time and place as Luffy and Sanji, and Mr. 9 requests for the Straw Hats to take them to Whisky Peak. The Straw Hats are suspicious of them and want to learn more, but they assert that their organization necessitates their secrecy, offering to pay them back if the Straw Hats help them. Nami mentions that they had broken the Log Pose they had stolen from them, stunning them, before reassuring them about the one Crocus gave them. Crocus cautions them about choosing to go to Whisky Peak and its route, but the Straw Hats are confident as they say farewell to him and Laboon. As he watches them go off, Crocus wonders to Roger if these are the pirates they were waiting for.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Morgan (cover)",
    "Crocus",
    "Mr. 9",
    "Miss Wednesday",
    "Mr. 13",
    "Miss Friday",
    "Laboon"
  ],
  "ssum_frequencies": [
    [
      "to",
      7
    ],
    [
      "the",
      5
    ],
    [
      "and",
      5
    ],
    [
      "log",
      3
    ],
    [
      "pose",
      3
    ],
    [
      "their",
      3
    ],
    [
      "them",
      3
    ],
    [
      "crocus",
      2
    ],
    [
      "straw",
      2
    ],
    [
      "hats",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      37
    ],
    [
      "to",
      21
    ],
    [
      "and",
      20
    ],
    [
      "they",
      15
    ],
    [
      "them",
      14
    ],
    [
      "of",
      11
    ],
    [
      "that",
      11
    ],
    [
      "on",
      8
    ],
    [
      "luffy",
      7
    ],
    [
      "crocus",
      7
    ],
    [
      "their",
      7
    ],
    [
      "he",
      7
    ],
    [
      "for",
      6
    ],
    [
      "but",
      6
    ],
    [
      "are",
      6
    ],
    [
      "as",
      5
    ],
    [
      "a",
      5
    ],
    [
      "nami",
      5
    ],
    [
      "is",
      5
    ],
    [
      "log",
      5
    ]
  ]
}