{
  "chapter_number": "Chapter 127",
  "title": "Den Den Mushi",
  "short_summary": "Dorry regains consciousness, with Brogy's strike having only knocked him out. Meanwhile, Sanji receives a call from Sir Crocodile of the Seven Warlords of the Sea, who is the leader of Baroque Works under the codename Mr. 0. Sanji impersonates Mr. 3 and lies that he eliminated the Straw Hats and Vivi, and Crocodile sends the Unluckies to give Sanji an Eternal Pose leading to Arabasta. Sanji defeats the Unluckies, but Crocodile tells Miss All Sunday to send Mr. 2 to assassinate Mr. 3 on his way to Arabasta.\n",
  "long_summary": "Brogy weeps over the loss of Dorry, causing a deluge of tears to spill onto the ground. However, Dorry then sits up, having only been knocked out by Brogy's strike. They guess this was likely due to their weapons having been severely dulled by their century-long clash. Brogy tearfully embraces Dorry, but after exchanging a few words, the two giants almost get into another fight, appalling Nami.\nMeanwhile, after finding out that Mr. 0 is calling him, Sanji recalls Vivi's words and realizes that he is speaking to Sir Crocodile of the Seven Warlords of the Sea. Thinking Sanji is Mr. 3, Crocodile orders him to give him a status report. Sanji deduces that Mr. 3 was sent to go after Vivi and pretends to be Mr. 3, telling Crocodile that Vivi and the Straw Hats have been eliminated. Crocodile says that the Unluckies will arrive to give him a package containing an Eternal Pose to Arabasta. He tells Sanji to come to him there with Miss Goldenweek, as it is time for them to carry out the most crucial step of their plan. Right then, the Unluckies show up at Mr. 3's house, and upon realizing what had happened, they prepare to attack Sanji. He panics momentarily as he dodges Miss Friday's bullets and Mr. 13's blades, but he quickly defeats Mr. 13 by kicking him backwards into a wall. He then jumps up to Miss Friday, dodging her shots as he catches her head between his feet and slams her into the ground.\nHearing the fighting, Crocodile asks what is going on, and Sanji lies that one of the Straw Hats had unexpectedly survived but he finished them off. Crocodile dehydrates a flower he is holding as he expresses anger that Sanji's initial report was false. Sanji assures him that there is no longer any issue. Crocodile says that this will be the last time he contacts Mr. 3 through Den Den Mushi as he hangs up. Immediately afterwards, he tells Miss All Sunday to have Mr. 2 lie in wait between Little Garden and Arabasta to assassinate Mr. 3. As he examines the unconscious Unluckies, Sanji spots the Eternal Pose to Arabasta. Meanwhile, on Smoker's ship, some Marines report to Smoker that they have intercepted a peculiar call.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Sanji",
    "Jango (cover)",
    "Dorry",
    "Brogy",
    "Nefertari Vivi",
    "Karoo",
    "Smoker (voice only)",
    "Crocodile",
    "Miss All Sunday",
    "Mr. 13",
    "Miss Friday"
  ],
  "ssum_frequencies": [
    [
      "the",
      7
    ],
    [
      "to",
      5
    ],
    [
      "sanji",
      4
    ],
    [
      "mr",
      4
    ],
    [
      "crocodile",
      3
    ],
    [
      "of",
      3
    ],
    [
      "and",
      3
    ],
    [
      "3",
      2
    ],
    [
      "unluckies",
      2
    ],
    [
      "arabasta",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      17
    ],
    [
      "the",
      15
    ],
    [
      "he",
      14
    ],
    [
      "that",
      10
    ],
    [
      "mr",
      10
    ],
    [
      "sanji",
      8
    ],
    [
      "and",
      8
    ],
    [
      "a",
      7
    ],
    [
      "is",
      7
    ],
    [
      "him",
      7
    ],
    [
      "crocodile",
      7
    ],
    [
      "of",
      6
    ],
    [
      "as",
      6
    ],
    [
      "3",
      5
    ],
    [
      "up",
      4
    ],
    [
      "miss",
      4
    ],
    [
      "dorry",
      3
    ],
    [
      "then",
      3
    ],
    [
      "been",
      3
    ],
    [
      "out",
      3
    ]
  ]
}