{
  "chapter_number": "Chapter 12",
  "title": "Dog",
  "short_summary": "After escaping the Buggy Pirates, Zoro and Luffy rest in the middle of a street where the only inhabitant is a weird dog. While Nami comes back with the key for Luffy's cage as thanks for saving her life, the dog eats the key. Mohji, Buggy's vice captain, then appears to kill Zoro. With his lion Richie, he attacks the defenseless Luffy and destroys the cage in the process, freeing Luffy.\n",
  "long_summary": "Buggy gloats about his reputation as a pirate in front of his crew. He orders them to find Luffy, Nami, and Zoro no matter what. Mohji arrives riding Richie and asks Buggy if he could take Zoro out. Buggy replies that he does not mind.\nElsewhere, Zoro is still carrying Luffy in a cage. Suddenly, he collapses to the ground out of exhaustion. The pair notice there is a dog sitting staring at them. Luffy comments about how the dog is sitting so still that you cannot tell if he is real or not, before provoking the dog into biting him when he pokes him in the head. Nami shows up and explains to them that they will likely be found if they remain in the middle of the road. Nami throws a key to the cage in front of Luffy, but before he can grab it the dog eats the key. Luffy attempts to strangle the dog in anger. The mayor of the town Boodle shows up, demanding that they stop hurting the dog, Chouchou.\nBoodle takes them to his house to rest, and explains why the dog is sitting where he is. He feeds him every day, and he is guarding his owner's pet store. Ten years ago, the mayor's friend and Chouchou's owner opened the store. Chouchou's owner went into hospital three months ago and never returned, leaving Chouchou behind to guard the store. Chouchou is covered in wounds from fighting the pirates: he is aware his owner will not be coming back, but he still guards the store because it is his treasure. Boodle talks about leaving the dog and moving away, but he admits he has changed his mind many times.\nJust then, they hear the roar of Richie the lion. Boodle and Nami run away, leaving Chouchou, Luffy and Zoro behind. When Mohji and Richie arrive, they find Luffy still in his cage. Luffy mocks Mohji's hairstyle, provoking him. Mohji boasts about being such a good animal trainer that every animal follows his orders, but Chouchou bites him anyway. When Richie pounces on the cage to finish Luffy, he frees Luffy instead.\nAs the pair prepare to leave, not noticing that Luffy is still alive, Richie smells the food inside the Pet Store, and Mohji tells Richie that he can eat the food.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Buggy",
    "Mohji",
    "Richie",
    "Acrobatic Fuwas",
    "Nami",
    "Boodle",
    "Chouchou",
    "Hocker (flashback)"
  ],
  "ssum_frequencies": [
    [
      "the",
      9
    ],
    [
      "luffy",
      3
    ],
    [
      "zoro",
      2
    ],
    [
      "and",
      2
    ],
    [
      "in",
      2
    ],
    [
      "a",
      2
    ],
    [
      "dog",
      2
    ],
    [
      "with",
      2
    ],
    [
      "key",
      2
    ],
    [
      "for",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      28
    ],
    [
      "he",
      16
    ],
    [
      "and",
      12
    ],
    [
      "luffy",
      11
    ],
    [
      "is",
      11
    ],
    [
      "to",
      10
    ],
    [
      "his",
      9
    ],
    [
      "in",
      8
    ],
    [
      "dog",
      8
    ],
    [
      "that",
      7
    ],
    [
      "of",
      6
    ],
    [
      "richie",
      6
    ],
    [
      "a",
      5
    ],
    [
      "still",
      5
    ],
    [
      "him",
      5
    ],
    [
      "they",
      5
    ],
    [
      "chouchou",
      5
    ],
    [
      "store",
      5
    ],
    [
      "about",
      4
    ],
    [
      "them",
      4
    ]
  ]
}