{
  "chapter_number": "Chapter 198",
  "title": "4:15 PM",
  "short_summary": "Koza has been shot by a fake royal guard, who is actually a member of the Baroque Works. As a result, the fight between the rebels and the royal army starts. Vivi, unable to stop them and is captured by Crocodile who is about to kill her. Suddenly hope is coming from the sky with Luffy riding on a falcon.\n",
  "long_summary": "As Koza has been shot by Baroque Works members disguised as royal army members, a member of the royal army confronts them, not knowing they are spies, and demands to know why they shot Koza. Crocodile then creates sand in between the royal army and rebel army, obscuring both sides' eyesight. More royal army members are shot, revealing that Baroque Works members infiltrated both sides to make sure they continue fighting. Ignoring Vivi's and Koza's pleas to stop fighting, the rebel and royal army engage each other yet again. Miss All Sunday praises Vivi's determination, however she comments that Vivi's voice cannot reach them now. Vivi declines Cobra's demand to escape from Crocodile, confronting the Warlord and telling him that she still can save lives if she prevents the explosion 15 minutes from now. Grabbing Vivi's throat, Crocodile mocks her, saying that idealism can only be brought to realize by people with the ability to physically make it happen. Crocodile criticizes Vivi's decision of not telling the rebels about the explosion in 15 minutes, commenting that even though there would be panic, she would at least be able to save a few thousand lives. Crocodile then praises Vivi's hard work the past 2 years by spying on his organization from the inside, however he boldly tells her that she cannot save this country.\nAs he drops her off the palace wall, a flying figure arrives, much to the shock of Crocodile, who notices Luffy riding on top of the flying figure, having survived the previous confrontation. While Luffy yells out Crocodile's name in anger, Crocodile shows visible annoyance that Luffy has returned, while Vivi is relieved.\n\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro (cover)",
    "Nami (cover)",
    "Usopp (cover)",
    "Sanji (cover)",
    "Tony Tony Chopper (cover)",
    "Nefertari Cobra",
    "Nefertari Vivi",
    "Igaram (flashback)",
    "Chaka (K.O)",
    "Pell",
    "Koza",
    "Hyota (K.O)",
    "Brahm (K.O)",
    "Arrow (K.O)",
    "Barrel (K.O)",
    "Erik",
    "Farafra",
    "Toto (flashback)",
    "Crocodile",
    "Nico Robin",
    "Karoo (cover)"
  ],
  "ssum_frequencies": [
    [
      "the",
      5
    ],
    [
      "a",
      4
    ],
    [
      "is",
      4
    ],
    [
      "by",
      2
    ],
    [
      "royal",
      2
    ],
    [
      "who",
      2
    ],
    [
      "and",
      2
    ],
    [
      "to",
      2
    ],
    [
      "koza",
      1
    ],
    [
      "has",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      14
    ],
    [
      "to",
      8
    ],
    [
      "crocodile",
      7
    ],
    [
      "that",
      7
    ],
    [
      "army",
      6
    ],
    [
      "vivis",
      6
    ],
    [
      "royal",
      5
    ],
    [
      "and",
      5
    ],
    [
      "she",
      5
    ],
    [
      "members",
      4
    ],
    [
      "of",
      4
    ],
    [
      "as",
      3
    ],
    [
      "shot",
      3
    ],
    [
      "by",
      3
    ],
    [
      "a",
      3
    ],
    [
      "they",
      3
    ],
    [
      "in",
      3
    ],
    [
      "from",
      3
    ],
    [
      "save",
      3
    ],
    [
      "her",
      3
    ]
  ]
}