{
  "chapter_number": "Chapter 86",
  "title": "Chivalry vs. Fish-Man Karate",
  "short_summary": "Sanji goes underwater to free Luffy from his concrete encasement, noticing that Genzo and Nojiko are trying to resuscitate him by pulling his neck above water. However, Kuroobi chases Sanji underwater and overpowers him with Fish-Man Karate attacks. Before Sanji can be finished off, however, he covers Kuroobi's gills and returns to the shore, where Kuroobi confronts him. On land, Sanji is able to assault Kuroobi with several attacks before ultimately finishing him off with Mouton Shot.\n",
  "long_summary": "With Zoro having defeated Hatchan and Sanji confronting Kuroobi, Zoro prepares to go underwater and rescue Luffy. Sanji says that Zoro will die from his injuries underwater, but Zoro replies that they have no time left, causing Sanji to jump in instead. Zoro is horrified as Kuroobi gleefully looks forward to fighting in his natural element, jumping into the water to go after Sanji. As Sanji goes down, he sees Genzo pumping Luffy's chest, and Luffy's neck is stretched to the shore, bringing his head above water as Nojiko holds it there. Luffy coughs up some of the water he swallowed, making Nojiko hopeful, and Sanji knows that all he has to do is break the rock Luffy's feet are encased in and free him. However, Kuroobi suddenly catches up to Sanji and strikes the back of his neck, and he then sees Genzo with Luffy, causing him to go after the villager. Sanji grabs Kuroobi's legs and holds him back, and Kuroobi is enthused by Sanji challenging him in an environment where he is not only much stronger, but Sanji is weakened by not being able to breathe.\nKuroobi wraps Sanji in his ponytail, and Sanji tries kicking him, but the power of the kick has been reduced by half and Kuroobi easily dodges it. In contrast, Kuroobi's attacks are unaffected and even sometimes strengthened, and he lands multiple powerful strikes on Sanji. After the assault, Sanji desperately tries to swim up to breathe, but Kuroobi smugly blocks him. Kuroobi mocks Sanji's chivalry, saying that this is how far it got him and that once he died, Kuroobi would kill all of his friends and allies, meaning he could not save a single person. Kuroobi then grabs Sanji by the neck and prepares to drag him to the sea floor very quickly; the sudden change in water pressure will rupture Sanji's organs. Sanji coughs blood when he is brought to the sea floor, and on land, the Cocoyasi villagers wonder in concern about the statuses of Sanji, Genzo, and Nojiko.\nSanji remains alive after the sudden change in pressure, and he points upward. Kuroobi decides to do this again, and swims back up towards the top. Knowing that fish-men breathed through their gills underwater, Sanji bites Kuroobi's gills, blocking them and causing him to suffocate. Sanji is freed from Kuroobi's grasp and comes back up for air, shocking Zoro and Arlong. He tells Zoro that Luffy is sort of fine, and tells Kuroobi to come up so he can kill him. Kuroobi comes up, and thinks nothing of fighting on land, as he is confident that he will still overpower Sanji and kill him with his ultimate attack. However, Sanji quickly barrages Kuroobi with powerful kicks, and a stunned Kuroobi quickly tries to use his ultimate attack, but Sanji finishes him off with Mouton Shot, asking him if he wants any dessert as he flies away.\n\n",
  "characters": [
    "Monkey D. Luffy (K.O)",
    "Roronoa Zoro",
    "Sanji",
    "Arlong",
    "Hatchan (K.O)",
    "Kuroobi",
    "Nami (cover)",
    "Nojiko",
    "Genzo",
    "Yosaku",
    "Johnny"
  ],
  "ssum_frequencies": [
    [
      "sanji",
      4
    ],
    [
      "to",
      4
    ],
    [
      "him",
      4
    ],
    [
      "and",
      3
    ],
    [
      "kuroobi",
      3
    ],
    [
      "with",
      3
    ],
    [
      "underwater",
      2
    ],
    [
      "his",
      2
    ],
    [
      "however",
      2
    ],
    [
      "attacks",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "and",
      27
    ],
    [
      "sanji",
      23
    ],
    [
      "to",
      18
    ],
    [
      "the",
      17
    ],
    [
      "he",
      16
    ],
    [
      "kuroobi",
      15
    ],
    [
      "him",
      13
    ],
    [
      "is",
      11
    ],
    [
      "in",
      9
    ],
    [
      "that",
      8
    ],
    [
      "his",
      8
    ],
    [
      "zoro",
      7
    ],
    [
      "up",
      7
    ],
    [
      "of",
      7
    ],
    [
      "with",
      5
    ],
    [
      "but",
      5
    ],
    [
      "as",
      5
    ],
    [
      "luffy",
      4
    ],
    [
      "water",
      4
    ],
    [
      "after",
      4
    ]
  ]
}