{
  "chapter_number": "Episode 175",
  "title": "Chance of Survival: 0%!! Chopper vs Priest Ohm",
  "short_summary": "Priest Ohm appears and tries to kill Chopper. The South Bird takes Zoro on a trip through the sky. Luffy beats Nola up from the inside resulting in Nola chasing Nami and Aisa into the forest. Wyper begins the ascent of Giant Jack, along with Gan Fall, Zoro, and Nola.\n",
  "long_summary": "Chopper has reached higher up on Giant Jack. While walking through the ruins, he felt a presence and found it was Holy. Ohm told Chopper not to worry as Holy would not bite him unless he has reason to do so because the dog is well trained by him. Ohm recognized Chopper as the one who defeated Gedatsu. Chopper tried retreating only to step over a person. He thought Holy must have bit the person down however, Ohm told Chopper he was the one that defeated the individual. Ohm began mourning the person he killed saying he is unable to understand why humans fight even when they are so weak, and that death is the only way for them to be truly saved. Ohm told Chopper that by being present, a fight is inevitable and that he would \"save\" Chopper.\nRaki is seen traveling down the Milky Road and wondering why everyone appeared to have been burnt to a crisp, like being hit by lightning. She found Kamakiri who told her to find Wyper and notify him that Enel is not at the God's Shrine and that no one can beat Enel. Kamakiri told Raki that Enel is what is known as lightning, hence making him invincible. Raki left to find Wyper and commented on her way how Kamakiri's spirit has been broken asking herself how Enel ended up having the Goro Goro no Mi.\nZoro got to the place that appeared to be the sacrificial altar and realized it is a place he has seen before. The giant South Bird is still with him and he blamed it on the bird for wanting a free meal. He threw his bag aside and the bird, on seeing the bag imagined food to be in it and drooled. The bird picked the bag and Zoro hung onto the straps, yelling to the bird that there is no food in the bag. Luffy reached a dead end and thought of it as being a trick door. He thought breaking through it will make a way out and then attacked it with Gomu Gomu no Bazooka. However, nothing occurred-only a rumbling that sent Luffy falling further in. Chopper is seen running from Ohm in fear and came to a hiding spot. He commented on Ohm being a swordsman and by keeping his distance he can escape and find the others. Ohm, however, realized how far Chopper ran and stated that Chopper has an earthly desire which is an attachment to life. With that, Ohm defeated Chopper, stating a 0% survival rate at the Ordeal of Iron.\nAisa commented to the rest that another voice has disappeared and she is going in search of Raki. Nami went after her to bring her back when they saw the giant python. Luffy, upset about the \"cave\", began attacking it, causing the giant python to be in distress and act out. Nami and Aisa, aboard the waver fled into the forest to escape the giant python. On getting further into the forest, Nami realizes how far they have both fled. Zoro is seen telling the South Bird to let him down otherwise he would clip its wings. At this point, Nola came charging at them. The South Bird then thought the snake is after Zoro as the snake must have seen Zoro as a meal. The bird then released Zoro and the backpack. Wyper has reached Giant Jack, going after Enel.\nOhm stopped Wyper asking him who permitted him to climb the giant stalk. Gan Fall then appeared and told Wyper that he just returned from the God Shrine and the place has been completely destroyed. Just then, Zoro fell from the sky and saw that he was not alone. He recognized the ruins and asked Ohm to hand over the gold. Luffy is still upset about not finding a way out of the \"cave\" and keeps hitting it causing much anguish for Nola. Ohm told the men at the ruin, that for them to obtain what they seek, they have to first survive the Ordeal of Iron.\n",
  "characters": [
    "Tony Tony Chopper",
    "Holy",
    "Ohm",
    "Gedatsu (flashback)",
    "Raki",
    "Kamakiri",
    "Enel (flashback)",
    "Roronoa Zoro",
    "Monkey D. Luffy",
    "Aisa",
    "Nami",
    "Pagaya",
    "Conis",
    "Nola",
    "Usopp (K.O)",
    "Sanji (K.O)",
    "Wyper",
    "Gan Fall",
    "Pierre",
    "Gode (K.O)",
    "Nico Robin"
  ],
  "ssum_frequencies": [
    [
      "the",
      5
    ],
    [
      "and",
      3
    ],
    [
      "nola",
      3
    ],
    [
      "zoro",
      2
    ],
    [
      "priest",
      1
    ],
    [
      "ohm",
      1
    ],
    [
      "appears",
      1
    ],
    [
      "tries",
      1
    ],
    [
      "to",
      1
    ],
    [
      "kill",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      48
    ],
    [
      "and",
      27
    ],
    [
      "to",
      24
    ],
    [
      "he",
      17
    ],
    [
      "is",
      17
    ],
    [
      "that",
      16
    ],
    [
      "a",
      15
    ],
    [
      "ohm",
      12
    ],
    [
      "chopper",
      11
    ],
    [
      "it",
      9
    ],
    [
      "has",
      8
    ],
    [
      "him",
      8
    ],
    [
      "bird",
      8
    ],
    [
      "giant",
      7
    ],
    [
      "told",
      7
    ],
    [
      "zoro",
      7
    ],
    [
      "on",
      6
    ],
    [
      "as",
      6
    ],
    [
      "in",
      6
    ],
    [
      "not",
      5
    ]
  ]
}