{
  "chapter_number": "Episode 176",
  "title": "Climb Giant Jack!! Showdown in the Upper Ruins",
  "short_summary": "At the Upper Ruins, the fight between Ohm, Zoro, Gan Fall, and Wyper begins. When Nami appears, she is swallowed by the giant python, along with Gan Fall and Aisa.\n",
  "long_summary": "The battle among Zoro, Wyper, Gan Fall and Ohm has begun. Ohm told them only if he is defeated can they proceed. Zoro mentioned to Ohm that from his speech, he is a Priest that serves God. Zoro further told Ohm he is only interested in the gold and nothing else. Gan Fall mentioned to Pierre that they would have to defeat Ohm for them to move forward. Zoro mentioned to himself that the Python did nothing but followed him to the ruins. Luffy is shown lamenting on how weird the cave is. Wyper mentioned to the other men that they may as well die. He told Zoro that the Blue Earth Dwellers only came the day prior and they have no right to take anything. Just as Wyper and Zoro were fighting, the Python came charging in and Zoro saw that it had venom in its fangs. From behind was Holy who threw a punch that Zoro dodged. Zoro wondered how a dog could make such a move and Ohm introduced Holy, further commenting that he trains animals and is otherwise known as Sky Breeder.\nGan Fall came charging at Ohm and told Ohm he would like to know what Enel was up to. Ohm indicated that even if Gan Fall knew, it would be incomprehensible for him. The Enforcers are still fighting and trying to stop the Shandia from reaching the Giant Jack, meanwhile Nami and Aisa are still in the forest, also getting chased by the Enforcers. With her Mantra ability, Aisa realized that Wyper was alive and at Giant Jack. Just as Zoro was evading attacks from the snake, he noticed Chopper. Running to his side, he found that Chopper is unconscious. Zoro ran to try to help Chopper, but got hit by some Iron Cloud. Ohm explained that he helped to injure Chopper, but the Ordeals of Iron defeated him. Ohm asked if he would fight for revenge and Zoro replied saying he does not act that way however, this was an exception.\nPagaya and Conis brought the Going Merry to the point where the Straw Hats decided to meet, but they weren't there yet so they decided to watch the ship until they return. Pagaya turned the trumpet back on for courage and to ward off danger. Raki is still on her way to warn Wyper and the Shandia warriors are still on their way to the Giant Jack and behind them the Enforcers. Enel is happily enjoying the chaos. Wyper uses his burn bazooka to also attack Gan Fall saying Gan Fall and Enel are the same. Zoro began fighting Holy and Ohm, and was about to launch an attack he had in mind when Ohm released his sword made of Cloud Iron with a dial embedded in it. \nMeanwhile, Luffy is still trapped in the \"cave\" and becoming miserable about not able to find a way out. Nami and Aisa are chased to the Giant Jack by the Enforcers, along with Zoro, Wyper and Gan Fall. Wyper told Aisa to stay away from Nami and launched a burn bazooka in Nami's direction but she was saved by Gan Fall. He asked why the girls were there and Nami said because of a giant snake, only for the four of them to be swallowed by the giant snake.\nOhm then launched his sword at Zoro and Wyper, which knocked them out. He told them both they were distracted and there was nothing they could do about those who have been swallowed.\n",
  "characters": [
    "Nola",
    "Ohm",
    "Roronoa Zoro",
    "Wyper",
    "Gan Fall",
    "Holy",
    "Pierre",
    "Monkey D. Luffy",
    "Nami",
    "Aisa",
    "Tony Tony Chopper (K.O)",
    "Pagaya",
    "Conis",
    "Su",
    "Usopp (K.O)",
    "Sanji (K.O)",
    "Shura (K.O)",
    "Yotsubane",
    "Braham (K.O)",
    "Satori (K.O)",
    "Genbo (K.O)",
    "Raki",
    "Yama (K.O)",
    "Kamakiri (K.O)",
    "Mayushika",
    "Enel",
    "Warashi"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "gan",
      2
    ],
    [
      "fall",
      2
    ],
    [
      "and",
      2
    ],
    [
      "at",
      1
    ],
    [
      "upper",
      1
    ],
    [
      "ruins",
      1
    ],
    [
      "fight",
      1
    ],
    [
      "between",
      1
    ],
    [
      "ohm",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      32
    ],
    [
      "to",
      27
    ],
    [
      "and",
      26
    ],
    [
      "zoro",
      15
    ],
    [
      "ohm",
      14
    ],
    [
      "he",
      14
    ],
    [
      "that",
      14
    ],
    [
      "is",
      10
    ],
    [
      "wyper",
      9
    ],
    [
      "they",
      9
    ],
    [
      "gan",
      8
    ],
    [
      "fall",
      8
    ],
    [
      "a",
      8
    ],
    [
      "in",
      8
    ],
    [
      "was",
      8
    ],
    [
      "told",
      6
    ],
    [
      "them",
      6
    ],
    [
      "giant",
      6
    ],
    [
      "from",
      5
    ],
    [
      "his",
      5
    ]
  ]
}