{
  "chapter_number": "Episode 198",
  "title": "Zoro's imprisonment and Chopper's Emergency Operation!",
  "short_summary": "Zoro is taken as prisoner while Chopper and Nami assist a nervous doctor in treating injured Marines.\n",
  "long_summary": "Vice Admiral Jonathan, wonders in his office as to the locations of the rest of the Straw Hats and gives Lieutenant Commander Drake a direct order to interrogate Zoro. In the cells, Zoro was about to take a nap when Drake shows up and demands for Zoro's guards to open the cell. Drake begins asking questions as to how many of the crew there are, how did they infiltrate the stronghold and such. Zoro truthfully replies that they came from heaven via an octopus balloon. Drake does not believe him and warns him not to underestimate the marines.\nMeanwhile, Nami is assigned by the boss of the janitors to clean the dojo, and Chopper overhears that Zoro has been captured. Some Marines find him, and they run past the closet that Nami hides in. Chopper reaches a locked door but breaks the lock and manages to hide behind a crate full of deer antlers. Some doctors carry the crate outside with Chopper trapped inside. He is carried to the medical room, which is staffed with a single, inexperienced doctor. Outside, Nami is now dressed in a nurse uniform that she found in the closet. Several nurses run past, and drags Nami to the infirmary, stating that it was an emergency. Chopper realizes that he in in the infirmary, and wonders if the doctor is going to be okay.\nNami is assigned with the task of treating the Marines' wounds. On the other side of the room, Dr. Kobato faints at the sight of blood. Chopper decides to take the doctor's place and directs the treatment, wearing disguises. He meets up with Nami and asks what she is doing. Kobato wakes up then collapses again at the thought of operations. She revealed that she cannot bear the sight of suffering or wounded people, but Chopper encourages her to save the wounded. She stands up and makes her way to the operating room. Nami tries to persuade Chopper to escape while they can, but he says that his number one priority is to save people. The three of them proceeds to operate on the patients.\nMeanwhile, Drake is notified that an unidentified doctor is performing surgeries. He suspects that it is one of the Straw Hat pirates, and Zoro thinks that it is Chopper. Drake proceeds to the operating room and demands to ask Dr. Kobato a few questions. She in turn demands that he leaves after saying that the only people in the room were ones who dedicated their lives to saving people. He complies but orders the guards to watch the room. They finish the operations, and Chopper shrinks down to his usual size. However, Dr. Kobato is oblivious to this.\nIn the kitchen, Sanji is wondering how to escape. He states that the reason they were stuck there was because of Luffy not doing anything. Jessica arrives and asks if he is finished with the onions yet and wants them to cut to the next three hundred onions. Sanji immediately complies, and Luffy realizes that Sanji was the reason they were stuck.\n"
}