{
  "chapter_number": "Episode 158",
  "title": "Trap on Lovely Street! Almighty God Enel",
  "short_summary": "Conis leads Luffy, Usopp, and Sanji to a boat to get to Upper Yard, but she confesses to them that it is a trap and almost gets killed by \"Heaven's Judgment\" because she made the god angry.\n",
  "long_summary": "Luffy, along with Sanji and Usopp leave Conis' house to prevent Conis and Pagaya anymore trouble. Luffy and the others plan to go to the Sacrificial Altar but they are unsure where to go since the Skypiea map they obtained is too old, Conis appears saying her father wants her to help the Straw hats to the Sacrificial Altar. As Conis leads Luffy and the others to the Sacrificial Altar, McKinley spies on them chuckling happily wanting them to go to Upper Yard.\nLuffy, Usopp and Sanji arrive at Lovely Street, still being followed by the White Berets. Lovely Street is a busy place with lots of markets, but the people around there seem to be avoiding them because they have been branded as being criminals. Luffy seems to be enjoying himself by fiddling with the things for sale like dials and other things. Conis finds the docks and head over there with Luffy and the others. The towns people seem to realize that the Straw Hats are leaving and that they will be saved from Enel's wrath. Luffy and Co. arrive at the Gondola Port, Luffy wants to ride a Gondola but they have to ride the crow. Luffy refuses to leave Lovely Street unless he takes the Gondola with the bull. Sanji comically beats up Luffy and makes him apologize to Conis. Conis told them to go through Gate 2 which will take them to the Milky road that leads to Upper Yard. Luffy questions Conis about why she has been trembling since they left her house. Sanji believes that Conis is worried about them but Usopp thinks something's wrong since Conis is leading them while the rest of the town is avoiding them. McKinley and the rest of the Skypieans watch as Conis reveals the secret mission Skypieans must complete when outsiders come to their land to Luffy, Sanji and Usopp causing the Skypieans to back away slowly.\nA flashback of Pagaya and Conis appear. Pagaya thinks the Straw Hats are just like other \"Sea Dwellers\" and will back away from their dreams, making them retreat from Upper Yard. It is revealed that the citizens are all behind this plot for this was Enel's rule and all who disobey will be punished. Conis tells Luffy and the others that she called for the lobster to take away the Going Merry with the rest of the Straw Hats to Upper Yard. Now that Luffy, Sanji and Usopp were told the plan by Conis her life is in danger. Using Mantra, Enel summons a beam of light coming from the sky and aims it at Conis. Luffy tries to run away holding Conis, but the light is too big destroying some houses in the progress.\nAfter the explosion, it seemed unsure whether Luffy or Conis were still alive. The Skypieans believed that should happen to anyone who denies Enel's power. A voice sounds that both people are safe. Gan Fall along with Pierre saved both Luffy and Conis. Gan Fall asked Luffy what will he do, Luffy answers that they will go to Upper Yard and save their friends. McKinley was surprised that they were leaving for the Upper Yard saying they were leaving without a single hesitation. The episode ends with Luffy, Sanji and Usopp heading to Upper Yard.\n",
  "characters": [
    "Monkey D. Luffy",
    "Usopp",
    "Sanji",
    "Conis",
    "McKinley",
    "Pagaya",
    "Su",
    "Roronoa Zoro (flashback)",
    "Nami (flashback)",
    "Tony Tony Chopper (flashback)",
    "Nico Robin (flashback)",
    "Gan Fall",
    "Pierre"
  ],
  "ssum_frequencies": [
    [
      "to",
      4
    ],
    [
      "and",
      2
    ],
    [
      "a",
      2
    ],
    [
      "she",
      2
    ],
    [
      "conis",
      1
    ],
    [
      "leads",
      1
    ],
    [
      "luffy",
      1
    ],
    [
      "usopp",
      1
    ],
    [
      "sanji",
      1
    ],
    [
      "boat",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      40
    ],
    [
      "to",
      28
    ],
    [
      "and",
      22
    ],
    [
      "luffy",
      20
    ],
    [
      "conis",
      18
    ],
    [
      "that",
      11
    ],
    [
      "they",
      9
    ],
    [
      "them",
      9
    ],
    [
      "with",
      8
    ],
    [
      "is",
      8
    ],
    [
      "sanji",
      7
    ],
    [
      "upper",
      7
    ],
    [
      "yard",
      7
    ],
    [
      "usopp",
      6
    ],
    [
      "a",
      6
    ],
    [
      "of",
      6
    ],
    [
      "will",
      6
    ],
    [
      "go",
      5
    ],
    [
      "but",
      5
    ],
    [
      "are",
      5
    ]
  ]
}