{
  "chapter_number": "Episode 145",
  "title": "Monsters Appear! Don't Touch the Whitebeard Pirates",
  "short_summary": "The Straw Hat Pirates decide to go to Jaya to look for information about Skypiea. Meanwhile, Ace hitches a ride with Buggy, who demonstrates his own objection to any confrontation with Whitebeard.\n",
  "long_summary": "A turtle-like Sea King surfaces near Nami and the crew. The Masira Pirates are also frightened and scream for their captain, who is underwater confronting Luffy. Robin finds that the air hoses of the crew's diving suit were in the monster's mouth and deduces that Luffy, Sanji and Zoro were eaten by the monster. The monster pulls the Going Merry via its air hoses and tries to pull it underwater and Nami was about to cut the hoses to free the ship but the sky suddenly changes to night.\nThe Masira Pirates fear that the sudden change of the time of day was a bad omen, and that they should reel their captain in immediately. Luffy surfaces unconscious, and Zoro and Sanji both surface soon later. They all suggest to set sail and leave immediately, but Masira hops on their ship and prevents them from leaving. However, one of the Masira Pirates points out that, to the horror of the Straw Hat Pirates, the sudden night was caused by giangantic creatures blocking the sun. The Straw Hat Pirates flee.\nLater, Masira is seen briefly on the Going Merry before the Straw Hat Pirates kick him off. Nami is disappointed that Luffy, Zoro and Sanji did not find any clues about Skypiea during the salvage. Sanji points out that the ship looked as if it were attacked, or it had been destroyed by battle. Then, Robin reveals that she had taken an Eternal Pose from the Masira Pirates for an island called Jaya. So, Luffy commands his crew to turn the ship to Jaya to ask others about Skypiea. They soon realize, however, that they cannot stay in Jaya for too long or else the Log Pose will adapt and point elsewhere and they will lose their chance at finding the Sky Island.\nMeanwhile, Mohji and Cabaji are on an island resembling a skull. They are searching for the treasure of Captain John. However, they fail to find any treasure. Back on the ship, Buggy reveals a plan that involves waiting for Luffy to gain a reputation on the Grand Line so Buggy can receive a greater reputation by defeating him.\nPortgas D. Ace appears on Buggy's ship, intimidating Cabaji. Ace suddenly falls asleep and Mohji suggests taking Ace out while he is asleep, but Buggy refuses to harm Ace out of fear of what Ace's boss, Whitebeard, would do in retaliation. Ace wakes up soon and starts a party on Buggy's ship. Meanwhile, the Straw Hat Pirates continue traveling towards Jaya.\n",
  "characters": [
    "Nami",
    "Usopp",
    "Tony Tony Chopper",
    "Nico Robin",
    "Monkey D. Luffy",
    "Sanji",
    "Roronoa Zoro",
    "Masira",
    "Buggy",
    "Mohji",
    "Cabaji",
    "Master",
    "Richie",
    "Alvida",
    "Portgas D. Ace",
    "Whitebeard (shadowed)"
  ],
  "ssum_frequencies": [
    [
      "to",
      4
    ],
    [
      "with",
      2
    ],
    [
      "the",
      1
    ],
    [
      "straw",
      1
    ],
    [
      "hat",
      1
    ],
    [
      "pirates",
      1
    ],
    [
      "decide",
      1
    ],
    [
      "go",
      1
    ],
    [
      "jaya",
      1
    ],
    [
      "look",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      32
    ],
    [
      "and",
      17
    ],
    [
      "to",
      12
    ],
    [
      "that",
      10
    ],
    [
      "pirates",
      8
    ],
    [
      "of",
      8
    ],
    [
      "a",
      7
    ],
    [
      "ship",
      7
    ],
    [
      "they",
      7
    ],
    [
      "on",
      7
    ],
    [
      "masira",
      6
    ],
    [
      "luffy",
      6
    ],
    [
      "for",
      5
    ],
    [
      "ace",
      5
    ],
    [
      "their",
      4
    ],
    [
      "is",
      4
    ],
    [
      "in",
      4
    ],
    [
      "sanji",
      4
    ],
    [
      "by",
      4
    ],
    [
      "out",
      4
    ]
  ]
}