{
  "chapter_number": "Episode 276",
  "title": "The Fated Parent and Child! The Mother's Name is Olvia!",
  "short_summary": "Robin continues talking with Saul, who is shocked to learn that Robin is Nico Olvia's daughter, and that he is on Ohara. Olvia returns to Ohara to warn the other scholars that the World Government's forces are headed there. She decides not to reveal herself to Robin, not wanting her daughter to be branded a criminal because of her. CP9 arrives on the island, capturing Olvia and rounding up the scholars.\n",
  "long_summary": "A woman walks through the streets of Ohara, listening to the rumors that a Marine ship has appeared at its docks. The scholars at the Tree of Knowledge are informed about this.\nMeanwhile, Robin continues to talk to Saul about her hopes of meeting her mother, becoming an archaeologist and studying the Void Century, a century in history whose study is forbidden by the World Government. She tells Saul that her mother was studying the Poneglyphs. Saul was shocked to hear that Robin was the daughter of Nico Olvia, an archaeologist who left the island to study the Poneglyphs.\nSaul warns Robin that the Marines were there to eliminate the island's scholars. Meanwhile, the woman from before has arrived at the Tree of Knowledge and is revealed to be Olvia, and she explains that she arrived on the Marine ship. She tells the scholars that the group of people who left the island to search for Poneglyphs were killed by the World Government, leaving her the sole survivor. She warns that the World Government plans to exterminate all of the scholars of Ohara. She tells them to evacuate the island immediately, but the scholars refuse to leave, as fleeing the island would mean abandoning the priceless recorded history. \nOlvia decides to cut ties with Robin to prevent Robin from being known as the daughter of a criminal. She takes a gun and leaves. Meanwhile, a World Government ship arrives at Ohara and storms the Tree of Knowledge, targeting all scholars who have tried to study the Poneglyphs. Those who were not archaeologists were ordered to evacuate the island. \nSpandine, who was also on the island, was shot in the sleeve by Olvia. Spandine explains that he intended to storm Ohara to warn the academic community to refrain from studying the Void Century. Olvia is struck down. Meanwhile, the World Government agents storm the Tree of Knowledge and round up the scholars, including Robin. Spandine arrives, with one of his underlings carrying an unconscious Olvia.\nClover distracts Spandine to allow Robin to escape. Meanwhile, Saul walks around the island looking for Robin.\n"
}