{
  "chapter_number": "Episode 16",
  "title": "Protect Kaya! Usopp Pirate Gang Takes Action!",
  "short_summary": "Jango pursues Kaya in the forest and extorts her into signing the will, but Zoro and Usopp arrive at her aid. Meanwhile, Kuro uses his Shakushi attack, indiscriminately attacking Luffy and his own crew alike.\n",
  "long_summary": "The children escort Kaya through the forest as they hide from Jango, and Zoro and Usopp attempt to locate the group. However, Kaya falls ill and is no longer able to run. The children attempt to ambush him with a fake surrender, their weapons and a falling log, but this attempt fails as Jango is unharmed by the attacks. After Jango threatens to kill the children, Kaya agrees to sign the will as planned, and in exchange the children would be spared. However, before Jango is able to kill Kaya, Zoro and Usopp finally locate her and arrive to her aid.\nAt the northern coast, Kuro reveals his intentions to slaughter his entire crew to prevent any of them from exposing him in the future. His standard Nukiashi techniques fail against Luffy's attacks, so he uses his Shakushi technique, an indiscriminate attack in which he slashes all objects and people in sight at such a great speed he is completely invisible to his opponents. Although Luffy was his only opponent, the attack harms his own crew members, leaving them gravely injured. Luffy is injured by the attacks as he struggles to effectively combat Kuro's ability.\n",
  "characters": [
    "Piiman",
    "Tamanegi",
    "Ninjin",
    "Kaya",
    "Jango",
    "Monkey D. Luffy",
    "Kuro",
    "Pandaman",
    "Nami",
    "Usopp",
    "Roronoa Zoro",
    "Shanks (flashback)"
  ],
  "ssum_frequencies": [
    [
      "and",
      3
    ],
    [
      "the",
      2
    ],
    [
      "her",
      2
    ],
    [
      "his",
      2
    ],
    [
      "jango",
      1
    ],
    [
      "pursues",
      1
    ],
    [
      "kaya",
      1
    ],
    [
      "in",
      1
    ],
    [
      "forest",
      1
    ],
    [
      "extorts",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      12
    ],
    [
      "to",
      11
    ],
    [
      "and",
      8
    ],
    [
      "his",
      7
    ],
    [
      "is",
      5
    ],
    [
      "children",
      4
    ],
    [
      "kaya",
      4
    ],
    [
      "as",
      4
    ],
    [
      "jango",
      4
    ],
    [
      "in",
      4
    ],
    [
      "he",
      4
    ],
    [
      "attempt",
      3
    ],
    [
      "a",
      3
    ],
    [
      "attacks",
      3
    ],
    [
      "from",
      2
    ],
    [
      "zoro",
      2
    ],
    [
      "usopp",
      2
    ],
    [
      "locate",
      2
    ],
    [
      "however",
      2
    ],
    [
      "able",
      2
    ]
  ]
}