{
  "chapter_number": "Episode 185",
  "title": "Two People Awaken! A Rescue in Front of Burning Love!!",
  "short_summary": "Usopp and Sanji split up to rescue Nami, but the first one to get on deck is Usopp who cowardly tries to save Nami. After failing, Usopp is almost killed but saved at the last second by Sanji, who stays behind to allow Usopp and Nami to escape.\n",
  "long_summary": "As the episode starts, we are back to the Enel and Nami stand-off. Enel tells Nami that she obviously can't leave the ship \"safely\" now that she has told him all those things. Nami thinks to herself that she has no regrets about doing that because even though she knows she can't beat Enel, she can't stay on the ship either. Enel shocks Nami by asking her if she is counting on the \"two rats\" that have snuck aboard (meaning Sanji and Usopp) to save her.\nUsopp - who is now also climbing the outside wall of the ship thanks to some weird starfish shoes while hanging to the rope - is complaining and moaning about being scared of getting on the Ark Maxim and not knowing what to expect on there. He also assumes that there must be thousands of people on a ship that big. Sanji tells him to stop complaining and be stronger as he and his inventions are sorely needed to help. He mentions that Enel probably already knows of their presence thanks to his mantra ability. Once they have entered a large opening on the ship, Sanji suggests - to Usopp's great dismay - that they split up and head straight to the deck. Usopp thinks this means Sanji is assuming at least one of them is bound to die and Sanji tells him that if that saves Nami, he is OK with Usopp potentially dying! Sanji heads inside with Usopp running behind.\nEnel thinks the two intruders are fools to try and save Nami and Nami is confused who it could be since the only one whom she knows is still able to move is Luffy. Enel tries to attack Nami with a lightning strike but she manages to dodge. Enel tells her that since the three of them are bound to die anyway, he won't wait for her defenders and might as well start getting rid of her now. Nami is brainstorming what to do to defend herself.\nSanji and Usopp are separately running through the inside the ship and are amazed at the elaborate machinery that is keeping it flying. They both remark to themselves that nobody seems to be around and that the ship seems to be automated even though Usopp is confused on how that could work.\nIn the ruins of Shandora, Robin is using her Hana Hana no Mi abilities to carry Zoro, Wyper and the others' bodies near Giant Jack. She remarks on the sky getting darker which she thinks means Enel will start the destruction soon and bemoans the fact the Golden Bell is probably right above their heads. \nOn Angel Island, the inhabitants are still piling up on boats to flee to the White Sea and someone comments on how ominous the Ark looks.\nAt the Shandia Village, some Shandia are stunned at the idea of leaving the warriors behind but the Shandia Chief tells them to have faith in them and that everyone must take care of their own problems first. He tells them that Enel is going to destroy Skypiea like he destroyed Birka and it is time to get ready and flee. The Shandia start running around and the Chief thinks of Wyper and the upcoming \"end\" of everything.\nOn the Going Merry, Conis thinks back of meeting the Straw Hat Pirates and is frustrated that even though it is right here in front of her, she cannot know what is going on on Upper Yard. She prays for their safety.\nIn a hole on the ground, Aisa is crying over Pierre's apparently lifeless body and thanks him for protecting her. She hears Luffy crying out for her and finds he landed in a very awkward position. Luffy manages to lift the golden ball in which his hand is still encased over his head and tells Aisa that this is not over. He knows where the Ark is headed and tells Aisa they are going to the giant beanstalk they earlier found Robin near to.\nNami is using the Clima-Tact to dodge one of Enel's attacks and Enel is amused. Nami is apparently using the Thunder Ball ability of the Clima-Tact to create a path for Enel's lightning attacks to follow away from her. Enel is impressed but says that he just can change his attack so that trick won't work anymore. As he is about to act on his threat, Usopp throws a Hissatsu Kaenboshi at him. Enel and Nami are both surprised to see Usopp and Usopp is surprised to see Sanji is not up on the deck yet so, scared, he runs back inside.\nUsopp decides to be courageous and runs back out on the deck and dodges several of Enel's lightning attacks. Then he asks Nami to save him but Nami berates him reminding him he is supposed to be the one saving her. As the two banter, Enel launches another lightning attack and they dodge. Usopp remarks on Nami having the straw hat and she tells him Luffy was just there and got thrown off but will be OK. Usopp says they can't count on Luffy to save them and they are going to have to make it on their own. They dodge another lightning attack.\nUsopp suggests they hide behind the big electric tube at the center of the deck since it seems to be powering up something important and Enel will be reluctant to use big attacks near it. Nami points out her Waver is still somewhere on the deck and they can try jumping off the ship with that. Usopp is worried about the height but Nami tells him of an island cloud patch on the island below (that happens to be around Giant Jack) that they are flying over and can try to land on if they go with that plan. Enel attacks Usopp with lightning again. Usopp tells Nami he will distract Enel while she gets everything ready.\nUsopp jumps on the electric tube and proclaims an Usopp Spell in which the victim must think of having needles stuck under their nails. Nami is the one distracted by the thought however which irritates Usopp. Usopp tries several other cringe-worthy thoughts to cast an Usopp spell on Enel, but Enel is not plussed and lifts in the air and knocks Usopp with his golden cane. Nami gets the waver but as she screams to Usopp she is ready, Enel burns Usopp's body with his lightning. Enel then turns his attention to Nami and tells her escaping won't be easy. As Enel walks towards her, Nami rides the Waver past him toward Usopp who is showing signs of life and she tells him, as she approaches him, to grab her hand. Usopp lifts his hand for Nami to grab him on the way off the ship but Enel uses his cane to push it back down and Nami rides past Usopp without being able to catch him.\nEnel tells Usopp it is too late for him to be saved and as he prepares to strike the final lightning blow, Sanji jumps in, kick-lifts Usopp's body from the floor onto Nami's waver and tells both of them to go off the ship. Nami wants to turn around and help Sanji but Usopp pushes on the accelerator telling her to respect Sanji's resolve to save them and they ride the Waver off the ship and fall into the air. Meanwhile, Enel launches a massive lightning attack at a calm-looking Sanji.\nAfter the attack is done, Enel says that while Nami and Usopp jumped off, they have yet to escape since his attacks can reach them anywhere. But he notices that Sanji, while blackened and apparently weakened, is still standing at the same spot. Sanji thanks Enel for lighting his cigarette and tells him to get ready to cry before collapsing on the floor. Enel shrugs Sanji off before suddenly some parts of Ark Maxim stop working. The black clouds stop coming out of the chimney and some electric connections become unstable. Enel curses Sanji and wonders out loud what that insolent mortal has done to his ship.\n"
}