{
  "chapter_number": "Episode 45",
  "title": "Bounty! Straw Hat Luffy Becomes World Famous!",
  "short_summary": "Luffy is given a wanted poster and the highest bounty in East Blue. As news of Luffy's accomplishment reach Luffy's allies and former enemies, the crew sail towards Loguetown, the place of Gold Roger's birth and execution.\n",
  "long_summary": "While the crew are at sea, a News Coo arrives to deliver a newspaper. They discover a wanted poster for Luffy, indicating he had received a bounty. It is revealed that as Luffy defeated many of the most feared pirates in East Blue, the Marines saw him as a considerable threat and placed a bounty of thirty million bellies on his head, the largest in East Blue.\nThe news reaches both Luffy's allies and old enemies, including Fullbody, who had been demoted to a lower rank after getting into a fight at the Baratie. Fullbody saw Luffy's bounty as an opportunity to capture him and be promoted back to his past rank. Spotting the Going Merry pass by his ship, he orders his soldiers to attack the ship. However, this attack is repelled, and Fullbody retreats upon seeing Sanji. Meanwhile, Mihawk delivers the news to the Red Hair Pirates, who celebrate Luffy's accomplishment.\nMeanwhile, the crew determine their next destination. The only entrance to the Grand Line is Reverse Mountain, but they decide to first stop by Loguetown, dubbed \"the town of the beginning and the end\" due to it being both Gold Roger's birthplace and place of execution. As they sail towards Loguetown, Buggy and Alvida decide to pursue him.\n",
  "characters": [
    "Nami",
    "Usopp",
    "Monkey D. Luffy",
    "Sanji",
    "Roronoa Zoro",
    "Brannew",
    "John Giant",
    "Buggy (wanted poster, partially seen)",
    "Don Krieg (wanted poster)",
    "Arlong (wanted poster)",
    "Merry",
    "Kaya",
    "Koby",
    "Helmeppo",
    "Morgan",
    "Rika (flashback)",
    "Ririka (flashback)",
    "Ripper (flashback)",
    "Kuro",
    "Zeff",
    "Carne",
    "Patty",
    "Fullbody",
    "Moodie (flashback)",
    "Hitokui (wanted poster)",
    "D.R. (wanted poster)",
    "Golass (wanted poster)",
    "Henna Oyag (wanted poster)",
    "Shupeal (wanted poster)",
    "Alvida (wanted poster, partially seen)",
    "Wild Joe (wanted poster)",
    "Dracule Mihawk",
    "Benn Beckman",
    "Yasopp",
    "Shanks",
    "Lucky Roux",
    "Gyoru",
    "Woop Slap",
    "Makino"
  ],
  "ssum_frequencies": [
    [
      "and",
      3
    ],
    [
      "the",
      3
    ],
    [
      "of",
      2
    ],
    [
      "luffys",
      2
    ],
    [
      "luffy",
      1
    ],
    [
      "is",
      1
    ],
    [
      "given",
      1
    ],
    [
      "a",
      1
    ],
    [
      "wanted",
      1
    ],
    [
      "poster",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      16
    ],
    [
      "to",
      10
    ],
    [
      "a",
      8
    ],
    [
      "and",
      7
    ],
    [
      "as",
      4
    ],
    [
      "of",
      4
    ],
    [
      "his",
      4
    ],
    [
      "news",
      3
    ],
    [
      "they",
      3
    ],
    [
      "bounty",
      3
    ],
    [
      "is",
      3
    ],
    [
      "him",
      3
    ],
    [
      "luffys",
      3
    ],
    [
      "fullbody",
      3
    ],
    [
      "crew",
      2
    ],
    [
      "at",
      2
    ],
    [
      "luffy",
      2
    ],
    [
      "he",
      2
    ],
    [
      "had",
      2
    ],
    [
      "it",
      2
    ]
  ]
}