{
  "chapter_number": "Episode 54",
  "title": "Foreboding of a New Adventure! The Puzzling Girl, Apis",
  "short_summary": "On a stormy night, a girl named Apis escapes from the Marines and arrives at Straw Hat Pirates' ship, but the girl upon learning that they are pirates, begins to hide some of the reasons why she is wanted by the Marines. As the Straw Hats escape from the Marines, they get caught in the Calm Belt.\n",
  "long_summary": "A little girl on one of the Marines ships break free from her room after incapacitating one of her Marine guards. As the Marines begin to search the ship, the little girl makes it onto the deck and after climbing up the mast, accidentally opens up the ship's sail, causing it to tilt sideways. She then jumps on to a life boat to escape.\nBack onboard the Going Merry, Luffy asks Nami if they reached the Grand Line yet when she tells him its only been two days. Usopp then spots a flock of birds off their starboard side and Luffy stretches his hand out to grab what he thinks will be a fish. The crew are all surprised when he pulls in a girl instead and accidentally knocks Zoro off the edge of the boat. The girl is unconscious but wakes up when she smells Sanji's cooking. After learning that she is on a pirate ship, she freaks out and refuses to eat any food given to her.\nLater that night as her stomach growls, it drives her to sneak into the kitchen and later witnessing Luffy getting caught in a giant mousetrap set by Sanji to prevent people from stealing from the kitchen. As the rest of the crew is woken up, the girl steals some of Luffy's food and Nami reassures her that they are not evil. The next morning after Luffy raises the anchor, the girl proceeds to make breakfast for everyone but accidentally uses the wrong spice so everything comes out too spicy. The girl introduces herself as Apis and that her home is on Warship Island. Upon questioning why she was being held by the Marines, she refuses to answer and Sanji supports her, telling everyone that it's her business.\nAboard the Marine ship, the Marines spot the Straw Hats' ship and upon realizing that the missing girl is probably aboard it, they get ready to attack. Usopp tells the others about the approaching Marine fleet as they open attack on the Going Merry. The Straw Hats' ship manages to escape on a gust of wind heading south as the Marines begin to follow. The Marines then stop when they learn that the Straw Hats' ship is heading into the Calm Belt. As the Straw Hats celebrate their victory, Nami asks Zoro what is wrong when he asks her why it seems like they are not moving. Nami then screams, exclaiming that they have entered the Calm Belt.\n"
}