{
  "chapter_number": "Episode 264",
  "title": "Operation Disembarkation Commences! The Straw Hat Crew Rushes In!",
  "short_summary": "Luffy and the others finally catch up to Sanji, Sogeking, and the rest of the Franky Family as they near Enies Lobby. Sogeking shows off to Luffy and Chopper, which, they both do not see that Usopp is Sogeking. Paulie sits down with the group and talks about their plan. Luffy does not bother to follow the plan, and slingshots himself beyond the gates before the train stops. It also introduces three more members of CP9 - Fukurou, Jabra, and Kumadori.\n",
  "long_summary": "At Enies Lobby, Spandam is pleased to hear that CP9 is on their way with Nico Robin and Franky. Meanwhile, the Franky Family are trying to catch up to the others on the Rocketman. Sanji just finish telling the other members how Franky sacrificed himself to attempt to save Robin. The members are heartbroken but glad to hear how kindhearted his actions were. Luffy and the others on Rocketman finally catch up to the others and Sanji calls out to Luffy. Luffy notices Sanji but wonders who the other person is (Sogeking). Everyone is prepared for a fight with Zambai informing everyone of it.\nAt Enies Lobby, Spandam says it's been five years for all eight members of CP9 to be reunited. However, Spandam is furious wanting to know why they assassinate twenty other members of the Revolutionary Army instead of just three. Kumadori suddenly speaks up apologizing saying it's all his fault. Jabra speaks up saying a real man doesn't bow before anybody and agrees to explain what happened. Kumadori says he will take his own life but Jabra speaks up saying they were ready to assassinate as play but the enemy somehow found out about their plan. Fukurou speaks up saying it might have happened when he was talking about the plan all over town and Jabra angrily pulls at Fukurou's mouth. Kumadori says there is no need to blame Fukurou and agrees to take full responsibility. However, he uses Tekkai to stop himself for killing himself much to the annoyance of Jabra. The three other members of CP9 continue to argue and Spandam says he understands before spilling hot coffee on himself. Spandam also says that he heard about Nero didn't work out but he doesn't care.\nBack at the Rocketman, Sogeking's theme song plays again and Luffy and Chopper are amazed to see a real life \"superhero\". However, everyone else isn't fooled by Usopp's disguise. Chopper asks for an autograph and Luffy asks what happened to Usopp. Sogeking says that isn't important but what's important is to save Robin. Sogeking, Luffy, and Chopper begin singing and Sanji suddenly tells everyone that they need to know something. Sanji tells everyone about the situation with Robin and that CP9 is using her childhood fears against her. Sanji explains saying he's not using that as an excuse for not saving Robin but Robin may not come with them when they do try to rescue her. Luffy yells out saying it doesn't matter and suddenly blames Robin. Nami hits Luffy on the head saying not to blame her but Luffy says that it is. Luffy says he doesn't care and will do everything to rescue her. Zoro tells Nami to let it go as the main goal is still the same. Luffy says he will beat every one of them saying he has new moves he has to try out.\nPaulie suddenly speaks up saying he went to Enies Lobby a while back to do maintenance on the railways and had written a rough sketch of Enies Lobby. Paulie says that the Gates of Justice are located at the far back and they only way to get to them is to go through the Tower of Law. Luffy wonders what is the big hole and Paulie says it's the waterfall. Paulie says that if they don't rescue Robin and Franky before they pass through the Gates of Justice, then it's all over. Luffy says it doesn't matter if Robin passes through them that they will rescue Robin but Nami says that once they pass the gate, the only two places to go are Marine Headquarters or Impel Down. Nami says that they must settle this before Robin passes through the Gates of Justice. Paulie speaks up saying that the Straw Hat Pirates are the only ones strong enough to go against CP9 and says that they should stay behind and give them five minutes before charging ahead. Zambai says that the Franky Family and Galley-La will first break open the main gate so the train can pass through. Zambai knows that the Marines have over 2,000 men but the best chance for victory is for the Straw Hats to go after CP9 while the others take down the Marines. Luffy agrees to this plan and Kokoro speaks up saying they have arrived at Enies Lobby.\nEveryone is shocked to see how large the Gates of Justice are and Kokoro says they only open the gates wide enough for the criminals to pass. Kokoro continues saying behind the Gates of Justice lurks Sea Kings where no ships dare to go. Everyone is ready to go and prepare to go along with the plan. However, Luffy has gone missing and the rubberman has already launched himself into Enies Lobby much to the shock, annoyance, and anger of everyone else. Paulie and Zambai thought he understood the plan and Zoro says he should've known Luffy would do that. Zambai orders Sodom and Gomorrah to jump over the fence and break down the gate. Meanwhile, Luffy uses Gomu Gomu no Rocket to launch himself further into Enies Lobby and the Marines and government agents spot him. Luffy charges forward while Spandam is informed of an intruder. One of the Marines warns the others that the intruder is none other than Straw Hat Luffy and Luffy knocks down some Marines. The Marines are shocked to hear that Luffy is there and Luffy smashes through some more Marines wanting to know where Robin is.\n"
}