{
  "chapter_number": "Episode 273",
  "title": "All for the Sake of Protecting My Friends! Gear 2 in Motion!",
  "short_summary": "The Straw Hats enter while Yokozuna and the Franky Family stay behind at the door to defend their backs. The Three-Headed Judge attempts to stop them, but the Franky Family holds him off. Elsewhere, Luffy's Gear 2 is put into action, ultimately defeating Blueno.\n",
  "long_summary": "The Three-Headed Judge reports in to Spandam informing him that the pirates have now made their way into the Courthouse. The Three-Headed Judge proceeds to inform the pirates that they had entered a place of \"sacred judgement\" and begins a trial. Zambai and the Franky Family tell Zoro and Nami to make their way to the roof where Luffy is already fighting while Yokozuna and them prevent any of the Marines from flanking them. The Marines and the World Government Workers notice that the pirates are completely ignoring the trial, and one of them raises their rifle and points it towards Zoro who uses his Enbima Yonezu Oni Giri attack to clear a path towards the stairs as they start running towards them.\nSanji, who was still outside fighting Marines, comes running in past Zambai yelling for Chopper and Zoro to get out of his way (calling them \"reindeer and idiot swordsman\" respectively), because he is going to be the one to clear the path for Nami, while jumping and kicking at Zoro, who promptly asks Sanji if he wants to fight. The Franky Family are confused by this and cannot believe he is picking a fight with his crew mates in this situation. Sanji tells Nami to follow him, and only him, as he runs up the stairs ahead of everyone, to which Nami reminds Sanji they are there to save Robin. Sanji then remembers this point, only to exclaim how she must already be lonely and crying while waiting for him to save her. It is around this time that Chopper notices that Zoro has gone the wrong way and not taken the stairs, wondering how Zoro could have gone the wrong way when he just gave him directions and was standing right there. Chopper says that he is going to make Zoro medicine for being \"clueless\", to which Nami asks if he can also make some for Sanji, who is seen running fast enough to kick up a dust cloud several levels up now.\nAs Chopper stops at the top of the stairs to tell Zoro the way (much to his dislike), the Three-Headed Judge jumps from down below angry that he is being ignored. Zoro blocks the initial attack, as the Judge grabs onto the ledge. Just as Zoro is preparing to fight the Judge, the Franky Family grabs onto the Judge's legs and pulls him back down to their level, telling the Straw Hats that they will handle him.\nThe scene shifts back to the roof of the Courthouse, where Luffy has just released Gear 2 for the first time in his fight against Blueno. Luffy tells Blueno that he is glad that he met them, because now he will be able to protect his friends as he moves through ever increasingly more powerful opponents. Blueno is confused, since losing Robin is directly related to meeting CP9.\nLuffy then raises his hand, as if aiming at Blueno, and starts saying \"Gomu Gomu no...\". Blueno asks if he is aiming at him, and says that will only give him more time to dodge Luffy's attack. He tells Luffy to try and hit him, and immediately uses Soru. Almost instantly, using a previously unseen attack, Luffy yells \"Jet Pistol\", which sends Blueno flying and slamming into the wall behind him. Blueno quickly gets up, unsure of what just happened, looking back toward where Luffy was standing, only to see that he was no longer there. From off camera, another Jet Pistol hits him directly in the right side of the face (Luffy does not call out the name of the attack this time), sending him flying the other direction. Luffy is then seen moving toward Blueno, so fast that he seems to disappear, and transitioning into a Jet Rifle, which sends Blueno flying again. He's moving and attacking so quickly that Luffy forgoes \"Gomu Gomu no Jet\" before calling out each successive attack: a shortcut he only used once before when fighting Arlong: and then only for a two-shot combo. While Blueno is still in the air, Luffy appears directly above him and uses his fist to pummel Blueno into the rooftop, and then immediately back-flips through the air and lands back on his feet several meters away. Blueno sits up, and looks towards where Luffy landed, but all that is there is a puff of steam. Blueno looks around frantically, thinking to himself how he cannot see Luffy at all, and is then hit with another shot from Luffy that sends him flying again. Luffy jumps to the top of a flag pole and unleashes a quick barrage of attacks on Blueno, hitting him with a Gomu Gomu no Jet Stomp, Jet Spear, and Jet Missile (by grabbing onto Blueno's horns) before he even has a chance to react.\nBlueno makes it to one knee as he looks around, barely able to see Luffy move as he takes another hit. It is then he realizes that Luffy has mastered the Rokushiki technique Soru. Blueno uses his Doa Doa no Mi powers to create a door in mid-air and jump through it into an alternate dimension. He ponders how Luffy could have possibly learned and mastered a Rokushiki technique, ultimately deciding that Luffy's skills cannot possibly match up to a true Rokushiki user's prowess. Blueno opens the Air Door again, jumping at Luffy who easily avoids the attack. Luffy explains that he is glad he learned something like Soru was possible (by kicking the ground over ten times in an instant; his accurate description confirms Blueno's suspicious of him mastering the technique) and that now he will not lose anymore friends because he is not strong enough. Luffy stretches his arms back as Blueno says to bring it on and that he will stop Luffy's attack with his strongest Tekkai, \"Go\" (Strong). Luffy then hits him with a full-power Jet Bazooka, which sends Blueno sliding back on his heels with a huge dent in his chest, but he remains standing. Luffy comes out of Gear 2, and tells Blueno that he really is a tough guy, but that he has something even more interesting to show him. As Luffy raises his hand to his mouth to begin a new assault, he noticed Blueno is not moving. Blueno then falls to the ground, ending the fight.\nLuffy is exhausted after the fight, talking to himself about how his body still cannot quite take Gear 2. But his body is the least of his worries right now; he needs to keep advancing.\nMeanwhile the rest of the crew and Franky Family are still fighting through the Marines and World Government Workers. Sogeking is shown still riding Kashii and Oimo with the rest of Galley-La Company. The Marines cannot believe that Yokozuna is preventing them from entering the Courthouse, while Kiwi and Mozu are shown still climbing the towers trying to lower the drawbridge. Spandam tells the workers to gather all the CP9 members together, as the episode ends with Luffy yelling out Robin's name.\n"
}