{
  "chapter_number": "Episode 253",
  "title": "Sanji Breaks In! The Sea Train Battle in the Storm!",
  "short_summary": "Nami and the conductors are rescued by Paulie when the Aqua Laguna floods the main station. A man hands Nami a letter he found from Sanji. It informs her that Usopp, Franky, and he are on board the train that had just departed. On board, he storms the cars. High up in the city, Nami speaks with Kokoro and spots Luffy, stuck in between two buildings, in the back streets where the Aqua Laguna will hit first.\n",
  "long_summary": "At the Blue Sea Train station, the two employees are talking about how \"some guy\" managed to get onto the Sea Train but remark saying he'll get captured by the government agents on-board. The two men then notice Paulie and Nami close by and decide to spy on them. However, they are quickly spotted by Paulie who says that the Sea Train left early. One of the men informs Paulie that the Sea Train had to leave early due to the near arrival of Aqua Laguna. Paulie then speaks to Nami saying how it's impossible to get another Sea Train that will head for Enies Lobby and thinks Nami is crying. However, Nami suddenly bursts out with anger wanting to go after them. Nami then asks for a strong ship from Paulie but Paulie says it's too dangerous. Suddenly, Paulie grabs everyone and a large wave engulfs the entire lower area of the train station. Paulie is shocked to see the damages it caused even when the actual storm hasn't hit yet and says that Aqua Laguna is different this year. Nami asks if the Sea Train that Robin is on is in any danger and Paulie says that the Sea Train is able to cut through the waves. Suddenly, another man calls out to Nami saying she has a note. Nami then looks up at the writing on the wall and knows it's Sanji's doing. Nami reads the letter and, after ignoring the love letter parts, she is informed that Sanji has gotten onto the Sea Train and Usopp and some arrogant thug with a ducktail are there. The man then gives Nami a Den Den Mushi and is informed by Sanji's letter that he will contact her once he gets ahold of another one himself. Paulie is impressed that Sanji followed Robin around and Nami decides to let everyone else know.\nOn board the Sea Train, Sanji can be seen in the back. Back in town, Nami informs Chopper what she has read and Chopper is relieved that Robin has some help. Nami says that they cannot do anything until they find Luffy and Zoro first. Nami, Chopper, and the Water 7 citizens decide to help out as well. On the Sea Train, Sanji wonders how to get into the train itself. Suddenly, a government agent appears remarking on the storm and notices Sanji. Sanji then attacks the government agent with a vicious kick and sends the government agent flying into the Sea Train. The other government agents pull out their guns wanting to know who Sanji is and Sanji prepares to go on the attack.\nSanji makes it inside but the government agents threaten to shoot him. One of the government agents wants to let Rob Lucci be informed of Sanji's presence but suddenly, a very large man that is standing over Sanji says that CP9 shouldn't be bother with such a \"small matter\". This man is revealed to be Jerry who says he is famous, undefeated champion known for his boxing skills in the South Blue. Sanji is unimpressed at the agent's claims but Jerry decides to take down Sanji with his punches. The other government agents try to stop Jerry but Jerry unleashes a barrage of punches that end up missing Sanji and hitting the other government agents. Jerry then taunts Sanji before going into a position, Sanji angrily tells Jerry that just shortened his range. Jerry then says that it's part of his plan and then attempts to hit Sanji with a drill kick but misses. Sanji then effortlessly takes out Jerry with Brochette and the other government agents are shocked on how Sanji easily took down Jerry. Meanwhile, Corgi is seen talking over to CP9 about the numerous of government agents in the other train cars. CP9 seems unimpressed and Corgi says that they don't need to worry with a possible raid. Sanji is then seen preparing to go down further.\nBack in town, Nami, Chopper, and the citizens are seen still trying to look for Luffy and Zoro. Paulie then wonders if Iceburg has been informed about everything and one of the citizens says that two men went to tell them. At the remains of Galley-La Company, Iceburg is seen getting up and walking away much to the confusion of the two men. In town, Nami and Chopper and the others continue to call out to Luffy and Zoro. Meanwhile, the two Train Station employees are seen at a closed shop trying to look for food after being told by Nami earlier to do so. Time has passed and they have no luck in finding Luffy and Zoro. Nami is determined to find Luffy and Zoro in order to rescue Robin.\nAt a higher location, Paulie is seen walking up to a bunch of people wanting to know what's going on. Kokoro is seen looking over the city remarking how you can tell how strong the storm will be by looking at the evidence. Kokoro tells Chimney and Gonbe to take a look and what is seen next is the entire sea has dried up. Paulie and the others are horrified to see this and Paulie remarks on how strong the storm will be this time. Chimney suddenly tells Kokoro that she sees something and Nami eventually appears. Chimney tells Nami that she sees something but Nami is shocked to see that the sea has dried up. Suddenly, Nami spots something between two buildings and upon looking harder, it turns out to be Luffy who is still trying to free himself. Kokoro also notices Luffy and Nami charges down to the backstreets to get him. Kokoro yells at her saying it's too dangerous to go down there when the storm is about to hit but Nami ignores this and continues running toward Luffy.\n"
}