{
  "chapter_number": "Episode 249",
  "title": "Spandam's Conspiracy! The Day the Sea Train Shook",
  "short_summary": "Spandam, a CP5 representative, is determined to get Tom proven guilty in his trial so he could get the blueprints. As Franky walks into the town, people from the government begin to attack with the battleships he had personally constructed. Tom and Iceburg run to their shipyard where they are attacked by two ships which also destroy the others. Iceburg tells Franky that he has to take responsibility or he will never forgive him.\n",
  "long_summary": "Following his defeat at the hands of Rob Lucci, Zoro is sent across Water 7 and splashes onto the water until he crashes on top of a building (due to the rising water from Aqua Laguna's slowly coming in). Zoro gets up and issues some payback after being angered by Lucci then runs off. Elsewhere, Luffy can be heard screaming and yells out \"Not again!\" presumably stuck in another wall. Back at Franky's base, Lucci is reviewing how ships used to be built at the remains of Tom's Workers. Usopp is surprised by this while Lucci picks up the picture saying how Franky holds countless memories from the past. Franky yells at Lucci to get out but Lucci says that not until he gets the blueprints for Pluton. Franky says there are no blueprints but Lucci, annoyed, knocks over a drafting table. Franky yells out but Lucci orders Kalifa to tie up Franky using her thorny rose and she does so. Franky kneels from the pain and Lucci tells Franky to calm down as he knows everything from Franky's past especially about a crime that happened eight years ago. Franky yells out to Lucci and even calls him a \"freak\" which the agitated CP9 agent kicks Franky back. Franky remembers an experience from the past and tells Lucci that Lucci doesn't know anything about Tom or Water 7.\nA long flashback dates back to eight years ago with the people of Water 7 enjoying the Sea Train Puffing Tom that Tom has his crew built. Two people explain that the Judicial Ship will be arriving soon and are positive that they'll let Tom go. Other people are a little worried that other islands want more for their items but aren't going to give up. Elsewhere, Iceburg can be seen constructing and says that the people are happy about being able to cross the ocean but they complain saying it's not good what they have hoped. However, Tom laughs at this saying they're spirits are up and see how time will tell. Suddenly, a group of men walk up and one of them starts talking to him. However, the man gets blasted by a cannonball but introduces himself as agent Spandam of CP5. It turns out that the cannonball came from Franky who is celebrating his recent kill of a Sea King using his newest Battle Franky 35. Iceburg is annoyed at Franky's childish behavior and starts pounding at Franky's battleship. Franky tries to stop him but Iceburg knocks him down and abruptly tells Franky that the battleships are dangerous and that someone else could get a hold of one and use it to harm others. Tom (with Spandam still following) shows up and Iceburg wants Tom to back him up on Franky not building anymore ships. Spandam suddenly speaks up wanting to talk with Tom and Tom assumes that he wants to talk about the trial. However, Spandam doesn't know about any trial but only wants to talk about something.\nBack at Tom's Workers, Kokoro notices Iceburg and Franky arrive but Tom isn't with them. Iceburg informs her that he is with an World Government agent named Spandam but this only confuses Kokoro saying how someone from the World Government isn't with the Judicial Ship. Elsewhere, Tom tells Spandam that he has no blueprints. Spandam doesn't believe this and says he has been researching the history of Water 7 for a long time and knows that only Tom could have the blueprints in his possession. Tom laughs and says that Spandam has the authority to investigate him. Spandam says he does and knows of Tom's dealings with Gold Roger and threatens to tell the World Government about that if he doesn't give the blueprints. Tom says that the World Government already knows about him helping the Pirate King and Spandam is surprised by this wanting to know why Tom isn't either locked up or executed yet. Tom simply tells him to investigate more and kicks Spandam out. At a bar, the bartender tells Spandam that the judge will be dropping the charges due to Tom building the Sea Train. Spandam is angry by this and a brief flashback occurs with Spandam getting orders from the Five Elders themselves to get the blueprints Pluton. Spandam leaves the bar still angry about Tom being let off but Spandam punches a nearby ladder and paint falls on him. Spandam nearly slips but lands on his feet impressing his CP5 followers. Spandam promises that the charge will stay and that Tom will die but Spandam slips on the paint and falls into the water. Meanwhile, Tom grabs the blueprints from a hidden safe.\nBack at Tom's Workers, Tom tells Iceburg and Franky to come to him as he has something very important to show them. A little later, Iceburg and Franky are both shocked and Tom says that it will be a nightmare if Pluton is built and is more worried now that the World Government knows about it. Tom says that he cannot keep the blueprints anymore and Iceburg agrees to take them. Franky actually wants to build it but Iceburg punches him saying that it should never be built. Tom says that the world will be done for and he suddenly puts down a wanted poster of Nico Robin (most likely hinting that she is the only known archaeologist that is alive that can decipher Pluton's blueprints).\nIt's daytime and Franky is seen leaving Tom's Workers. However, Kokoro stops him and gives him a pair of pants saying he caused an uproar in town last time he went there without his pants on. Franky, annoyed, then leaves and Kokoro wakes up Iceburg and Tom saying they don't want to miss Tom's trial. The people soon start to gather around and the Marines are seen talking with Jorge about Tom's sentence. Jorge says that he as seen the Sea Train and is happy to report that he'll be lifting Tom's sentence. Franky notices everyone around and is glad to hear that Tom will most likely will be let go. Suddenly, the Judicial Ship is being under attacked and the people start to run away. Some people spot a fleet arriving and, to his horror, Franky spots his battleships, the Battle Frankies, attacking the Judicial Ship. Iceburg quickly tells Tom that Franky's battleships are attacking the harbor but Tom knows that it's the World Government's doing. The people continue to run away and Franky runs off to see who is doing this (as Jorge wants to know who is behind this as well). It turns out to be by CP5 who are doing this under Spandam's orders and Spandam plans to place the blame on Tom. The CP5 agents withdraw and head back to Scrap Heap Island and Iceburg and Tom start to head for them. The CP5 agents spot Tom and Iceburg coming and they leave. Suddenly, two more ships blast at Iceburg and Tom.\nFranky arrives and sees that Tom and Iceburg are badly injured. Franky wants to know what happened but Iceburg attacks Franky. Iceburg tells Franky that Spandam used the Battle Frankies to attack the people at the harbor much to Franky's shock. Iceburg then says that they have the ability to create dangerous weapons even if they're not intended to hurt or kill. Iceburg says that the World Government did that to place the blame onto Tom so that they can force him to hand over the blueprints. Iceburg continues to yell at Franky and says that if Tom gets taken away and hangs for this, Iceburg will never forgive Franky for the rest of his life. Franky screams and cries in horror after hearing all that has happened.\n"
}