{
  "chapter_number": "Episode 281",
  "title": "Tears Which Weaved the Bond of Friendship! Nami's World Map",
  "short_summary": "Nami's memories of Arlong Park are shown. Also, likens her situation with Luffy then, and with Robin's now.\n",
  "long_summary": "Luffy announces that they are going to save Robin, as the drawbridge is lowered. Meanwhile, Nami thinks of how Robin's lonely days are now over, which reminds her of how she joined the Straw Hats herself. In the flashback, Nami tells Luffy not to get involved with what is happening in her hometown and then goes to her house, where Nojiko observes the mess that Nami has caused in a fit of anger. Nojiko asks Nami if the Straw Hats are upsetting her, and Nami explains that she was hoping to be able to leave them behind but that she might have remained with them forever if things had happened differently. Nojiko understands how much Nami cares about the others. Nami's memory of how she joined Arlong's pirate crew, in order to gain enough money to buy her village, is shown. Nami later confronts Arlong, furious about how he allowed the Marines he had bribed to steal her money. Arlong insists he never broke his promise and encourages her to just start saving up anew. He tells Nami that if she flees instead, he will kill everyone in Cocoyasi village. The villagers, led by Gen, hear about this and decide to fight back against Arlong for not keeping his word and being so cruel to Nami. Just as they are ready to go, Nami tries to stop them to keep them out of danger, telling them that she will make a new attempt to buy them free. However, Gen hugs her and says that it is hopeless and that she has done more than enough, finally convincing Nami to let them go. As the villagers set off to Arlong Park, Nami starts stabbing her tattoo until Luffy shows up and stops her. At first, Nami became upset with him for meddling, insisting that it is none of his business, which Luffy is well aware of. But at last, she asks him to help her, crying. Luffy places his straw hat on Nami's head and agrees to do so, and he tells Zoro, Sanji and Usopp to come along, which they do. Luffy breaks into Arlong Park and meets Arlong. They are next seen in Nami's cartography room, where she had been held prisoner for years. For this reason, Luffy starts destroying the room, while fighting Arlong. The whole building is smashed from the attacks. The crowd stares at the scene, wondering who won. Luffy eventually rises from the rubble and tells Nami that she is his friend. Nami starts crying and the scene returns to present time. At Enies Lobby, Nami is reminded of how she has to fight for Robin just like the others did for her before. Speaking on a Den Den Mushi, Kokoro encourages the Straw Hats to get moving, and Luffy stretches his arms to take his friends with him as he jumps down from the building.\nA simple question is asked: if the Straw Hat Pirates were all middle-aged women, who would be the strongest? This special is the answer!\nLuffyzaki is introduced first, a middle-aged woman who complains at how she has no soy sauce for her meal that was supposed to consist of meat soy steak, meat salad (without vegetables) and meat soup (without soup). She goes to Zoroyama's house to ask her for soy sauce. Zoroyama is currently making sashimi, but instead of cutting fish, she happened to cut her entire kitchen apart. Zoroyama is also out of soy sauce, since she cut that as well with her swords. At the supermarket in town, Choppermori is eating cheese wraps with ham and the cashier tells her she is not allowed to bring her own rice. A bunch of women run away from Sanjida, whom they find creepy because she is always trying to grope them. Namijima punches them for their actions which the crowd seem to think was the right thing to do. Usogawa then comes to Luffyzaki's house to advertise the sale in the supermarket. Usogawa then admits she was lying. She tells Luffyzaki of how Sanjida and Choppermori were captured at the supermarket, while they are eating rice cookies. Luffyzaki suspects Namijima of being behind this. They ride a bike to Robinou's house to hide from Namijima. Robinou complains at them for refusing to learn how to separate trash. Robinou picks up the phone and it is revealed she was speaking with Namijima. Namijima gives everyone (except for Robinou) a scolding for not paying rent. The narrator announces that as older women, Namijima would be the strongest one.\n"
}