{
  "chapter_number": "Episode 151",
  "title": "The 100,000,000 Man!The World's Highest Authority and the Pirate Blackbeard",
  "short_summary": "Luffy makes his mark when he challenges Bellamy to get Cricket's gold back as machinations on the other side of the world are set in motion. As a new face makes the Straw Hat captain their target, the World Government tries to prevent the meeting of two major powers.\n",
  "long_summary": "Bellamy laughs at Luffy's demand that he give back Mont Blanc Cricket's gold. After their last encounter in Mock Town, he doubts Luffy even knows how to throw a punch. Sarquiss still believes the bounty poster for Luffy with his new 100,000,000 bounty is a fake. He questions if the old one for 30,000,000 is also real as he watches Luffy's fight with Bellamy. Bellamy breaks off the roof they are on and springs at Luffy with Spring Snipe, but Luffy jumps out of the way. The Bellamy Pirates sit back to \"watch the show\". Bellamy manages to hit Luffy when he's falling from the rooftops, and smashes him into the boardwalks. Luffy gets up as if nothing has happened, but Bellamy is still unimpressed with his effort. \nWanting to finish it, Bellamy begins springing off all the nearby buildings around Luffy with his Spring Hopper technique, all the while mocking Luffy for being among the pirates who chased dreams. Angered, Luffy cracks his knuckles, recalling Bellamy asking if he even knew how to throw a punch. As Bellamy springs toward him to finish him off, Luffy punches downward, striking Bellamy down through the boardwalks so hard he leaves an imprint of his fist in the now-unconscious pirate's head. Sarquiss urges Bellamy to get up, thinking Bellamy was fooling around. But it turns out the drunkard that found Luffy's new wanted poster was right about Luffy's notoriety. With Bellamy's blood dripping from his fist, Luffy demands Cricket's gold back, and the town's people scatters in a panic after learning Luffy and Zoro's bounties are real.\nBack at Cricket's camp, all of his associates are back to work retrofitting the Going Merry thanks to Chopper's care. Nami berates Zoro for not going with Luffy to challenge Bellamy, even though he was beaten up earlier too. He does not take kindly to her insults, and Usopp tries to cool them down as they start beating on the ship in their argument. Back in Mock Town, Luffy sacks up Cricket's gold. With Bellamy still laying in the broken boardwalk, Sarquiss tries to challenge Luffy, but is held back by the others. When asked where he is going, Luffy raises his fist, still covered in Bellamy's blood causing Sarquiss to fall to the ground in fear. Luffy then points upward and tells them, \"The sky!\"\nDrifting in the ocean, Dracule Mihawk gets Luffy and Zoro's new posters. He is pleased to see that they can now shake the World Government with their defeat of Crocodile.\nMeanwhile, at Mary Geoise, the Five Elders—the de facto rulers of the world—find out from a Marine that \"Red Hair\" is trying to get in contact with \"Whitebeard\" via messenger. They determine that the two meeting is too dangerous, and they must find a successor for the defeated Crocodile among the Seven Warlords of the Sea quickly to maintain balance between \"the powers\". They also admit that they cannot keep Luffy unchecked. Indeed, a meeting of the remaining Warlords of the Sea has been ordered. Two arrive: Donquixote Doflamingo and Bartholomew Kuma, both of whom had massive bounties before becoming privateers. When he arrives, Doflamingo toys with two of the present Marines, using his powers to make them fight each other out of sheer boredom. He is told to stand down by the Fleet Admiral of the Marines, Sengoku, who is impressed that even two of the remaining six Warlords of the Sea showed up. Doflamingo said he only came because his \"island business\" was running so well he was bored of it. Shortly after, they are joined by Mihawk, making it three Warlords. He says he was merely an onlooker in these proceedings, as he's interested in the pirates responsible for Crocodile's defeat.\nShortly after, a foreign voice joins in, and the room is invaded by a tall, lanky man with tap shoes. One of the Marines present identifies him as Laffitte, a former peace officer from West Blue who was chased from his country for his cruel methods. He says he is here to recommend someone to replace Crocodile.\nSomewhere on the seas, a captain receives a letter from Shanks. His men insult the messenger, Rockstar, a relative newcomer to the Red Hair Pirates who has a 94,000,000 bounty. The intended recipient of the message, Whitebeard, rips up Shanks' letter. The captain appears to be ill, as he has nurses all around and is connected to several IVs and an oxygen line. He tells Rockstar that if Shanks wants to send a message, he should deliver it personally, and bring good booze along with it. Rockstar alerts Shanks by Den Den Mushi. Shanks apologizes for putting Rockstar through all that, and tells his men to get ready to set sail to meet Whitebeard.\nAt Mary Geoise, Laffitte recommends his captain, Marshall D. Teach, to replace Crocodile as a Warlord. Sengoku does not even know who this pirate is, but Lafitte tells him that his crew, the Blackbeard Pirates, are hatching a plan to make their names known.\nIn Mock Town, while the citizens were talking about Bellamy's defeat, Teach looks at Luffy's reward poster, and comments on it. Then Sarquiss runs into him and tells him to get out, so Teach buries his head into the ground. Then, he declares that he does not intend to capture weaklings, but one man out of 100,000,000, so he and his companions begin to leave the city, while discussing Laffitte and fate.\nLuffy, however, is already on his way to the other side of Jaya with Cricket's gold.\n"
}