{
  "chapter_number": "Episode 261",
  "title": "Crash! Demon-Cutting Zoro vs. Ship-Cutting T Bone!",
  "short_summary": "Zoro clashes with \"Ship Cutter\" T Bone. The fight is short and Zoro joins the crew again in the Rocketman. On the Puffing Tom, Sanji beats up Wanze to the point that his face becomes beautiful, though Wanze thinks he's ruined his face. Franky finally gains the upper hand against Nero and defeats him. After beating their respective opponents, Franky and Sanji stand to fight against the other CP9 agents.\n",
  "long_summary": "On the Sea Train tracks, T Bone is seen running and is ashamed of himself for falling for a trap. T Bone is trying to catch up to the Puffing Tom not wanting to let down his men. Not too far behind, everyone is still shocked to see the sliced Sea King and Zoro readies himself for a fight. T Bone eventually stops running after seeing another Sea Train. Zambai gets a closer look on the person and he reveals him to be \"Ship-Slasher\" T Bone. Luffy wonders who that is and Zambai explains that T Bone is from the Navy and that he can slash through any ship. Zambai tells the Franky Family to prepare themselves for a fight but Luffy tells everyone that Zoro can handle it. Zoro yells at T Bone to get out of the way but T Bone doesn't listen knowing that his men have been taken out. T Bone then knows the group is trying to rescue Nico Robin and recognizes Zoro. T Bone yells out that he is a proud captain of the Navy and challenges Zoro to a fight. T Bone charges in and prepares to use his attack Chokkaku Hicho: Bone Odori and Zoro is ready to counterattack and charges forward. T Bone fires his attack at Zoro but Zoro easily blocks the attack and takes down T Bone. T Bone goes flying into the water and Zoro hops back on the Rocketman. The Franky Family cheer for Zoro's victory and Zoro compliments on T Bone's strength. The Marines are trying to sail themselves to T Bone and T Bone is seen floating in the water. T Bone then compliments Zoro's strength. Zoro is then seen sleeping and Chopper wonders if Sanji had anything to do with the detached train cars. Nami confirms this and even says it was a great idea. Luffy is eager to catch up and is ready for a fight saying he is going to beat up the \"pidgeon guy.\"\nOn the Puffing Tom in train car 1, Corgi is seen growing suspicious of Robin. Sogeking (who is still hiding in Robin's coat) is relieved that Corgi walked away and that their plan worked. Corgi, however, says it's not his imagination and can smell out pirates. Corgi suddenly starts walking back toward Robin much to Sogeking's dismay. In train car 4, Wanze can be heard screaming loudly thinking Sanji has cut him with the kitchen knives. Wanze is relieved that he isn't cut and Sanji says that kitchen knives aren't for cutting people and shouldn't be used as swords. Sanji then puts the knives away and, as he turns around, Wanze attempts to hit him by throwing knives at him (Hocho Nage). Sanji dodges and angrily kicks Wanze in the face. Wanze worries his eyes are being pushed in but still wants to fight. Wanze taunts Sanji saying why would he save such a \"terrible women\" and that she has everyone fooled. Sanji kicks Wanze in the face multiple times treating to rearrange his face. Wanze asks Sanji not to do so but taunts him saying that Robin is better off dead. Sanji furiously kicks Wanze over and over in the face (Parage Shot) and sends Wanze flying backwards. Wanze gets up and, after looking at a frying pan, his face completely got rearranged. Wanze yells at Sanji for messing up his face but Sanji then tells Wanze he is guilty of three sins: Wanze called himself a \"chef\" in front of him, he was disrespectful toward his food, and that he insulted his friend. Sanji promises to make Wanze pay.\nOn the rooftop, Franky is seen being thrashed around by Nero. Nero taunts Franky on his Centaur Mode and starts shooting at him. Franky dodges the shots but nearly falls off the Sea Train. Franky manages to hang on but Nero threatens to knock him off. As Nero attempts to kick Franky off of the Sea Train, Franky moves out of the way and pins him down with his four legs. Franky taunts Nero saying all he needed was to get in close. Meanwhile, Wanze continues yelling at Sanji for messing up his face. Sanji then tells Wanze to move out of the wave but Wanze reveals a last resort: Ramen Kenpo Ura Hiden: Men-Kiri Doku Bocho. Wanze tells Sanji that one touch will kill him and that he should give up on saving Robin. Wanze charges at Sanji preparing to strike him with the poisonous blade but Sanji takes down Wanze with a very powerful Santen Découpage. The move returns Wanze's face to normal but sends him flying through two train cars into the one that CP9 is in. CP9 then spot Sanji not to far away. Meanwhile, Franky takes down Nero using his Ultimate Hammer and sends him crashing down into the train. Sanji and Franky both remark on how each were fighting. Sanji then turns his attention to CP9 saying they are the ones how kidnapped Robin and Rob Lucci stares at Sanji.\n"
}