{
  "chapter_number": "Episode 252",
  "title": "The Steam Whistle Separates the Crew! The Sea Train Begins to Run",
  "short_summary": "Paulie helps clear the name of the Straw Hat Pirates but does not tell the mob everything he knows. He gets the mob to follow Chopper so they can search for the rest of the crew. Nami goes her own way so she can rush to the Sea Train. As Nami nears the station, Sanji, ahead of her, approaches the train.\n",
  "long_summary": "At the Sea Train station, several marines and agents are gathering around and Robin is seen within the group as well. Corgi tells Robin that CP9 will be coming shortly and tells Robin to get onto the Sea Train. He orders two guards to take her onto the Sea Train. Close by and hidden, Sanji is seen and wonders what he should do. He notices that Robin could easily take down the guards but believes she is planning something. Suddenly, CP9 make their appearance with Rob Lucci leading the group and Blueno is carrying Franky and Usopp who the two keep yelling to let them go. Sanji is shocked to see that Usopp is captured as well. Usopp continues yelling out with Kaku punching his head to quiet him. Corgi compliments CP9's work but Lucci says it's not over until they reach Enies Lobby and tells everyone to board the Sea Train. Sanji wonders about the guys in the suit are but angrily comments about Usopp getting himself into trouble.\nAt the remains of Galley-La Company, the people have nearly put out the fire and Chopper is excited to hear from Nami that Robin doesn't hate them. The people are shocked to hear Chopper talking and even more shocked when he suddenly transforms into a \"gorilla\". Nami and Chopper agree to find the rest of the Straw Hat Pirates to let them know that Robin needs saving. Iceburg suddenly walks up telling Nami and Chopper to wait to tell them that the Sea Train is departing at eleven. He says that CP9 and Robin will be there and continues saying thanks to Aqua Laguna, all of the rest of the Sea Train departures will be stopped. Nami is horrified to hear that especially since they have only half an hour to get to the Sea Train but wonders since Iceburg is the mayor of Water 7, that he can stop the Sea Train. Iceburg tells Robin that the Sea Train is bound for Enies Lobby and is currently being run by the World Government so he has no power over it. Nami concludes that they must make it to the Sea Train and informs Chopper about Luffy and Zoro's locations. Paulie suddenly gets up and tells the people to help out Nami and Chopper. The people disagree still thinking the Straw Hats are responsible for Iceburg's attempted murder but Paulie tells them that they aren't the culprits and should just give up on Lucci and Kaku. Paulie agrees to take Nami to the station and the people ready to get the Yagara Bulls. Iceburg secretly talks with Paulie saying he doesn't want to hurt the people about the truth.\nIn town, Nami, Chopper, and some people are seen riding on Yagaras. Nami will go to the Sea Train Station while Chopper looks for the other Straw Hat Pirates. Chopper and the other citizens continue to call out for the others even for Usopp. Paulie helps Nami show the way to the station while Nami keeps track on time. Nami tells the Yagara to go faster determined to save Robin. Back at the Sea Train Station, Robin is seen on the Sea Train while Franky and Usopp are thrown into the back. Franky threatens the guards and the guards proceed to beat him up (including Usopp). Sanji looks over the Blue Station but is frustrated to hear that the Sea Train will be departing at an earlier time. Back on the train, Kalifa says that after all the years, their mission is complete. However, Lucci angrily tells her not to talk nonsense as they aren't at Enies Lobby yet.\nNami is still trying to reach the Sea Train in time while Iceburg wishes for Franky's safety. The other people are still trying to find the other Straw Hat Pirates with Chopper leading the search party. Sanji wonders how the others are dealing with the situation but decides to board the Sea Train without them. Luffy is then seen stuck between some walls yet again trying to free himself. Zoro is now stuck in a chimney and is having similar problems. Back on the Sea Train, CP9 is informed on the Sea Train's early departure and Lucci says he has no feelings about leaving Water 7 after many years. Sanji is seen walking down the stairs while, nearby, Nami hears the whistle Paulie tells her that the Sea Train may be departing earlier than usual. Paulie knows it's because of the storm and that the World Government can leave whenever they want. The Sea Train is finally ready to depart and Robin remembers how Luffy rescued her and allow her to join his crew. Sanji closes in onto the Sea Train while Nami has finally just arrived. Nami heads down the stairs but is too late. Nami tearfully calls out to Robin as the Sea Train leaves out of sight.\n"
}