{
  "chapter_number": "Episode 231",
  "title": "The Franky Family and Iceburg!",
  "short_summary": "The people who attacked Zoro reveal themselves to be the feared \"Franky Family\", although, they are no match for Zoro. Luffy has their gold exchanged for cash. Afterwards, they meet a man who resembles Usopp, Galley-La Company's carpenter employment foreman, Kaku. Two of the suitcases of money are stolen by the Franky Family, while Luffy was talking to Iceburg.\n",
  "long_summary": "The men who raided the ship reveals themselves to be a group of bounty hunters known as the Franky Family. Zoro defeats the bounty hunters easily using the Nitoryu Sai Kuru move.\nAt the gold exchange, the Straw Hats exchange their gold from Skypiea for money. Surprised at how much gold was exchanged, the teller consults the owner, who takes them to the VIP room to inspect the gold. Due to the historical value of the gold, the appraiser gives 300 million beli. Upon walking out of the gold exchange, they are overheard by the Franky Family.\nThe Straw Hats return to the location where the crowd was. They decide to look for Iceburg, one of the members of the Galley-La. Instead, they meet with Kaku, another member of the company, who agrees to help repair the ship. To their shock, however, Kaku jumps off Shipcrafting Island and leaps extremely high into the air.\nMeanwhile, Sanji buys fruit from one of the market vendors. He is told to also visit the fish store to buy fish, but he struggles to navigate the maze-like sidewalks. He then sees Robin, who is following the masked figure. However, when Sanji follows Robin around a corner, Robin is nowhere to be found.\nAt the shore where the Going Merry is anchored, Kaku arrives to assess the damage. He accidentally wakes Zoro, who confronts him.\nAt the Shipbuilding Island, Iceburg and his secretary, Kalifa, identify the Straw Hats as pirates, and finds that three out of the seven members are wanted. Initially, they do not act against the Straw Hats, but after Luffy refers to Iceburg as \"that guy,\" Kalifa beats Usopp for lacking the respect towards Iceburg. She then, however, kicks Iceburg in the face for warning the Straw Hats about her temper. Luffy shows Iceburg the letter from Kokoro, to which Iceburg rips up the letter, then says that Kaku has already assessed the damage and repair price.\nUsopp then realizes that his money had been stolen. The Franky Family members laugh as they escape with their money.\n"
}