{
  "chapter_number": "Episode 53",
  "title": "The Legend Has Begun! Head to the Grand Line",
  "short_summary": "Miraculously saved from death by an unnatural green gust and a lightning bolt to Buggy, the Straw Hats rush out of Loguetown. Then Smoker catches Buggy and Alvida and gets on a Dune Buggy to follow Luffy. Meanwhile Luffy, Zoro, and Sanji run into Tashigi whom Zoro fights and beats quickly. Then Smoker catches up and tells Luffy that if he beats him he can go to the Grand Line. Just when Smoker is about to finish Luffy, a mysterious man named Dragon saves him. And a green gust of wind lets Buggy and Alvida escape. Then Luffy and company get away and head to the Grand Line! Smoker, Tashigi, Alvida, and Buggy also decide to go to the Grand Line!\n",
  "long_summary": "After, escaping death by luck, Luffy, Zoro, and Sanji head for the Going Merry, but Buggy and Alvida are in pursuit. Before the duo can take off they are captured by the Marines, but the duo later escape. On the way Tashigi appears and challenges Zoro to a duel for lying to her, Zoro points out that he didn't lie, he just didn't tell her. Nevertheless, Zoro and Tashigi clash swords.\nMeanwhile, Nami and Usopp reach the Going Merry as Mohji was about to burn it down. Before Mohji can properly fight Nami, the Marines catch up and shoot at Mohji. Nami and Usopp take this opportunity board the Going Merry and set sail.\nAt the same time, Luffy and Sanji run into Smoker, who plans to catch Luffy. Sanji goes on, while Luffy and Smoker engage in battle. Luffy's efforts to defeat Smoker are knocked back however and Smoker seemingly defeats him, but a mysterious figure stops Smoker and releases a strong gust of wind, thus giving Luffy time to escape. As Zoro also flees, Sanji reaches the shore, but is surrounded by the marines. After this, Usopp uncharacteristically risks his life by diving into the sea, shooting down the marines with his slingshot, and finally swimming to Sanji. Luffy and Zoro catch up. Luffy then uses his Gomu Gomu Rocket to propel Sanji, Usopp, and Zoro to the Going Merry.\nSmoker, Tashigi, Buggy and Alvida decide to chase them to the Grand Line as they gather up in different teams. The Straw Hat crew is ecstatic to go to the Grand Line as they all make their vows before setting sail.\n"
}