{
  "chapter_number": "Episode 117",
  "title": "Nami's Whirlwind Warning! Clima-Tact Explosion",
  "short_summary": "Nami faces off against Miss Doublefinger and tries to figure out the new weapon that Usopp made for her, the Clima-Tact.\n",
  "long_summary": "Vivi cannot believe that Luffy is dead. Crocodile proceeds to tell her that Luffy would have still been alive had he not gotten involved with her. Vivi refuses to believe this and demands that Crocodile tell her where Luffy is.\nMeanwhile the battle between the rebels and the Royal Army is still going on. Nami remarks that Vivi's plan to stop the rebel army at the entrance must have failed. She wonders if Vivi and the others are all right as they are all fighting while she is running and hiding.  She thinks back to the day where she asks Usopp to make her a weapon so she can be strong enough not to endanger the others. Being a couple of ordinary humans with no special abilities, she says she knows that Usopp can empathize with her. Usopp agrees to make her weapon.\nMiss Doublefinger finds Nami while she is hiding and stabs her shoulder using her Toge Toge no Mi abilities which allows her to grow spikes on any part of her body. Nami takes out her Clima-Tact and decides to fight her as she recalls Usopp telling her the features of her new weapon that has elemental powers.\nShe tries her first move, Fine Tempo, which made doves appear. She is disappointed as this \"attack\" is nothing more than a party trick. She remains optimistic thinking that at least the move has caught the enemy off guard. She tries her second move, Cloudy Tempo, which causes flowers to spout when a button is pushed. Miss Doublefinger, seeing Nami's weak attempts to attack her, feels sorry for her but proceeds to attack her with her spikes. Nami barely dodges her but is determined to fight back. She drops her Clima-Tact, but seeing no threat from Nami's weapon, Miss Doublefinger gives it back to her.\nNami launches her third move, Thunder Tempo, where a boxing glove springs from the weapon. Miss Doublefinger loses patience and attacks Nami, which she dodges. She hides and continues to read the Clima-Tact instructions desperate to find a move that can damage her enemy. She finds battle configurations at the back of the instructions. She discovers each of the three batons of her weapon have special qualities. The first can create hot air, emitting a hot ball. The second can create cool air, emitting a cool ball, and the third can create electricity, emitting a thunderball. She tests this out, but Usopp's instructions state that these features have not yet been perfected but can be used at parties.\nMiss Doublefinger proceeds to attack Nami again, and she runs away. Nami is stabbed on her calf, and she falls down. Just as Miss Doublefinger is about to give the finishing blow, Nami swings her Clima-Tact and she unintentionally uses the Cyclone Tempo, the effect of which is like a boomerang. As she is studying her weapon, Nami has her back turn against her enemy which insults Miss Doublefinger and causes her to attack Nami. Nami is seemingly skewered by the attack, but a dove flies towards the skewered Nami revealing that it was just an illusion. Nami explains that she used the Mirage Tempo where her Clima-Tact allowed her to create a mirage of herself. Finally getting a better understanding of how the Clima-Tact works, Nami tells Miss Doublefinger that she is now ready to actually fight.\nMeanwhile, Crocodile has taken Cobra and nails him to the palace walls. Vivi and Chaka are unable to do anything. He tells them that he has no intention of keeping Cobra or Vivi alive and will kill them after he gets what he has really been after since the very beginning. He then asks Cobra where the Pluton is. Cobra is shocked by this question and demands to know how Crocodile knows this name.\nRoughly at timing 19:57, Crocodile was seen lighting his cigar with both hands (his hook is nowhere to be seen, and so are his numerous rings).\n",
  "characters": [
    "Nefertari Vivi",
    "Crocodile",
    "Nefertari Cobra",
    "Chaka",
    "Nico Robin",
    "Nami",
    "Usopp (flashback)",
    "Monkey D. Luffy (flashback)",
    "Tony Tony Chopper (flashback)",
    "Roronoa Zoro (flashback)",
    "Miss Doublefinger"
  ],
  "ssum_frequencies": [
    [
      "the",
      2
    ],
    [
      "nami",
      1
    ],
    [
      "faces",
      1
    ],
    [
      "off",
      1
    ],
    [
      "against",
      1
    ],
    [
      "miss",
      1
    ],
    [
      "doublefinger",
      1
    ],
    [
      "and",
      1
    ],
    [
      "tries",
      1
    ],
    [
      "to",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "her",
      34
    ],
    [
      "the",
      29
    ],
    [
      "to",
      25
    ],
    [
      "she",
      25
    ],
    [
      "is",
      18
    ],
    [
      "and",
      18
    ],
    [
      "nami",
      15
    ],
    [
      "that",
      13
    ],
    [
      "a",
      13
    ],
    [
      "of",
      10
    ],
    [
      "miss",
      8
    ],
    [
      "doublefinger",
      8
    ],
    [
      "weapon",
      7
    ],
    [
      "can",
      7
    ],
    [
      "he",
      6
    ],
    [
      "which",
      6
    ],
    [
      "climatact",
      6
    ],
    [
      "has",
      6
    ],
    [
      "attack",
      6
    ],
    [
      "but",
      6
    ]
  ]
}