{
  "chapter_number": "Episode 46",
  "title": "Following the Straw Hat! Little Buggy's Big Adventure",
  "short_summary": "Following his defeat by Luffy, Buggy travels through various islands to relocate his crew and pursue Luffy. He eventually meets Gaimon before forming an alliance with Alvida.\n",
  "long_summary": "As the crew sail towards Loguetown, Nami wonders about Buggy's whereabouts. After being launched into the air by Luffy, he is sent to an uninhabited island with many of his body parts still missing. He escapes on a raft to a second island, where he is captured by an aggressive bird. The bird attempts to eat Buggy, but spits him out into the sky.\nBuggy is sent to a third island, this time the Island of Rare Animals, where he is confronted by Gaimon. After discovering Buggy is not a poacher targetting the animals, Gaimon befriends him, drinking by a campfire. The next day, Buggy attempts to leave to another island, but his raft is destroyed by a Sea Beast. He is rescued by Alvida, who had since grown much thinner since her battle with Luffy. Sailing on Alvida's ship, they decide to form an alliance as they were both pursuing the same target, Luffy.\nBack in the present day, nightfall arrives and the crew go to sleep.\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Sanji",
    "Usopp",
    "Nami",
    "Buggy",
    "Gaimon",
    "Alvida"
  ],
  "ssum_frequencies": [
    [
      "his",
      2
    ],
    [
      "luffy",
      2
    ],
    [
      "following",
      1
    ],
    [
      "defeat",
      1
    ],
    [
      "by",
      1
    ],
    [
      "buggy",
      1
    ],
    [
      "travels",
      1
    ],
    [
      "through",
      1
    ],
    [
      "various",
      1
    ],
    [
      "islands",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      10
    ],
    [
      "to",
      8
    ],
    [
      "is",
      7
    ],
    [
      "by",
      6
    ],
    [
      "a",
      6
    ],
    [
      "he",
      5
    ],
    [
      "island",
      5
    ],
    [
      "buggy",
      4
    ],
    [
      "luffy",
      3
    ],
    [
      "an",
      3
    ],
    [
      "as",
      2
    ],
    [
      "crew",
      2
    ],
    [
      "after",
      2
    ],
    [
      "into",
      2
    ],
    [
      "sent",
      2
    ],
    [
      "with",
      2
    ],
    [
      "of",
      2
    ],
    [
      "his",
      2
    ],
    [
      "on",
      2
    ],
    [
      "raft",
      2
    ]
  ]
}