{
  "chapter_number": "Episode 272",
  "title": "Luffy is in Sight! Gather at the Courthouse Plaza",
  "short_summary": "As Gomorrah recovers, it is revealed by Chopper that he is blinded, he continues to rush ahead. Spandam receives word of their progress right as the Straw Hats reach the gate. Zoro slices right through it and while on the rooftop, Luffy activates \"Gear 2\" for the first time to fight against Blueno.\n",
  "long_summary": "Gomorrah, despite being hit by the giant iron balls of the Just Eleven Jurymen, gets back up and continues to advance once again. However, one of the attacks hit his head and damaged his retinas, blinding him; the ride gets rough as Gomorrah crashes against buildings. Chopper tells everyone that Gomorrah had made a promise to Sodom, that he would take them to the courtyard. He is also motivated to help the Straw Hats and Franky Family rescue Franky, the man who saved him and Sodom from being eaten by a Sea King and eventually made them part of the Family. Gomorrah continues charging, but a dead-end loom ahead. Zoro and Sanji break through the intervening building and Gomorrah finally collapses, but he has succeeded. Marines sound the alert; the intruders have successfully crossed the Main Island and reached the Courthouse Plaza.\nWhile Spandam is talking to himself, a marine barges in, nearly making Spandam order the Buster Call. Spandam finally finds out that his Den Den Mushi is off the hook, and that there is an emergency on Enies Lobby. Spandam begins bragging to Robin about how weak the Straw Hat Pirates are. He haughtily asks the agent on the other end if the Straw Hats got accidentally killed, but the agent's reply removes any smugness from Spandam's face: There are approximately 60 intruders total (The Straw Hat Pirates are known, but the Franky Family and Galley-La Shipwrights are not). In spite of the massed resistance of the Marines and agents, they have successfully crossed the Main Island and are outside the Courthouse. Oimo and Kashii have defected (due to Sogeking revealing Dorry and Brogy were never captured) and are now crossing the main island as well, leaving another trail of destruction in their wake. Total casualties to this point total not five, but over 2000. Luffy is responsible for over 1,000 of those casualties; worse, they lost track of him after he rocketed himself towards the Courthouse.\nMeanwhile, the Franky Family and the remaining Straw Hats contemplate their next course of action when another Juror's ball is hurled at them. But Yokozuna blocks it with his immense strength. Sanji then follows the chain back, locates, and defeats three of the Jurors. Meanwhile, Zoro cuts away part of the Courthouse door, opening a way inside. With enemies quickly approaching, everyone forms up. Remembering what Kokoro told them, the Frankly Family split into three teams. Mozu and Kiwi lead two groups towards the towers while Zambai leads the rest into the Courthouse to back up the Straw Hats.\nSpandam begins to panic as the gravity of the \"worst day in the history of Enies Lobby\" dawns on him. He rushes to the front window and looks outside. There, he sees Blueno atop the Courthouse (Luffy is down a hole and not visible) and tries to figure out what is happening. Soon, Luffy re-emerges from the hole, having been momentarily disoriented from getting his face turned into a door. Blueno resumes his attack, but Luffy continues to track him in spite of Soru, dodges a Shigan and manages to deflect a Rankyaku away from him. Luffy then declares that he cannot finish the fight in his current state. Explaining he needed a way to be stronger in order to protect his friends, he reveals a new technique he developed in order to take his abilities \"one step\" higher. He calls it \"Gear 2\".\n"
}