{
  "chapter_number": "Episode 112",
  "title": "Rebel Army vs. Royal Army! The Battle will be in Alubarna!",
  "short_summary": "The revolution is about to start and the Straw Hat crew comes up with a plan that could possibly stop it. Meanwhile, Vivi is screaming for the revolution to stop but Koza cannot hear her.\n",
  "long_summary": "Luffy is with Pell and he continues to tell Pell that he needs meat. Since Luffy is badly injured from his last encounter with Crocodile, Pell tells him that he does not need food, he needs a doctor right away. But Luffy pull his clothing and tells him that he will make Crocodile pay for what he did to Vivi and Toto.\nMeanwhile, the Rebel Army is still on their way to Alubarna to attack the Royal Army. The elite members of Baroque Works wait for Vivi and the rest of the Straw Hat Pirates to show up. Unexpectedly, Mr. 4 spots them approaching Alubarna on ducks, who are part of the Super Spot-Billed Duck Troops (or Hikoichi). Vivi and the Straw Hats are all wearing similar cloaks, so it is difficult for the Baroque Works members to spot which one is Vivi. Vivi and the Straw Hats split up in different directions, which forces the Baroque Works members to split up as well.\nAfter everyone is successfully broken into groups, the people on the ducks reveal who they are. But Princess Vivi is not in any of the groups, she did not run off with everyone else. Vivi and Karoo stand outside of Alubarna city in order to stop the Rebel Army and the Royal Army from fighting with each other. Koza sees someone in front of the city but thinks he is hallucinating. Then a cannon was shot prematurely by a Royal Army Guard, who is actually a member of the Baroque Works team. Vivi and Karoo are still standing but cannot see what is in front of them because of all the dust. Vivi shouts to Koza, yelling \"Leader\" (a name Koza had since they were kids). Koza hears it but still thinks he is imagining things during the commotion. Vivi is knocked over and sees that there are camels coming her way. Karoo acts quickly and covers her with his body and instead of her getting trampled he got trampled. Vivi gets up and sees what he did and begins to cry and tells Karoo that she will stop it no matter what. \nUsopp appears on a horse, but it is actually Mr. 2. Vivi notices that it isn't actually Usopp because he calls Karoo, \"That Bird.\" Vivi does not believe that the real Usopp would call Karoo that after as much as they had been through on Little Garden. She then tells the fake Usopp to prove himself with the bandage that the crew had wrapped around their arms (in previous episodes).\nThe scene then goes to Sanji telling the real Usopp and Matsuge to wake up because they had been beaten up and knocked out. It goes to a flashback of how they set up the bandages to identify the real members of their team. Mr. 2 reveals that he isn't really Usopp, but that Crocodile told the elite members of Baroque Works that all the Straw Hat Pirates had bandages on their arms.\n"
}