{
  "chapter_number": "Episode 84",
  "title": "The Blue-Nosed Reindeer! Chopper's Secret",
  "short_summary": "Nami asks Chopper to join the crew, but he claims he is not interested. Kureha tells Nami some of what was Chopper's background. After realizing the abilities that Chopper has, Luffy is eager to make him join the crew.\n",
  "long_summary": "Nami finds herself surprised, as the strange creature she met when she woke up is able to talk. It appears to be worried about her health, but acts scared and clumsy. Dr. Kureha calls him Chopper. She informs Nami, whose fever has gone down, that her sickness was caused by a disease-carrying bug-bite and that it would have killed her in two more days. Because of the severity of her sickness, Kureha tells Nami she has to stay for at least three more days in order to recover.\nIn the meantime, Chopper looks after Luffy and Sanji in another room. He then remembers their arrival at the top of the mountain. Sanji had several injuries and Luffy was wearing his usual clothes, so he suffered from insufficient heat. As Kureha inspected Nami, Luffy grabbed Kureha's arm, telling her they were his friends.\nWhile Chopper is lost in this memory, Luffy awakens, hungry as usual. Chopper, who sees that Luffy wants to eat him, gets scared again. Sanji also starts to wake up and scares Chopper even more. Both chase after him, stopping for a moment when they see Nami. When they continue chasing Chopper, Nami asks Kureha about him, who tells her that Chopper is “just a reindeer with a blue nose” who ate a devil fruit, the Hito Hito no Mi, enabling him to speak and walk around like a human. In the meantime, Chopper transforms into a bigger and more muscular version of himself in order to break up from his pursuers. Kureha also mentions that she taught Chopper everything about medicine.\nAt the foot of the mountain, Wapol and his two followers, Chess and Kuromarimo, are still on the search for Luffy to get their revenge.\nIn the village, which was buried by the avalanche, everyone except Zoro digs the snow in search for Dalton. When they find him, he appears to be dead, as he has no pulse. Luffy and Sanji, who lost track of Chopper, are in the same room with Kureha. Luffy asks her to join their crew, as they still need a doctor on board. After another attempt of hunting down Chopper, both of them are being chased away by Kureha and discover that the castle is filled with snow. Chopper stays with Nami, who asks him to be the crew's doctor. Later on, Kureha tells Nami that convincing him will not be easy. She explains that Chopper had a difficult past because he was born with a blue nose. After he had eaten the devil fruit, he became even more different than the other reindeer. Being hated and feared by both reindeer and humans, he was left all by himself.\nWhen Luffy and Sanji want to close the gate in order to prevent more snow from entering the castle, Chopper transforms into his muscular form again to stop them. Sanji realizes that there is a nest of birds which would fall if the gate was closed. They stop without a fight, but call Chopper a monster because of his abilities and appearance. This causes the reindeer to leave while he is crestfallen. Nevertheless, Luffy likes Chopper's strangeness and wants him on his crew.\n"
}