{
  "chapter_number": "Episode 82",
  "title": "Dalton's Resolve! Wapol's Forces Land",
  "short_summary": "Dalton faces Wapol, but only gets himself hit by arrows thrown by his former comrade, Chess. An avalanche stops the battle, but injures Sanji. Luffy must carry both Nami and Sanji to the doctor, and begins climbing the mountain.\n",
  "long_summary": "Luffy (while carrying Nami) and Sanji are trying to escape from the avalanche. While they are running, Sanji spots a cliff and tells Luffy that they need to get to a high place. Both made it to the cliff but the avalanche reaches them anyway. In different towns surrounding the Drum Rockies, some people prepare for the upcoming arrival of Wapol, as they follow Dalton to Bighorn. Vivi and Usopp are riding a sled trying to get to Gyasta, but they miss the sign. In Bighorn, Wapol is eating buildings while being accompanied by his Bliking Pirates. Kuromarimo informs Wapol that the Straw Hats are searching for a doctor because one of their crew is sick, and that Kureha has been living in the Drum Castle while he was absent. Dalton arrives to Bighorn, jumps, and slashes Wapol's chest. Wapol is quickly operated on by the Isshi-20 and stands up again. After failing to convince Wapol to leave the country, Dalton transforms into a bison-human hybrid. Two persons in Wapol's crew comment and complement each other the Ushi Ushi no Mi, Model: Bison.\n",
  "characters": [
    "Monkey D. Luffy",
    "Sanji",
    "Nami",
    "Dalton",
    "Nefertari Vivi",
    "Usopp",
    "Wapol",
    "Robson",
    "Kuromarimo",
    "Chess",
    "Isshi-20",
    "Roronoa Zoro"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "but",
      2
    ],
    [
      "by",
      2
    ],
    [
      "sanji",
      2
    ],
    [
      "and",
      2
    ],
    [
      "dalton",
      1
    ],
    [
      "faces",
      1
    ],
    [
      "wapol",
      1
    ],
    [
      "only",
      1
    ],
    [
      "gets",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      11
    ],
    [
      "to",
      10
    ],
    [
      "and",
      7
    ],
    [
      "a",
      5
    ],
    [
      "wapol",
      5
    ],
    [
      "while",
      4
    ],
    [
      "are",
      4
    ],
    [
      "they",
      4
    ],
    [
      "in",
      4
    ],
    [
      "that",
      3
    ],
    [
      "dalton",
      3
    ],
    [
      "bighorn",
      3
    ],
    [
      "is",
      3
    ],
    [
      "luffy",
      2
    ],
    [
      "sanji",
      2
    ],
    [
      "trying",
      2
    ],
    [
      "avalanche",
      2
    ],
    [
      "cliff",
      2
    ],
    [
      "get",
      2
    ],
    [
      "but",
      2
    ]
  ]
}