{
  "chapter_number": "Episode 172",
  "title": "Ordeal of Swamp!! Chopper vs Priest Gedatsu!",
  "short_summary": "Chopper is attacked by Gedatsu, who turns out to be not very smart, and eventually defeats him, sending him plummeting to the Blue Sea.\n",
  "long_summary": "The battle still continues between the Shandia warriors and Divine Soldiers. Robin, still in the ruins, explores it. She finds a monument which she commented must have been erected after the city fell and she found out that the name of the ancient city is called Shandra. Robin continued to make notes of what she had learned regarding Shandra; she said herself that she would continue to explore and may find some clue to the True History, which she could not find on the sea below. Just as she was observing and taking notes, Yama appeared. Robin asked if Yama was one of God's Army and Yama was upset hearing that, stating he is the Divine Soldiers' leader. He introduced himself to Robin and she inquired what he wanted of her, which Yama answered she would see soon enough.\nChopper in a scared expression before Gedatsu, commented on how Gedatsu's eyes are rolled back and his white eyes appear scary. A Divine Soldier tells Gedatsu to direct his eyes, so as to see the enemy and Gedatsu did so in a shocked expression. This surprised Chopper who then thought Gedatsu to be stupid. Chopper realized Gedatsu was an enemy and said to Gedatsu that he must be one of the priests. Gedatsu introduced himself and his Ordeal however, he was not speaking out loud. The Divine Soldier again told Gedatsu to speak out loud or else he will not be heard. Gedatsu, surprised, said he was careless and told Chopper he is in the Ordeal of Swamp which has a 50% survival chance, but only due to his incompetence, otherwise it would be 5%. Gedatsu, flying on his Milky Dial, commented that a tanuki is not worth his time and attempted to attack Chopper with the Numagumo Burger. However, the attack hit the Divine Soldier instead. Chopper realized it is a cloud attack that cannot come off and sucks the victim in the more the victim tries to fight off the cloud.\nJust then, Gedatsu spotted Chopper and threw him another Numagumo Burger which Chopper dodged. Chopper ran towards the Divine Soldier and saved him. Gedatsu chastised the Divine Soldier for allowing himself to be saved by Chopper. The Divine Soldier then challenged Gedatsu which gave Chopper some motivation to fight. Gedatsu then attacked the Divine Soldier with Jet Punch which killed him. Chopper began to run but was challenged by Gedatsu. Gedatsu launched a Jet Punch on Chopper. However, Chopper bit the Rumble Ball and used his Jumping Point to evade the attack. The battle between Gedatsu and Chopper then began.\nYama began his attack on Robin. Robin became upset that Yama was destroying the ruins which Yama couldn't care less about. Yama used the Punch Mountain on Robin which destroyed another ruin making Robin call Yama a fool. Meanwhile, Luffy is still trying to find his way out of the \"cave.\"\nChopper finally found that Gedatsu's weak point was his feet and climbed up the ruins to grab onto Gedatsu's foot. Gedatsu, not aware of what is going on, kicked Chopper away and launched another Numagumo Burger. Chopper dodged the attack and jumped into the sky. Gedatsu commented the sky is where he fights his battles and followed Chopper. Only upon jumping into the sky, did Gedatsu notice that one of his shoes were missing. He launched another Jet Punch which missed Chopper, who then retaliated by attacking Gedatsu using Arm Point: Obit Cross. Gedatsu falls into the swamp and Chopper was temporarily relieved, until he saw Gedatsu still moving. Chopper began to yell for Gedatsu to sink deeper into the swamp. Gedatsu tried using the Milky Dial on his other foot to escape but that pushed him all the way into the swamp; Chopper then praised himself for beating Gedatsu.\nAisa is then seen on a dial boat and she heard Gedatsu's defeated voice and commented to herself about another priest being defeated. Just then, her boat stopped working and a Sky Shark began to attack her and ate half her boat. She was then rescued by Conis and Pagaya before the shark would eat her. Conis introduced Su and Pagaya to Aisa. Aisa requested to be taken to Upper Yard and Conis mentioned they were on their way there to lead the Straw Hats out of Skypiea. Aisa then told them the Straw Hats were already on their way out and Conis implored Aisa to lead them to the Straw Hats.\nChopper is then shown applauding himself of finally being a pirate and commented on finding the gold himself. He wondered if there is gold \"over there,\" which resembles a bean stalk. He says that maybe the rest of the exploration crew would arrive there soon.\n",
  "characters": [
    "Nico Robin",
    "Yama",
    "Tony Tony Chopper",
    "Gedatsu",
    "Monkey D. Luffy",
    "Aisa",
    "Conis",
    "Pagaya",
    "Su"
  ],
  "ssum_frequencies": [
    [
      "to",
      2
    ],
    [
      "him",
      2
    ],
    [
      "chopper",
      1
    ],
    [
      "is",
      1
    ],
    [
      "attacked",
      1
    ],
    [
      "by",
      1
    ],
    [
      "gedatsu",
      1
    ],
    [
      "who",
      1
    ],
    [
      "turns",
      1
    ],
    [
      "out",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      47
    ],
    [
      "and",
      31
    ],
    [
      "to",
      29
    ],
    [
      "gedatsu",
      26
    ],
    [
      "chopper",
      24
    ],
    [
      "a",
      13
    ],
    [
      "he",
      13
    ],
    [
      "his",
      13
    ],
    [
      "she",
      12
    ],
    [
      "of",
      12
    ],
    [
      "on",
      12
    ],
    [
      "then",
      12
    ],
    [
      "which",
      11
    ],
    [
      "that",
      11
    ],
    [
      "is",
      11
    ],
    [
      "was",
      11
    ],
    [
      "divine",
      9
    ],
    [
      "yama",
      9
    ],
    [
      "robin",
      8
    ],
    [
      "soldier",
      7
    ]
  ]
}