{
  "chapter_number": "Episode 32",
  "title": "The Witch of Cocoyasi Village, Arlong's Female Officer",
  "short_summary": "Luffy, Sanji, and Yosaku capture the Arlong Pirates' Sea Beast, Momoo, forcing him to carry the boat to Arlong Park. Meanwhile, Arlong travels to Cocoyasi Village to confront a man for perceived rebellion, but Usopp stops him from destroying the entire village.\n",
  "long_summary": "Luffy, Sanji, and Yosaku eat outside on the deck, but the food attracts Momoo, the Arlong Pirates' Sea Beast who resembles a cow. Momoo attacks the ship for the food, but Luffy and Sanji fight back, knocking him back into the sea. Luffy forces Momoo to carry the ship to Arlong Park.\nUsopp is brought to Nojiko's house, where Chabo reveals his father was killed by Arlong when Gosa Village was destroyed. Usopp is informed of Nami's allegiance to Arlong. Nojiko reveals she is also Nami's adopted sister. Usopp laments Nami's betrayal, despite believing she genuinely enjoying her experience with the crew.\nMeanwhile, Zoro is confronted by Arlong and Nami, where he notices Nami's strange reaction to the mentioning her mother's death. He attempts to escape by jumping into the gate pool, but is unable to swim due to him being bound with rope. Nami dives into the pool and rescues him, but orders the pirates to incarcerate him. At that point, a fish-man reports spotting Usopp near Cocoyasi Village, prompting Arlong to travel to the town. While he is gone, Zoro defeats all pirates stationed at the base.\nIn Cocoyasi Village, Usopp and Nojiko hide from Arlong, who confront a man, Genzo, for possession of a weapon. Nojiko reveals that Arlong sees humans as inferiors for him to use as he pleases, forcing all citizens under his reign to pay him a monthly tribute to him in exchange for their lives. He destroyed Gosa Village because of the failure of one person to pay the tribute. Arlong reveals his intentions to use the funds to dominate all of East Blue.\nDeeming the mere possession of a weapon as a form of rebellion, Arlong decides to execute Genzo. However, Usopp interferes, shooting him with his slingshot standing on a house. Enraged, Arlong lifts the house off its foundation, slamming it into the neighbouring house. Fearing the loss of another stream of income, Arlong's crew restrain him to prevent him from destroying Cocoyasi Village.\nGenzo's wounds are treated, and Nami visits a marked grave atop a cliff. She states her intentions to raise one hundred million bellies to buy her village back from Arlong.\nGenzo makes his first appearance in the anime.\n"
}