{
  "chapter_number": "Episode 70",
  "title": "An Ancient Island! The Shadow Lurking in Little Garden!",
  "short_summary": "As the Straw Hat Pirates sail toward Little Garden, the Baroque Works officer agents Mr. 3 and his partner Miss Goldenweek receive new orders. Finally arriving there, the Straw Hats find the island to be populated by prehistoric animals. Frightened, Nami and Usopp stay behind on the ship as the others spread out to search the island for food and adventure. Nami remembers having read about the island in a book, but by the time she remembers it, a giant approaches through the forest.\n",
  "long_summary": "Luffy asks if it will to snow again and Zoro responds there is no way it would. Luffy says to Zoro that it does snow, but he did not notice it last time because he was asleep. Luffy asks Vivi if she think it will snow and she answers that the first sea that they were at was special, since the magnetic forces mess everything up. She also warns the crew never to underestimate the Grand Line sea as an ironclad rule. Vivi gets mad about how everyone is acting, not taking anything seriously enough. Sanji leaves out the kitchen, having prepared 9 drinks for the crew. Karoo Nami assures her that when things get rough, they know how to handle it. Vivi realizes she is right when a colossal dolphin attacks them, making everyone rush to their stations to outrun the gigantic threat. After that, the crew see the mysterious Little Garden island shrouded in fog as everyone gets excited to encounter their second island in their trip on the Grand Line.\nThe scene goes to Mr. 3 and Miss Goldenweek, who are seen on Kyuka Island. While Mr. 3 is preparing himself an Earl Grey tea they discuss the downfall of Mr. 5 and Miss Valentine. Mr. 3 talks to Miss Goldenweek on how Mr. 5 is just \"an idiot with devil fruit powers\" who was overconfident in his position. He then states that they will teach whoever defeated Mr. 5 the terror of making a criminal organization their enemy.\nReturning to the crew, they remember what Miss All Sunday said about the island, stating that they will all be dead before they reach Arabasta. The crew gets restless as they see more of the island, but keeps on going due to lack of food and materials. As they enter the island, Sanji gets attacked by a gigantic bird signalling that this island is not normal at all. To reassure that notion, a huge tiger prowls beside the boat and then keels over with blood.\nLuffy them demands to visit the island, and Vivi comes with him because she does not want to dwell in her problems. So Luffy, Vivi and Karoo depart after Sanji has made a pirate lunch for the three of them. Zoro decides to take a walk, and Sanji asks him to get some edible-looking animals to bring back. Zoro makes a smart remark and challenges Sanji to see if he can get a bigger animal than him. Sanji furious with this, embarks onto the island to get more kilos than Zoro, and Zoro responds by saying they will compete for tons.\nCreeped out by the noises, Nami realizes that she remembers something about Little Island in a book and starts searching for it. Luffy and Vivi find a shellfish that looks like a squid, just as the sound of giant footsteps are coming from behind. As the time being, Sanji nearly gets eaten by a T. rex. Zoro encounters a Triceratops and wonders if it is edible. Luffy and Vivi also find a dinosaur, but this one is a Brachiosaurus.\nVivi then realizes what is happening on the island, saying due to the Grand Line being so dangerous nothing has been able to migrate from the island, preserving the unique ecosystem Little Garden has.\nNami tells Usopp about what inhabits the island, just as a giant mysterious figure is seen inside the jungle.\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nefertari Vivi",
    "Sanji",
    "Karoo",
    "Usopp",
    "Nami",
    "Mr. 3",
    "Miss Goldenweek",
    "Samurai Batts",
    "Pandaman",
    "Miss All Sunday (flashback)",
    "Bronte Zaurus",
    "Brogy (silhouette)"
  ],
  "ssum_frequencies": [
    [
      "the",
      10
    ],
    [
      "and",
      3
    ],
    [
      "island",
      3
    ],
    [
      "as",
      2
    ],
    [
      "straw",
      2
    ],
    [
      "to",
      2
    ],
    [
      "by",
      2
    ],
    [
      "nami",
      2
    ],
    [
      "remembers",
      2
    ],
    [
      "a",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      31
    ],
    [
      "to",
      21
    ],
    [
      "a",
      16
    ],
    [
      "and",
      15
    ],
    [
      "island",
      13
    ],
    [
      "that",
      11
    ],
    [
      "is",
      10
    ],
    [
      "they",
      10
    ],
    [
      "it",
      8
    ],
    [
      "vivi",
      8
    ],
    [
      "luffy",
      7
    ],
    [
      "zoro",
      7
    ],
    [
      "as",
      7
    ],
    [
      "sanji",
      7
    ],
    [
      "she",
      6
    ],
    [
      "mr",
      6
    ],
    [
      "of",
      6
    ],
    [
      "will",
      5
    ],
    [
      "crew",
      5
    ],
    [
      "gets",
      5
    ]
  ]
}