{
  "chapter_number": "Episode 168",
  "title": "The Python Strikes! The Survival Game Begins",
  "short_summary": "A giant python makes Luffy, Robin, Chopper, and Zoro split up while going to the ruins in the south. Gan Fall tells the history behind the war between the Shandias and the inhabitants of Sky Island. Shandia warriors move out to battle at the Upper Yard.\n",
  "long_summary": "The exploration team of the Straw Hats move out to find the gold and the rest of the crew sail out. While traveling through the forest, Chopper noticed that a tree root was moving. He ignored it saying to himself that the crew would make jest of him if he told them. Just then Luffy turned back and noticed the same thing as Chopper and commented on it, which got the attention of the other two. The tree root began to move and what appeared before them was a Giant Python.\nThe rest of the crew sailing down the Milky Road had Gan Fall with them. Gan Fall then told them of the history behind the war between the Shandia and the inhabitants of Sky Island. He further told them of how the Shandia, being the original inhabitants of the Upper Yard were driven out of their land and the Sky Islanders possessed it for selfish interest. This led to the war between the Shandia and the people of Sky Island. Gan Fall explained what transpired the rule of Enel as God. Sanji asked why the crew was attacked by a Shandia when they first arrived and Gan Fall explained to them that some enforcers seized by Enel escape via ship and are ultimately defeated by the Shandia. He told them that they may have been falsely recognized as being runaway enforcers. Gan Fall further explained the Citizens Sense of Crime which occurs when outsiders visit Skypiea. He was however, confused about what gold was and asked the crew traveling with him.\nGan Fall was shown in a flash back at one of his attempts at negotiating with the Shandia. Wyper, clearly angry, refused negotiating unless Gan Fall returned all of their land to them. Gan Fall stated he could not return everything as the Vearth was also useful to the people of Sky Island, who he thinks are innocent of the actions that transpired years back.\nWyper and the rest of the Shandia warriors prepare for battle with Wyper once again renewing his resolve to defeat Enel. He informed the warriors that only those prepared to leave the injured behind and continue battle should join him.\nThe rest of the Straw Hats in the forest get attacked by the giant python and in their attempt to escape from it, they get separated. The Shandia warriors move out to Upper Yard with the goal of reaching the God Shrine to take Enel out.\n"
}