{
  "chapter_number": "Episode 38",
  "title": "Luffy in Trouble! Fish-Men vs. Luffy Pirates!",
  "short_summary": "The crew face the Arlong Pirates as the villagers watch from the base entrance. Arlong throws Luffy into the sea, and Zoro and Sanji would be unable to rescue him before defeating their respective opponents.\n",
  "long_summary": "The crew break into Arlong Park and Luffy punches Arlong in the face. Hatchan recognizes Zoro as the fugitive swordsman, and seeing that Usopp is alive, the Arlong Pirates realize Nami betrayed them. Hatchan summons Momoo to eliminate the crew, but Luffy uses Gomu Gomu no Kazaguruma, knocking out Momoo and defeating all Arlong Pirates except for Arlong and his officers.\nHowever, Luffy is rendered immobile as he planted his feet into the concrete floor during the attack. Arlong's three officers step forward, and Hatchan attempts to cover Luffy with his squid ink, then crush him with debris. Even though this attack fails to harm Luffy, his feet are still stuck in the ground.\nSanji decides to battle Kuroobi, Zoro chooses Hatchan as his opponent, and Usopp accidentally angers Chew, who chases him. Chew notices the townspeople attempting to rebel, but is unable to suppress the rebellion, as Usopp formally chooses him as his opponent. Chew chases Usopp out of the base.\nAs Luffy is still immobile, Arlong decides to start a \"game,\" where he picks up Luffy along with a piece of the ground still attached to his legs. He throws Luffy into the pool to drown. Zoro and Sanji are unable to rescue him before defeating their respective opponents, as Kuroobi and Hatchan would have a physical advantage underwater.\n",
  "characters": [
    "Nami",
    "Arlong",
    "Monkey D. Luffy",
    "Kuroobi",
    "Hatchan",
    "Chew",
    "Take",
    "Nojiko",
    "Genzo",
    "Nako",
    "Sanji",
    "Usopp",
    "Roronoa Zoro",
    "Yosaku",
    "Johnny",
    "Momoo"
  ],
  "ssum_frequencies": [
    [
      "the",
      5
    ],
    [
      "arlong",
      2
    ],
    [
      "and",
      2
    ],
    [
      "crew",
      1
    ],
    [
      "face",
      1
    ],
    [
      "pirates",
      1
    ],
    [
      "as",
      1
    ],
    [
      "villagers",
      1
    ],
    [
      "watch",
      1
    ],
    [
      "from",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      13
    ],
    [
      "to",
      10
    ],
    [
      "and",
      8
    ],
    [
      "luffy",
      8
    ],
    [
      "as",
      7
    ],
    [
      "his",
      7
    ],
    [
      "arlong",
      6
    ],
    [
      "hatchan",
      5
    ],
    [
      "usopp",
      4
    ],
    [
      "is",
      4
    ],
    [
      "him",
      4
    ],
    [
      "into",
      3
    ],
    [
      "zoro",
      3
    ],
    [
      "he",
      3
    ],
    [
      "with",
      3
    ],
    [
      "still",
      3
    ],
    [
      "chew",
      3
    ],
    [
      "a",
      3
    ],
    [
      "crew",
      2
    ],
    [
      "in",
      2
    ]
  ]
}