{
  "chapter_number": "Episode 278",
  "title": "Say You Want to Live! We are Friends!!",
  "short_summary": "Robin finishes her story and says that while she considers the Straw Hats her friends, she believes that one day, they will no longer be able to protect her from her pursuers. She also fears that the Straw Hats will also betray her like the others did. After Spandam points out that taking in Robin means making the entire world your enemy, Luffy tells Sogeking to shoot the World Government flag. Sogeking uses his Fire Bird Star to burn the flag, declaring war on the World Government for Robin's sake, much to the shock of those present. Robin, moved by the depth of Luffy's action, cries out that she wants to live and wants to return to the sea with the Straw Hats. The rest of the Straw Hats then prepare to do battle with CP9 and save Robin.\n",
  "long_summary": "Saul fights the battleships, attempting to allow Robin to escape. She tries to board the evacuation ship, but per Spandine's orders, she is denied access. Vice-Admiral Kuzan, later known as Admiral Aokiji, enters the scene to engage in battle with Saul. While they fight, the evacuation ship is sunk by the fanatical Vice-Admiral Sakazuki, later known as Admiral Akainu. Saul, on the verge of dying, instructs Robin to flee on his raft. Persuaded by Saul's argument and Sakazuki's action, Kuzan helps Robin escape. From then on, Robin lives a life on the run, not being able to trust even the kindest of people, in a world that believes that her existence alone is a sin. In the present, Robin admits her greatest fear: to be seen as a burden by her crewmates and cast away, because being with her means having the world as their enemy. Finally knowing what kept her away, Sogeking, on Luffy's order, burns the Government's flag, declaring war against the World Government itself. Spandam, the Marines, and the World Government soldiers are absolutely shocked. Spandam howls at the Straw Hats that they cannot expect to live with the entire world as their enemy, but Luffy angrily bellows if he wants to bet on it. Robin begins crying after seeing her friends stay by her side. Luffy screams at Robin to say she wants to live, and the others encourage her. Robin remembers the words Saul told her- that she would find true friends who would never leave her, no matter what. Although she also thinks back to all the terrible things once said to her, she also remembers what Usopp told her: believe in Luffy. Breaking down in very heavy tears, she realizes the world had denied her a reason to live. Until now, she was never allowed to declare her own wish. She finally wails out that she wants to live, and for Luffy to take her out to sea with the crew. Luffy beams with a triumphant smile, while Franky sobs from being touched by what he has just seen. The Straw Hats prepare for battle against CP9 to rescue their beloved crewmate at any cost.\n"
}