{
  "chapter_number": "Episode 122",
  "title": "Sand Crocodile and Water Luffy! Death Match: Round 2",
  "short_summary": "Luffy fights Crocodile with more success this time by using water, but still loses the round. Meanwhile, the other Straw Hat Pirates hurry to locate the bomb before it goes off. Nico Robin forces King Cobra to take her to the tomb where the Pluton Poneglyph is hidden.\n",
  "long_summary": "With Crocodile lying on the ground, Luffy demands that he get up and fight. Crocodile laughs at this statement.\nMeanwhile, Vivi and the rest of the Straw Hats are in the Palace Square. Vivi explains that according to Crocodile, within ten minutes, a huge cannon will be fired, and once the cannon is fired, no one within a five-kilometer radius will survive, wiping out both the Rebel and Royal Army forces. Zoro tells them that they need to find the cannon and stop the cannoneer from shooting. Before they can go ahead and look for the cannon, some Baroque Works Billions find Vivi and try to bring her to Crocodile for a promotion. Sanji and Zoro volunteer to stay behind to deal with the agents while the others go ahead and split up to look for the cannon. \nCrocodile is still laughing at Luffy's statement, telling him that it will not be so easy to defeat him, since he is one of the Seven Warlords of the Sea. Luffy is unimpressed and says that if Crocodile is one of the Seven Warlords, then he is the eighth Warlord. Cobra cannot believe what he is hearing and is impressed by Luffy's confidence. He asks who Luffy is, and Miss All Sunday tells him that he is the one responsible for bringing Vivi back to Arabasta.\nEven though Luffy has figured out how to land a punch on Crocodile, the Warlord is still confident stating that even though Luffy can hit him, he can still absorb any fluid in Luffy's body. He proceeds to dehydrate Luffy's arm, which Luffy counters by drinking more water. The two continue their battle and Luffy reveals that he was planning to throw the barrel of water he was carrying to douse Crocodile in water. Crocodile predicts this move and counters it by conjuring a twister of sand, sending both Luffy and the barrel flying away. Luffy barely catches the barrel of water. Crocodile laughs at Luffy, telling him that this battle is no different from the first time they fought. Luffy proceeds to drink the whole barrel of water he was carrying and dubs himself as Water Luffy, showing a bloated stomach full of water, which shocks both Crocodile and Cobra and amuses Miss All Sunday. \nCobra attacks Luffy but Luffy squirts out water from his mouth and douses Crocodile with water, just as he planned, making the Warlord susceptible to Luffy's physical attacks. Luffy uses his Gomu Gomu no Bazooka technique and hits Crocodile directly to his stomach which sends him crashing. Crocodile is lying on the ground, not moving. Miss All Sunday removes the stakes impaling Cobra and demands that he show her the way to the Poneglyph. Cobra asks what she wants with it, but she subdues him and reiterates her demand. \nCrocodile gets up and calls Miss All Sunday by her real name, Nico Robin, telling her that she should get going now to the Poneglyphs. As Nico Robin and the King leave, Crocodile uses his Ground Secco technique which dehydrates all of their surroundings turning it to a desert wasteland. Luffy shoots water at Crocodile which he simply absorbs with his hand. He continues to suck the moisture out of ground, the effects of which are felt throughout the palace.\nWith eight minutes left until the explosion, Vivi, Pell and the rest of the Straw Hats scramble to find the cannon.\nMeanwhile, Cobra asks if Nico Robin is truly Miss All Sunday's name. He remembers that the name was known throughout the world twenty years ago. On their way to the Poneglyphs, they encounter Tashigi and a bunch of Marines. Tashigi refuses to let them pass, but Robin uses her abilities to incapacitate some of her men. Seeing the ability, a Marine recognizes who she is and tells Tashigi that twenty years ago, when she was eight years old, Robin earned a bounty of 79,000,000 for sinking six Marine ships, classifying her as a first-degree risk. After the incident, she was said to have vanished and never heard from again. After hearing about her reputation, Tashigi commands her men to go to the Palace Square to stop the explosion, deeming it useless for so many men to fight against someone with her power. She stays behind, deciding to fight her, but Robin uses her ability against Tashigi and easily defeats her.\nIn the palace, the entire lawn has turned to sand. Crocodile is able to sneak up on Luffy and grab him by the neck. Luffy spits water at Crocodile but misses and he proceeds to absorb all of the water in Luffy's body, dehydrating him. Luffy's signature straw hat is shown to be blown away by the wind. While still holding Luffy by the neck, Crocodile declares that Luffy has lost to him for the second time.\n",
  "characters": [
    "Crocodile",
    "Nico Robin",
    "Nefertari Cobra",
    "Monkey D. Luffy",
    "Usopp",
    "Nefertari Vivi",
    "Nami",
    "Tony Tony Chopper",
    "Pell",
    "Sanji",
    "Roronoa Zoro",
    "Tashigi",
    "Mashikaku"
  ],
  "ssum_frequencies": [
    [
      "the",
      5
    ],
    [
      "to",
      3
    ],
    [
      "luffy",
      1
    ],
    [
      "fights",
      1
    ],
    [
      "crocodile",
      1
    ],
    [
      "with",
      1
    ],
    [
      "more",
      1
    ],
    [
      "success",
      1
    ],
    [
      "this",
      1
    ],
    [
      "time",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      52
    ],
    [
      "to",
      35
    ],
    [
      "and",
      31
    ],
    [
      "crocodile",
      20
    ],
    [
      "luffy",
      20
    ],
    [
      "he",
      17
    ],
    [
      "of",
      17
    ],
    [
      "is",
      17
    ],
    [
      "that",
      14
    ],
    [
      "her",
      14
    ],
    [
      "water",
      12
    ],
    [
      "a",
      11
    ],
    [
      "him",
      10
    ],
    [
      "with",
      7
    ],
    [
      "for",
      7
    ],
    [
      "luffys",
      7
    ],
    [
      "by",
      7
    ],
    [
      "all",
      7
    ],
    [
      "she",
      7
    ],
    [
      "cannon",
      6
    ]
  ]
}