{
  "chapter_number": "Episode 66",
  "title": "A Serious Fight! Luffy vs. Zoro: The Baffling Duel!",
  "short_summary": "Luffy, without knowing that the town is full of bounty hunters, engaged in a battle with Zoro, after Zoro attacked the 'kind' people of this town. Meanwhile, Mr. 5 and Miss Valentine, two Officer Agents, headed for Princess Vivi, after learning that she discovered the head of the organization's true name.\n",
  "long_summary": "Igaram, Head of Security of Alabasta, continued to launch his assault on Mr. 5 and Miss Valentine, who have discovered both his identity and that of Miss Wednesday: Nefertari Vivi, Royal Princess of Alabasta. Zoro observed the attack from the rooftop, musing about Luffy being trapped in the crossfire and having to go rescue him. As Igaram continued his attack, he yells for Vivi to escape, but she can only watch in terror.\nAmidst the smoke and gunfire, Mr. 5 launched a projectile at Igaram, who is promptly consumed in a powerful explosion as both Vivi and Mr. 9 watch in shock. The smoke began to clear, and Igaram, severely injured, fell. Vivi called out to him in terror, but was interrupted by Miss Valentine, who attacked Vivi after telling her it is useless. Vivi escaped with nothing but a broken hairband, and attempted to launch a counter-attack with her Peacock Slashers on Miss Valentine, who promptly floated out of range while laughing, and returned to Mr. 5's side. As Vivi seethed, Mr. 9 expressed his amazement at his partner's royal status; Vivi promptly yelled at him for doing so in the midst of a dangerous situation. Zoro, meanwhile, took the chance to drag off a still sleeping, still bloated Luffy. Igaram, still somehow conscious, begged Vivi to abandon him and escape, for the sake of their home Alabasta. Mr. 5 proceeded to pick his nose while calmly stating that it is impossible for Vivi to escape. Enraged, Vivi drew her other Peacock Slasher and challenged the Baroque Works agent. Before she can attack however, Mr. 9 stands between her and the pair of assassins. While admitting confusion at the situation, Mr. 9 recounts how long he and Vivi have worked together, and told her to run as he buys her some time. As Vivi thanked him, Mr. 9 says his goodbyes and proceeds to charge at Mr. 5 and Miss Valentine with his acrobatics.\nMr. 5 stated that all that is required of agents is to do their jobs effectively while he pulled out a booger from his nose, chastising Mr. 9 for forming a friendship with his partner. When Mr. 9 attempted to attack, Mr. 5 aims the booger and launched it at Mr. 9, which proceeded to explode and send Mr. 9 flying clear into the river. Vivi watched this in horror, while Zoro observed in bewilderment. While Zoro was distracted, Igaram grabs Zoro's leg, which  surprised the pirate swordsman. Igaram stated that he has a \"most unfair\" request of Zoro, but required someone of his strength. Igaram continued, saying that both of the agents have Devil Fruit powers, and that he Igaram was hopelessly outmatched against them. As such, Igaram begged Zoro to protect Vivi in his place. All the while, Zoro was struggling to get Igaram to let go of his leg.\nMiss Valentine laughed at the situation while Mr. 5 picked his nose, and Vivi hopped on Karoo's back, commanding him to run. Miss Valentine commented on this, while Mr. 5 states that Vivi will not get far before chasing after her, Miss Valentine followed right behind him.\nDespite his injuries, Igaram continued to beg Zoro to protect Vivi, promising riches in return for doing so. Zoro angrily refused, mentioning how Igaram and his group had just been attempting to kill Zoro. However, Nami interjected, having overheard the conversation from a rooftop- and the mention of a reward. Nami stated that she will take the job, but only in return for 1 billion. Igaram was shocked at Nami's price, while Zoro and Nami converse. Zoro expressed surprise that Nami was awake, while she retorts that it had all been an act, not trusting \"a town that welcomes Pirates\". She then turned her attention to Igaram, and said that if he wanted Vivi to escape alive, he had better promise the reward of 1 billion. Igaram stated that his status prevented him from offering such a reward, but Nami retorts by emphasizing the danger to Vivi's life. Desperate, Igaram stated that while he cannot make any promises, the crew could negotiate a reward with Vivi herself. Nami mentions that this would require keeping up their part of the deal, but Igaram pleaded desperately. Nami relented, and proceeded to order Zoro to save Vivi, much to the swordsman's anger, saying that he is not going to get involved in Nami's schemes. Nami attempted to explain business to Zoro, but he refuses to fall for her explanation. Nami makes light of the situation, while Zoro vented his frustration at her attempting to order him around just as she took advantage of Sanji. During their conversation, Luffy finally wakes from his slumber.\nNami insults Zoro and says that he is just afraid of losing, while Zoro is quickly losing what remains of his patience. A bloated Luffy, still half-asleep, walks by the two obliviously in order to find the facilities. Nami then brings up the loan she gave Zoro, but he counters by mentioning that he did not even spend any of it. Nonetheless, Nami counters by saying that he promised to pay her back in 300% interest, bringing his due to 300,000. Zoro is shocked that Nami expects him to pay her back when he did not spend any of the money in the first place, but Nami persists. She then proceeds to question whether or not Zoro can even keep one little promise (apparently hitting a sore spot), leaving Zoro shocked, furious, and silent. While Zoro grumbles about Nami dying a horrible death, he nonetheless relents and leaves to find Vivi. Igaram muses about his own apparent uselessness, but Nami comforts him by telling Igaram how strong Zoro is. Nonetheless, Igaram morbidly goes on about how Alabasta would be doomed if Vivi died, confusing Nami.\nVivi and Karoo continue to flee, with the intention of stealing a ship and fleeing back to Alabasta.\nA still-bloated Luffy relieves himself in a river before intending to go back to sleep, but comes across the carnage that Zoro left behind.\nVivi and Karoo continue running away, but are promptly intercepted by Mr. 5 and Miss Valentine. Vivi and Karoo run a different route and are met by Miss Monday, who explains that they can reach the ships by taking the path behind her, explaining that she will hold off Mr. 5 and Miss Valentine while Vivi makes her escape. Vivi hesitates, but Miss Monday explains that the loss to Zoro means punishment already awaits, so she might as well go down while protecting her friend. She then yells at Vivi to stop waiting around and flee, saying that otherwise Igaram and Mr. 9's sacrifices would be in vain. Vivi thanks Miss Monday before she and Karoo run away again, leaving Miss Monday to face Mr. 5. While Mr. 5 muses about both her and Mr. 9's defection, Miss Monday remains determined to prevent him from passing. Miss Valentine mocks Miss Monday's resolve, while Mr. 5 rushes Miss Monday, calling her a disgrace. Miss Monday attempts to attack, but Mr. 5 dodges and clotheslines her, causing a powerful explosion. Hearing the explosion, Vivi temporarily halts her escape to look back as her friend is defeated, seeing an inferno. She can only stare in utter horror as her friend got beaten.\nVivi is shocked at the brutality, while Mr. 5 explains his powers are from the Bomu Bomu no Mi and that he has yet to fail a mission. Miss Valentine then explains her own powers, originating from the Kiro Kiro no Mi. Miss Valentine then uses her powers to turn herself into a living missile and slam down on Miss Monday with the weight of 10,000 kilograms. Upon standing up, the pair condescendingly state that it is futile for Vivi to escape, and that she does not stand a chance. Vivi however, remains determined to return to Alabasta and save her kingdom. Mr. 5 prepares to attack, but Zoro intercepts, saving a shocked Vivi. Vivi, believing Zoro to still be an enemy, prepares to attack him, but Zoro cuts Vivi's weapon and holds the edge of his blade at her throat, followed by explaining that he is here to help and she needs to calm down.\nMeanwhile, Nami and Igaram continue talking, with Nami questioning just what Baroque Works is. Igaram hesitates, but then explains that the Baroque Works is a crime syndicate, specializing in sabotage, assassination, and bounty-hunting, and so secretive that none of the agents know the boss' name or face, but will nonetheless act on his orders. Nami questions this logic, but Igaram goes on to say that Baroque Work's primary goal is to create a Utopia, and that those who do their part get a higher standing in said nation. He then continues, explaining the codename and rank system within Baroque Works.\nMiss Valentine guesses that Zoro is the one who defeated all of the \"lowly employees\" in Whisky Peak, while Mr. 5 questions as to why Zoro would want to get involved in protecting Vivi. Zoro simply states that he has his own reasons, while Mr. 5 says that they will have to eliminate Zoro for his interference. Zoro and Mr. 5 prepare to fight, but are interrupted by the shout of an enraged Luffy. While Vivi is confused, Zoro states that while glad to have Luffy's assistance, he can handle the attackers. However, Luffy proceeds to yell threats at Zoro, much to the swordsman's shock and confusion. While Zoro questions what Luffy could be asking, Luffy angrily explains how he came across the men Zoro fought, and was tricked into believing Zoro attacked unprovoked. Zoro attempts to explain, but Luffy ignores him and yells at Zoro to fight him. Vivi comments on Luffy's lack of intelligence (to Karoo's agreement), while Mr. 5 and Miss Valentine discuss letting the two kill each other off. Zoro continues his attempts at explanation, but Luffy will not have and attacks. Zoro dodges Luffy's assault while attempting to calm down his captain. Miss Valentine and Mr. 5 muse from the sidelines before deciding to return to their mission: eliminating Princess Vivi. However, Zoro kicks the bloated rubber man into the pair, sending the three of them flying. Having had enough interference, Mr. 5 explains his intentions to kill both Luffy and Zoro, and attacks Luffy while Zoro and Vivi watch from a distance. In the midst of the explosions, Miss Valentine flies up and prepares to attack Zoro and Vivi. Vivi tells Zoro to flee, but Zoro interrupts her. Luffy then steps out of the smoke, having digested the food that he ate and dragging a beaten and bloodied Mr. 5. Vivi is utterly shocked at Luffy's victory over such a powerful foe. Luffy turns his attention back to Zoro, who tries to explain the situation. Miss Valentine floats above the swordsman and tries to explain her powers, but becomes quite angry when she finds she is being ignored.\nLuffy does not believe Zoro's explanation (based on the concept that enemies would not give them such tasty food); Zoro is done attempting to explain, and casually dodges Miss Valentine's attack attempt, and prepares to fight Luffy. While Vivi is confused, the crew mates charge each other, launching a Gomu Gomu no Bazooka and Oni Giri respectively, the attacks cancelling each other out as the two grapple. Zoro and Luffy decide to test steel against rubber, and Zoro launches a Tatsu Maki, flinging Luffy into the air. To Zoro's surprise, Luffy is able to launch a Gomu Gomu no Pistol, landing a direct hit as they both slam into walls. Vivi ponders the situation as she and Karoo warily tread the battlefield, before both Luffy and Zoro break out of the rubble and resume their attacks. Mr. 5 and Miss Valentine observe the ferocious battle, Mr. 5 commenting that the pair are making fools of them on their own turf, and that Baroque Works will be shamed if they fail their mission. The two charge headlong into the battle, but are promptly disposed of by the captain and Zoro for interrupting their battle.\nIn the anime, Nami is listening in while it is being revealed that Miss Wednesday is actually Princess Vivi of Arabasta. In the manga, she only appears right after the said reveal to offer help in exchange for 1 billion.\n",
  "characters": [
    "Roronoa Zoro",
    "Igaram",
    "Nefertari Vivi",
    "Mr. 9",
    "Mr. 5",
    "Miss Valentine",
    "Monkey D. Luffy",
    "Karoo",
    "Nami",
    "Miss Monday"
  ],
  "ssum_frequencies": [
    [
      "the",
      4
    ],
    [
      "of",
      3
    ],
    [
      "that",
      2
    ],
    [
      "town",
      2
    ],
    [
      "zoro",
      2
    ],
    [
      "after",
      2
    ],
    [
      "luffy",
      1
    ],
    [
      "without",
      1
    ],
    [
      "knowing",
      1
    ],
    [
      "is",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      87
    ],
    [
      "the",
      80
    ],
    [
      "and",
      76
    ],
    [
      "zoro",
      54
    ],
    [
      "vivi",
      47
    ],
    [
      "that",
      43
    ],
    [
      "mr",
      37
    ],
    [
      "a",
      37
    ],
    [
      "of",
      36
    ],
    [
      "his",
      31
    ],
    [
      "miss",
      30
    ],
    [
      "while",
      30
    ],
    [
      "in",
      27
    ],
    [
      "is",
      27
    ],
    [
      "her",
      27
    ],
    [
      "but",
      26
    ],
    [
      "igaram",
      25
    ],
    [
      "5",
      25
    ],
    [
      "he",
      24
    ],
    [
      "luffy",
      21
    ]
  ]
}