{
  "chapter_number": "Episode 159",
  "title": "Go Forth, Little Crow! To the Sacrificial Altar",
  "short_summary": "Luffy, Usopp, and Sanji finally enter Upper Yard, only to find out that the whole road is heavily trapped, but at last they arrive at the Ordeal Gates. Meanwhile, Robin, Zoro, and Nami go out to explore Upper Yard while Chopper stays behind to guard the ship alone.\n",
  "long_summary": "Luffy, Usopp and Sanji begin their journey to Upper Yard and Usopp is questioning if Conis was going to be alright being that she is now branded as a criminal like them. As they head into Upper Yard, they comment on how huge the forest is. Just as they begin advancing into the forest, they are attacked by a big moving scythe. Luffy uses Gomu Gomu no Bazooka to help them escape. Just then they are again attacked, by wooden spears. Sanji and Luffy kick them off and Luffy uses Gomu Gomu no Kazaguruma to get them past. Just then, a razor boomerang appears and begins attacking them. As the Super-Express Speedy Shrimp abandons the rest of the crew, Robin comments on the fact that their current location appears to be a sacrificial altar. Luffy, Usopp and Sanji continue to be attacked, this time by a Sky Lamprey, which Sanji easily defeats.\nZoro has defeated a Sky Shark and decides to explore the forest. Nami comments on how dangerous it was since the priests and Enel were at Upper Yard. Nami indicates he needed to respect God and Zoro replies that he had never for one day prayed to God. Chopper thinks that was very cool of Zoro. The three traveling down the Milky Road are once again attacked by another Sky Lamprey and Luffy defeats it with ease. Robin decides to go with Zoro to explore the forest after seeing the writings on the sacrificial altar and commenting that the altar is about 1,000 years old. Robin states that the history of such excites her. She further indicates that there may be \"valuables\" in the ruins. On hearing this, Nami decides to go along with them as well. Leaving the ship in Chopper's care, they leave. Chopper later realizes that he is the one in most danger, being alone in a dangerous place.\nLuffy, Sanji and Usopp are still making their way through the Milky Road and finally make their way to the entrance of the four different Ordeals.\n",
  "characters": [
    "Monkey D. Luffy",
    "Usopp",
    "Sanji",
    "Roronoa Zoro",
    "Tony Tony Chopper",
    "Nico Robin",
    "Nami"
  ],
  "ssum_frequencies": [
    [
      "to",
      3
    ],
    [
      "the",
      3
    ],
    [
      "and",
      2
    ],
    [
      "upper",
      2
    ],
    [
      "yard",
      2
    ],
    [
      "out",
      2
    ],
    [
      "at",
      2
    ],
    [
      "luffy",
      1
    ],
    [
      "usopp",
      1
    ],
    [
      "sanji",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      21
    ],
    [
      "and",
      13
    ],
    [
      "to",
      13
    ],
    [
      "that",
      8
    ],
    [
      "luffy",
      7
    ],
    [
      "a",
      7
    ],
    [
      "them",
      6
    ],
    [
      "they",
      6
    ],
    [
      "sanji",
      5
    ],
    [
      "is",
      5
    ],
    [
      "as",
      5
    ],
    [
      "on",
      5
    ],
    [
      "usopp",
      4
    ],
    [
      "their",
      4
    ],
    [
      "be",
      4
    ],
    [
      "forest",
      4
    ],
    [
      "are",
      4
    ],
    [
      "attacked",
      4
    ],
    [
      "by",
      4
    ],
    [
      "gomu",
      4
    ]
  ]
}