{
  "chapter_number": "Episode 29",
  "title": "Outcome of a Deadly Battle! The Inner Spear!",
  "short_summary": "After damaging the Daisenso, Luffy defeats Krieg, destroying his golden armour. The Krieg Pirates, under Gin's instruction, retreat from Baratie, thanking Sanji for his hospitality.\n",
  "long_summary": "Having damaged the Daisenso, Luffy continues his attack against Krieg. At one point, Krieg climbs a mast, where Luffy strikes him with a Gomu Gomu no Bazooka, cracking Krieg's armour. Although Krieg attempts to deter him with explosives, Luffy strikes Krieg with a second Gomu Gomu no Bazooka, shattering the armour.\nKrieg captures Luffy with a net, intending for the both of them to fall into the sea and Luffy to drown. Luffy manages to counter this by freeing his limbs, grabbing Krieg's face with his feet, and slamming him into the Baratie's fin with Gomu Gomu no Ozuchi, knocking him unconscious and defeating him. Luffy falls into the sea, but Sanji rescues him and brings him to safety.\nHowever, Krieg gets up, now hysterical from his own defeat, attacking his own men in a panic. Gin strikes him back down, knocking him unconscious again and preventing him from causing further harm. Escorting Krieg away, he orders a full retreat on behalf of the Krieg Pirates, promising to rebuild his crew and eventually meet Luffy's crew on the Grand Line. Sanji gives the Baratie's supply ship for the defeated pirates to retreat.\nOn the Going Merry, Nami laments having to steal the ship, but cries, stating her desires to be free and mentioning Bell-mère.\n",
  "characters": [
    "Sanji",
    "Zeff",
    "Monkey D. Luffy",
    "Don Krieg",
    "Carne",
    "Patty",
    "Gin",
    "Roronoa Zoro (flashback)",
    "Dracule Mihawk (flashback)",
    "Johnny (flashback)",
    "Yosaku (flashback)",
    "Usopp (flashback)",
    "Nami",
    "Pandaman"
  ],
  "ssum_frequencies": [
    [
      "the",
      2
    ],
    [
      "krieg",
      2
    ],
    [
      "his",
      2
    ],
    [
      "after",
      1
    ],
    [
      "damaging",
      1
    ],
    [
      "daisenso",
      1
    ],
    [
      "luffy",
      1
    ],
    [
      "defeats",
      1
    ],
    [
      "destroying",
      1
    ],
    [
      "golden",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      12
    ],
    [
      "him",
      10
    ],
    [
      "to",
      9
    ],
    [
      "krieg",
      8
    ],
    [
      "luffy",
      7
    ],
    [
      "and",
      7
    ],
    [
      "his",
      6
    ],
    [
      "a",
      6
    ],
    [
      "with",
      6
    ],
    [
      "gomu",
      6
    ],
    [
      "strikes",
      3
    ],
    [
      "no",
      3
    ],
    [
      "into",
      3
    ],
    [
      "on",
      3
    ],
    [
      "having",
      2
    ],
    [
      "bazooka",
      2
    ],
    [
      "kriegs",
      2
    ],
    [
      "armour",
      2
    ],
    [
      "for",
      2
    ],
    [
      "of",
      2
    ]
  ]
}