{
  "chapter_number": "Episode 153",
  "title": "This is the Sea of the Sky! The Knight of the Sky and Heaven's Gate",
  "short_summary": "The Straw Hat Pirates arrive in an ocean above the clouds. Usopp almost falls out of the sky but is saved at the last minute. The crew is also attacked by a mysterious looking warrior, but is saved by the Knight of the Sky. Finally, they arrive at the border which transports them to the upper realm, Skypiea.\n",
  "long_summary": "The Knock Up Stream drives the Going Merry through the Emperonimbus Clouds. Luffy finds it to behave just like water and does his best to hold his breath. Soon the ship breaks the upper surface of the White Sea and its wings break off. Back in the Blue Sea, Cricket sits on the island as the Knock Up Stream dissipates, lost in thought. Floating with his crew on the remains of their raft, Teach is impressed that the Straw Hat Pirates got away. Burgess is angry that they lost out on a possible bounty, but Teach reasons that they will cross paths again if they remain on the Grand Line.\nEveryone on the Going Merry is sputtering from their unexpected underwater ride—except for Usopp, who has drowned. Everybody is amazed by the beauty of the clouds and wonders how the ship can float on them. Chopper finds Usopp not breathing and has to give him CPR. Usopp soon comes to and quickly wonders at the White Sea's expanse as well. Nami sees that the Log Pose is still pointing almost straight up. Robin thinks they have to go higher still, but isn't sure how yet. Usopp is eager to take a swim. Sanji warns him not to try until they were certain of the Sea Clouds' properties. Usopp doesn't listen and jumps in quickly \"swimming\" deeper and deeper. Luffy and Chopper at first are jealous, since as Devil Fruit users they cannot swim. But as he fails to come back up, Robin suggests the White Sea has no bottom and he's not swimming but falling. Luffy stretches his arm through the White Sea and Robin uses her Hana Hana no Mi power, Ojos Fleur, to put eyes on Luffy's arms to look for Usopp. They find him as he breaches the bottom of the Emperonimbus Clouds and Robin uses Veinte Fleur to grow arms out to grab him.\nPulling Usopp back up to the ship proves surprisingly difficult. When he breaches the surface, he is followed by a Sky Eel and the tentacles of a Sky Octopus. Zoro slashes the tentacle and to everyone's surprise it bursts like a balloon. Sanji knocks out the Sea Eel and it hangs limp and deflated over the rail of the ship. Zoro comments on how thin the air is while Sanji wonders about the strange creatures. Usopp screams as he feels a Sky Fish wiggling in his overalls then curls up in a fetal position on the deck repeatedly mumbling \"sky island scary\" after the personal horrors he's already experienced. Robin and Nami examine the Sky Fish. Robin wonders about the adaptations of the sea creatures to be able to swim in the Sea Clouds. Luffy then grabs the fish and Sanji sautees it. Luffy finds it delicious. Nami is angry at first that they cooked her specimen until she tastes it too and finds it delicious as well. While they wonder if they can cook the Sky Eel too, Chopper looks for Skypiea in the binoculars. He instead finds a ship getting blown up in the distance and falls to the deck in fright.\nChopper warns that there's something headed this way. A man with a shield and a bazooka-like weapon charges the Going Merry looking to destroy it. The strange person quickly knocks down Zoro, Sanji and Luffy, then jumps up and takes aim. However, he is stopped by a second man who jousts at him from a bird. The first blocks with his shield, but is knocked into the White Sea. The second man boards the Going Merry and reveals himself as the Sky Knight, an old man wearing armor along with his riding bird, Pierre. Nami comments that it was disgraceful that their three best fighters lost so handily. Chopper thanks the Sky Knight who says this rescue was \"on the house\". Luffy, Zoro and Sanji are all winded; Robin thinks it's because of the thin air at their altitude of 7,000 metres. The Sky Knight quickly recognizes the crew as \"Blue Sea people\". He says that there's no way they'll be able to last even higher up in the White White Sea, at 10,000 meters. Luffy thinks he's getting used to it, though.\nThe Sky Knight says he is a mercenary and offers his help to those who are not used to fighting in the sky. He offers his services for 5,000,000 but the crew is utterly unfamiliar with the Skypiean economy. He is surprised to find that they arrived by the Knock Up Stream and Nami frets over the fact that they had indeed come by an unusual route. The Sky Knight asks if their entire crew arrived alive. He says that usually crews lose a few men on normal routes, but with the Knock Up Stream, it's either they all live or they all die. He sees this as proof that the crew is capable of handling themselves in the sky. For that, he gives them a whistle for free; they can call on his aid, if needed, one more time free of charge. He introduces himself as \"Gan Fall\". Before taking his leave, he shows that Pierre had eaten the Uma Uma no Mi devil fruit, allowing him to turn into a Pegasus. The crew is disappointed that the mythical Pegasus looks so ordinary.\nAfter the encounter, the crew still doesn't know how to get up to the White White Sea. Luffy suggests using the Whistle to ask Gan Fall for directions but Nami and Usopp stop him. Chopper spots a waterfall-shaped cloud, and they sail in that direction. Along the way, they stop among other different kinds of clouds that are floating in the White Sea. For a moment, they find rubbery clouds floating among the ship and Luffy, Usopp and Chopper bounce on them for fun. Nami surmises they will have to find a way around these clouds, so she asks them to find a route. Usopp finds a gate at the base of the waterfall and they navigate around the clouds until they arrive at Heaven's Gate. At this point, Zoro begins to wonder if they actually are dead. Someone emerges and takes photographs. Noting she has wings, they think at first she's an angel, though Luffy is disappointed she's so wrinkly.\nShe reveals herself as Amazon, the ship inspector at Heaven's Gate, and asks for a toll of 1,000,000,000 per person as dictated by the law. She says they don't have to pay, since she is not a guard and is merely asking their intentions. Luffy says they don't have money, the crew still not knowing what \"extols\" are, and asks how they get up. At this point a giant sky lobster, the \"Express Lobster\", grabs the stubs of the Going Merry's broken wings and begins to swim up the waterfall taking them to Skypiea. As they travel, Amazon calls on \"almighty God\" that a ship is entering Skypiea illegally with 7 occupants and requests that he passes \"heaven's judgment\" upon them.\n"
}