{
  "chapter_number": "Episode 137",
  "title": "How's That for Profit? Money Lender Zenny's Ambition!",
  "short_summary": "The Straw Hat Pirates help Zenny out, hoping to make his last days good ones. They learn about Zenny's past as a money lender and his dream of becoming a pirate, but Zoro realizes that Zenny has outlived Chopper's predictions. The Straw Hats decide that after helping him finish his pirate ship, they will leave the island.\n",
  "long_summary": "The Straw Hat Pirates are busy repairing the wrecked ship and Zoro is busy chopping down trees by axe. The chopped wood is then being passed on by goats to each other towards Chopper. While carrying the chopped wood, Zenny makes exclamations about the slow work of the Straw Hat crew. To calm him, Nami makes Zenny sit on a chair and Robin offers a shoulder massage. Sanji asks him about why the ship is on the top of the mountain to which he says that this ship is his coffin. The Straw Hats are astonished and ask him if it is too early to have a coffin. He replies by saying he will be needing a coffin anyway eventually. Sanji asks him why his coffin is a pirate ship and Zenny starts dozing off, but the Straw Hat Pirates think that he has died and start shouting to which Nami points them to be quiet as he is only dozing off.\nAt a Marine base, Marines learn that both the Straw Hats and Zenny are at the same island. Keeping in mind the bounties of Luffy and Zoro, Sergeant Minchey suggests a plan to assure victory.\nAt the island, Zenny is playing chess with Nami and he is getting all the services from massages to delicious cheese. Luffy, Usopp, and Zoro return with caught fish for dinner and assure Zenny of any services he asks for. Zenny exclaims how he is living a paradise. Zoro thinks about it and says that he should have died by now as three days have already passed. The Straw Hats think of leaving the island as Zenny seems in better health than when they arrived.\nNami keeps on losing to Zenny in chess and in the hope of getting details about the treasure, she bets everything including the ship. Consequently, they owe him service for 10 more years to get their ship back. Usopp suggests bolting out but Luffy refuses, saying a bet is a promise and he will not break any promises. During all the ruckus going on about leaving, Robin checkmates Zenny and wins the ship back. Being delighted on meeting such joyful prates, Zenny decides to have a party.\nAt the party, Nami tries to get the old man drunk to learn about the true location of the treasure to which he jokes about the goats being his real treasure. Later, he says he was a money lender to pirates and was known as the money lender Zenny. This revelation came as a surprise to Usopp as pirates don't usually return the money they take. He talks about how the pirates were not returning the loaned money, so he always went face to face with them to get his money back.\nRecalling his past, Zenny was on a ship and was asking for his money back or else he would sink the ship by bombing it.\nAfter talking about his past, he talks about his dream of becoming the Pirate King and how his ship got destroyed by pirates 20 years ago causing him to drift to this island. He thought of building a ship but wasn't able to bring the wood beside the sea, so he built his ship on the mountains. By the time he had completed the ship, he had gotten too old to sail the Grand Line. However, Luffy suggests that no one is too old to become the Pirate King.\nThe Marines are on their way and are thinking of luring the Straw Hat Pirates out of the island while Zenny is thinking about what Luffy said to him.\nWhen morning comes, Chopper exclaims about seeing the Marine ship and the Straw Hats start running to the shore and are confronted by Sergeant Minchey. He says he came with only one ship just to inspect the island and Zenny and the Straw Hat Pirates should leave immediately as other Marines might come for them. In reality, a huge Marine fleet is hiding in the fog behind them so that they can attack the pirates when they leave. The Straw Hats easily look through this trick and get ready to attack but are stopped as Usopp is captured and are asked to drop their weapons. They do as they are told, and the Marines now try to shoot at them and at the same time, Zenny unloads his ship from the mountain top.\nThis episode is also translated to \"How's Tricks? The Designs of Zenny the Moneylender!\" The reason for the difference is the phrase \"Mokarimakka\", which roughly translates to \"Paid well?\", but is an Osakan slang that means the same as a \"How are you doing?\". In English, \"How's tricks?\" also functions as an informal \"How are you doing?\" hence the translation difference.\n"
}