{
  "chapter_number": "Episode 139",
  "title": "Legend of the Rainbow Mist! Ruluka Island and the Old Man Henzo!",
  "short_summary": "On Ruluka, some of the Straw Hat Pirates make enemies of the Mayor and his men who have placed high taxes on everything. Robin, Usopp, and Luffy meet Professor Henzo, who's doing research on the island's Rainbow Mist. When some of the mist shows up, Henzo borrows the Going Merry to go explore it.\n",
  "long_summary": "The episode starts off with the Straw Hat Pirates being chased by Rapanui Pasqua's fleet of 9 Marine ships. Rapanui Pasqua throw's a coin, also called a \"Finger Bomb\" which take's down most Pirate ships, but he sneezed before using his attack, which hit another Marine ship. Nami tells the rest of the crew to start speeding ahead of the Marine fleet because of the broken formation, where they then stop at Ruluka. Chopper sees a massive tower and the Crew follow him only to be stopped by a Tax Collector who shouts at Nami. Sanji steps up to defend Nami but Luffy with all his hunger charges through them and runs over both the Tax Collector and Sanji. Usopp and Robin spot Henzo, who wants to talk about the Rainbow Mist so he invites them to a local restaurant.\nUsopp starts a discussion about the Rainbow Mist. Henzo talks about how long he has been researching about the Mist and then Robin shows him a book from Arabasta. The cook and another random man talk to them about how he is crazy and stealing their tax money. Then the Tax Collection Squad starts to march towards the restaurant and everyone starts to panic and eat everything quickly. One young man sadly has to pay up since he hadn't finished his liquor, they walk up to Henzo and talk about how he is stealing everyone's taxes, they then walk away but not before spotting Luffy eating a heap of spaghetti. So they tax him for eating a heap of spaghetti, which Usopp has to pay for. They then leave the restaurant, as we cut to Sanji, Nami, and Chopper purchasing item's from a market. The Dynamo Squad jump out to attack them, Sanji tries to use his kick's but since the Dynamo Squad's armor is electric, he gets shocked. Nami and Chopper run for cover as Sanji tries again, but fails. He then uses his Ultimate Tactic, where he runs away, the Dynamo Squad's armor now falls as the wire pulls him back, letting Sanji, Nami and Chopper run away. We then skip back to the rest of the Crew (other then Zoro).\nThey hear shouting of a galleon appearing at the harbour. Henzo quickly runs to it, so do the rest of the Crew. The Talielisin appears at the harbour. Henzo quickly goes towards it with his H-1 and the crew chase after him. They arrive on the boat with him and they explore the ship. Henzo has a reading of the Rainbow Mist appearing, and it is true, he tries to steal the Going Merry but the Crew try to stop him. He talks about how he has been waiting for this day then charges into the Rainbow Mist, Sanji is furious at Zoro, calling him a mosshead, we cut back to the Going Merry, as they enter Ape's Concert. \n",
  "characters": [
    "Rapanui Pasqua",
    "Usopp",
    "Nami",
    "Roronoa Zoro",
    "Tony Tony Chopper",
    "Monkey D. Luffy",
    "Sanji",
    "Isoka",
    "Pukau",
    "Rongo",
    "Akibi",
    "Nico Robin",
    "Henzo",
    "Flip",
    "Lake",
    "Attach",
    "Rocky Hattari"
  ],
  "ssum_frequencies": [
    [
      "the",
      5
    ],
    [
      "on",
      3
    ],
    [
      "of",
      3
    ],
    [
      "some",
      2
    ],
    [
      "and",
      2
    ],
    [
      "henzo",
      2
    ],
    [
      "mist",
      2
    ],
    [
      "ruluka",
      1
    ],
    [
      "straw",
      1
    ],
    [
      "hat",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      34
    ],
    [
      "to",
      19
    ],
    [
      "and",
      16
    ],
    [
      "a",
      13
    ],
    [
      "he",
      12
    ],
    [
      "of",
      10
    ],
    [
      "they",
      9
    ],
    [
      "then",
      9
    ],
    [
      "him",
      8
    ],
    [
      "sanji",
      7
    ],
    [
      "about",
      7
    ],
    [
      "but",
      6
    ],
    [
      "his",
      6
    ],
    [
      "nami",
      6
    ],
    [
      "crew",
      6
    ],
    [
      "henzo",
      6
    ],
    [
      "at",
      5
    ],
    [
      "tax",
      5
    ],
    [
      "mist",
      5
    ],
    [
      "has",
      5
    ]
  ]
}