{
  "chapter_number": "Episode 211",
  "title": "Round 2! Shoot into the Groggy Ring!",
  "short_summary": "Sanji and Zoro must face the Groggy Monsters in a ball game. The Groggy Monsters cheat by using weapons, and the referee pretends not to see anything. After taking a beating, Sanji and Zoro finally agree to work together for 10 seconds in order to win.\n",
  "long_summary": "For the Straw Hat's next event, they must win a game of Groggy Ring to get Chopper back. Sanji and Zoro must work together to defeat the Groggy Monsters. The referee introduces the two teams, Sanji and Zoro as the two guys who sabotaged the Foxy Pirate's teams in the first event, and introduced the Groggy Monsters as their most powerful Groggy Ring squad.\nThe Groggy Monsters are three giants named Hamburg, Pickles, and Big Pan. After introducing Zoro as the 60,000,000 belly man, Pickles says he was wondering what kind of opponents warranted them coming out and playing. The Groggy Monsters appear to think Sanji and Zoro are no match for them.\nThe referee comes out and says the field positions are decided by a coin toss. He then quickly flips the coin, and Hamburg immediately says tails. The referee then asks Zoro and Sanji which side they chose. Sanji replies saying there is only one side left to choose, so heads. After they respond the referee shows the coin he flipped, revealing tails. He then smirks and gives an evil laugh. He turns to the Groggy Monsters and ask them if they want field or ball. Hamburg, the leader responds Ball. The announcer then says in an excited voice over the PA that the Groggy Monsters have chosen to receive the ball. He then says that  Sanji from the Straw Hat team must go to his opponents' mid-circle.\nZoro and Sanji then start arguing over where to stand, and who is the ball. They play rock paper scissors to decide who is the Ballman. Zoro wins, but Sanji argues against it, saying that Zoro threw the last paper late. Nami gets frustrated and tells Sanji that the ball looks good on him. As they walk to the starting line the referee tells Roronoa Zoro that there is a no weapons policy and to take off his katanas.\nThe Groggy Monsters decide to rush Zoro and Sanji and crush them. The announcer then tells the teams that there is no time limit and the first point wins. Pickles rushes forward to attack Sanji, but he easily jumps over him. Sanji then tries to attack the opposing team's Ballman, Big Pan. He slips on Big Pan's arms because he his part loach and their skin is slippery. Big Pan hits Sanji sending him flying to Hamburg in order to score a goal. Roronoa Zoro tries to catch Sanji from going into the goal but Pickles knocks him out of the way. Then Hamburg catches Sanji and throws him to the goal. Pickles catches Sanji and throws him to the goal. Before Sanji reaches the goal Zoro throws Pickles toward Sanji and Sanji kicks Hamburg preventing him from entering the goal and loosing the game.\nSanji and Roronoa Zoro continuously argue and fight. They both say they do not need any help to win by themselves. Big Pan uses the disarray to try and crush Sanji and Roronoa Zoro by crushing them. Big Pan is breaking the rules by using weapons on his feet. Sanji gets mad and kicks the ref, because the referee is not doing anything about Big Pan using weapons. This causes him to get a yellow card.\nAll three of the Groggy Monsters return with lots of weapons. Roronoa Zoro and Sanji get beaten up by all of them. They are beaten to an inch of their life because they will not work together. After several minutes of harsh beatings, Roronoa Zoro and Sanji are shown to be barley conscious. The episode ends with Roronoa Zoro telling Sanji that they should work together for 10 seconds to win.\n"
}