{
  "chapter_number": "Episode 14",
  "title": "Luffy's Revival! Miss Kaya's Life and Death Confrontation",
  "short_summary": "Captain Kuro himself arrives at the scene, and with Zoro too injured to fight, Luffy being incapacitated, and the other two, Nami and Usopp, being too weak to handle him, things seem hopeless. However, Kaya herself appears to bargain with Kuro.\n",
  "long_summary": "This episode starts with a recap of the previous episode and opens with Kuro arriving at the north slope, very angry that his plan did not go as planned. Jango and the rest of the Black Cat Pirates are terrified by him, including Sham and Buchi. He can’t believe that his former crew was held back by a bunch of children. He asks Jango for an explanation. Jango reminds Kuro who said letting Usopp go would not cause any problems. Kuro said that he knew that Usopp would try in vain to stop the Black Cat Pirates from invading Syrup Village since no one would believe him, but the one thing he didn’t count on was the weakness of his crew.\nThis remark made Sham and Buchi very mad. They remembered Kuro as a strong killer and said they were sinking ships and vanquishing pirate crews while Kuro lived the good life. They accused him of becoming weak. They go straight to him, hoping to kill him. Jango tries to warn them, but it was no use. Before they could deal him a blow, he suddenly disappeared. And reappeared moments later behind them with his Cat Claws gloves on his hands. It surprised even Zoro. They tried to attack him again, but he disappeared one more time. Jango recognized this move as the Nukiashi technique, Kuro’s trademark attack. He reappeared behind Sham and Buchi again, with his claw-like knives pointing at them. Even Nami is impressed by this, as the Nyaban Brothers nearly defeated Zoro. This silent technique is so powerful, not even a group of 50 assassins could stop Kuro. Jango knew he hasn’t lost that attack by the way he always lifted his glasses to avoid being cut by his Cat Claws gloves.\nNami managed to get up despite her wound. Kuro gave his crew 5 minutes to kill Zoro. Otherwise, he will kill them all. Sham and Buchi go straight to Zoro to kill him. Jango encourages them to stop him. Nami kicks the two swords straight to Zoro. The swordsman managed to get them. Although a little upset that Nami kicks his swords without any respect, Zoro thanks her for giving him back his swords and he defeats the Nyaban Brothers by using the Tora Gari technique. Kuro is still counting the minutes. Usopp and the Black Cat Pirates are surprised by the swordsman’s attack. Even Jango is shocked by it.\nZoro said to Kuro that the former captain will be defeated in less than 5 minutes. Kuro is a little impressed. Buchi is still conscious and begs Jango to hypnotize him so he will become strong enough to defeat Zoro. Jango managed to do so and Zoro decided to deal with Buchi before he can fight Kuro. After being hypnotized, Buchi becomes stronger and more savage than before. His muscles even increased in size. That surprised Zoro, but he managed to regain his calm and decided to fight him no matter what happens. Meanwhile, Nami goes to wake up Luffy who is sleeping beneath the figurehead of the Bezan Black. She managed to wake him up by pressing her foot into his head. Luffy woke up just in time to stop Jango’s pendulum from killing Nami with his bare teeth while arguing with Nami for the way she wakes people up. Nami learned that Jango’s pendulum is also used as a weapon. Luffy broke the pendulum with his bare teeth, although it hurts him a little bit.\nThe Black Cat Pirates begin to think it will be impossible to defeat Luffy and Zoro since they appeared to be very strong. After waking up Luffy, Nami passes out for a bit. Luffy notices Nami’s wound. Nami asks Luffy to fight for the village and her treasure, and Luffy accepts. The pirates run from Luffy, scared for their life. While Buchi fights Zoro, Jango will deal with Luffy. Kuro said that time is up and he will kill everyone on the north slope. He is also surprised that Luffy survived the fall from the cliff since he thought that fall would have killed him.\nBefore Kuro could kill anyone, Kaya arrives and begs him to stop. Usopp managed to save her before Kuro slashes her. She said to Usopp that she could not bare to see him get hurt protecting her. She then talks to Kuro and said he can take her fortune and leave the village alone. Kuro said to Kaya he wants more than her fortune. He wants peace. He said, despite her plea, the Black Cat Pirates will still attack Syrup Village and kill her. She then pulled a gun from her coat and pointed it at Kuro. She threatens to kill him if Kuro and the Black Cat Pirates don’t leave the island this instant. Kuro managed to lower her guard down by talking about the last 3 years they spent together. He also said that spending 3 years with her was an insult to his pride as a pirate. He takes the gun from her and throws it to the ground.\nUsopp takes the gun and tries to shoot Kuro down, but Kuro used his Nuki Ashi to reappear behind the liar with his Cat Claws gloves on. He tried to kill him to make him pay for punching him, but his attempts were stopped by Luffy who gave him a Gomu Gomu no Pistol, sending him to the ground. Luffy swears Kuro will have a bad day since he hates being punched.\n"
}