{
  "chapter_number": "Episode 187",
  "title": "Guidance from the Sound of a Bell!The Great Warrior and Tales of an Explorer",
  "short_summary": "The history of Mont Blanc Noland and Kalgara is told, as a flashback from Wyper.\n",
  "long_summary": "As Enel watches the destruction, Usopp urges everyone to hurry before everything gets destroyed, and Luffy vows to make Enel pay while running up the stalk. Enel notices the Shandia Village and comments that because they are originally from the Blue Sea, they may \"enjoy\" his plan to destroy Skypiea, sending it back down to the Blue Sea. He then directs the lightning to specifically destroy the village. The Shandia watch in horror from the boat and remark they could have been destroyed along with their village had they not evacuated as fast as they did.\nWyper reminisces about his oath to Kalgara to light the fire of Shandora while Aisa tries to get him to go. He remembers the Shandia Chief telling him as a child about Kalgara's other reason for wanting to protect their homeland. That reason was a friend Kalgara had made, Mont Blanc Noland.\n400 years ago, a crew was fleeing on a beach towards their anchored ship. The \"Demon of Shandora\" was on their heels, said one of the crew members. The captain set sail but Kalgara theew the ball-shaped anchor at the ship and jumped aboard to attack the crew. He told them to leave everything and go.\nOn another ship at sea, Admiral Mont Blanc Noland was told the ship was out of food. He jumped in the water. The crew speculated on him abandoning them but he came back up to the surface, having captured a huge fish for them to eat. The same ship was later caught in a storm. Noland was writing in his logbook when he heard a bell in the distance.\nOn an island, a dying priest whose skin was covered with green stains told the men surrounding him that Shandia was cursed and that to save the village, a girl must be offered to the Sacrificial Altar. The priest died and the Shandia around him commented that there have been a hundred victims already.\nIn a castle chamber, Mousse said that if it would save the village, she was willing to offer her body and was looking forward to meeting the Sun God. Her mother sobbed.\nA crying young man called Seto was in the forest in the rain trying to get the same type of green skin stain off his arm with a rock. Kalgara walked by and Seto angrily told him he had wanted to be like him one day and instead he was going to die \"like this\".\nThe storm was dying down and Noland's crew was grateful to him that he had directed them to the island. However, they did not hear the bell like he did. The crew went to shore and saw a Southbird, so they thought the weird sound it makesmade must have been what the Admiral had heard. The bell rang at that moment and they commented on the beauty of its sound. Noland guessed this meant the island was inhabited.\nAs they went into the jungle, they ran into Seto. The Doctor diagnosed Seto's weird stains as Tree Fever and Noland ordered the crew to get some conine to administer to the boy and the whole crew. They arrived at the Shandia town and noted with sadness that even the crop was infected and the whole village was sick.\nAt the Sacrificial Altar, Mousse was brought by boat to the altar while a priest was delivering a prayer for the village to be saved from the disease. As Mousse was tied down on the altar, Kashigami swam to the altar and hovered over the girl. As the giant snake was about to eat Mousse, Noland jumped in the water, climbed the altar, and beheaded Kashigami, much to thr horror of the Shandia who had come to pray to the Gods for the safety of their loved ones. Noland comforted a crying Mousse but the villagers were infuriated and screamed for both of them to be killed to appease the Gods that surely must be furious at one of them having been killed. Noland's crew was worried for him and, encouraged by the cries of the crowd, Kalgara swam to the altar and attacked Noland.\nNoland introduced himself as an explorer from the North Sea and tried to defend himself to Kalgara who wanted to hear nothing of it. While Noland fought him to a standstill, Kalgara threw a knife at Mousse and encouraged her to kill herself to appease the Gods. Noland stopped her but Kalgara speared him from behind.\nNoland's crew had been taken hostage by some of Kalgara's warriors who were holding knives to their throats. Kalgara ranted that any intruders were banned from the island and that on top of it Noland had killed a god and his life alone would not atone for this. They must all be killed. An infuriated Noland dismissed those notions of sacrifice as a disgrace and lectured Kalgara about progress. He said that if their Gods cared about the Shandia's lives, then those rituals were the complete opposite of what they would want. Noland told the villagers he would \"lift the curse\" and cure the disease but he needed time and if he ended up not keeping his word, then they should feel free to do whatever they wanted to him and his crew. In exchange, if he did save them, they must swear never to hold human sacrifices again.\nThe villagers were furious and Kalgara dismissed him and startdd to attack him once more. The Shandia Chief interrupted and told them to give Noland a chance. He had until tomorrow evening to cure them all and then his fate shall be decided.\nNoland's crew were locked into a cage and worried about getting killed tomorrow. Mousse who was in a nearby cage asked about Noland. They explained to her that he was a skilled explorer and botanist traveling around the seas to find new species for his research but got into trouble every once in a while.\nA council was gathered and upset at the chief for giving Noland a chance. The chief pointed out there was nothing to lose by waiting. Kalgara said that if he felt the slightest bit of threat from Noland, he would not wait until tomorrow to kill him. The chief said that while he could not hear the words of the Gods, he knew to recognize the words of a wise man. Kalgara stormed out and ran into Seto outside who said he was cured and wondered what Noland meant when he mentioned \"progress\".\nIn the forest, Noland was happy to have found a Kona Tree.\nThe ground suddenly started shaking and the villagers thought this was an earthquake to punish them for what had happened. After it stopped, Kalgara went onto a high rock to assess the damage and saw part of the forest was sinking. He spotted Noland injured and stuck in a crevice and comescame nearby to gloat that God had punished Noland himself. Noland and Kalgara exchanged some unpleasant words until Noland said he had to get out of that spot he was stuck into and hurry to the village. Kalgara said he wanted to stay and watch him try to do that.\n"
}