{
  "chapter_number": "Episode 225",
  "title": "The Man of Pride! Foxy the Silver Fox",
  "short_summary": "Luffy rescues Foxy, Hamburg, and Porche from a storm at sea. When they reunite with the Sexy Foxy ship, they find it captained by somebody new. Foxy accepts a Davy Back Fight in order to regain his ship and crew. Donning the afro once again, Luffy vows to defeat the captain.\n",
  "long_summary": "At Marine Headquarters, a sailor reports to an officer that they cannot find \"him\" anywhere, and that \"he\" has taken his bike, probably to the open sea, much to the dismay of the Five Elders. At the same time, a tall figure whose face was blocked by the sun is seen holding a wanted poster of Luffy while riding a bike across the sea, commenting on the trouble that seems to run in the Monkey family.\nOn the Going Merry, the Straw Hat Pirates find themselves dealing with a storm that keeps growing larger. Luffy is seen sliding across the deck on top of a barrel. Usopp and Zoro are trying to keep the main mast in place. Chopper fears that it will snap, but Sanji eases his stress, stating that Nami will get them out of it. They then spot Silver Foxy, Porche, and Hamburg on a life boat. A big wave comes and their boat would have been endangered if they were to get caught in it. Foxy tries using is Devil Fruit powers, but it has no effect. Luffy, seeing their predicament, sends his rubber arm to grab them, but they hit the side of the Going Merry. Foxy's life boat gets destroyed.\nIn the kitchen, the three sit wrapped around thick blankets and Foxy becomes sad at how bad his life is turning out and believes he would be better off dead. Sanji tries to raise their spirits with some soup, only for Foxy to criticize his cooking. Porche goes looking for Chopper to share her soup with. When Chopper hears her voice, he freezes and uses his powers to change in horn point.\nThe next day, Usopp, Luffy and Hamburg are fishing. Foxy goes on the deck, searching for food. He accidentally mistakes Nami's orange hair for an orange and she beats him. Hamburg spots the Sexy Foxy and informs Foxy about it. Foxy, Hamburg, and Porche yell from the tip of their lungs to signal the ship. The two ships dock next to each other. Robin informs Chopper, who is hiding in a barrel, that they were leaving. Chopper is relieved that Porche is gone.\nOn board the Silver Foxy, the entire population of the ship is seen crying. Then the captain of the Fang Frog Pirates, Kibagaeru, emerges and informs them that he owns the ship and everything aboard. Foxy walks away with disbelief, but Kiba challenges him to a Davy Back Fight. Foxy accepts his challenge without any hesitation. Luffy tells the crew to watch.\nFoxy then launches a Slow Slow Beam, but it is ricocheted back to him by a shield of swords. The Straw Hats are absolutely surprised at the event. Kiba's men go on the offensive and attack Foxy, throwing a barrage of punches at him. Hamburg uses his club and makes his way through. Kiba then grabs Porche and holds a knife towards her throat and threatens to slit her throat if Hamburg does not surrender his weapon. Hamburg drops it and the effects of Slow Slow beam wear off and the barrage of punches make Foxy to fall. Hamburg falls also after being beaten up. Kiba laughs and points out that Foxy is a weakling, but Luffy stands out in protest, stating that he cheated. Kiba stated that he did challenge him, but Kiba did not accept. Foxy uses his trickery to fool the crew, but they catch up to his ruse and fire a canon at him.\nOn the Going Merry, Chopper and Robin are seen playing a board game. Chopper wonder if he should go check but Robin point out the Porche will just chase him again. Realizing that, Chopper apprehensively throws the dice and moves his pawn. Robin chuckles.\nThe smoke lifts and Foxy is down on the ground in agony. The Foxy loyal crew members look on in disbelief. One tries to save him, but is whipped by Kiba. Foxy gets back up and asks Kiba to back down, stating that Kiba is a bully controlling strong thugs. Kiba whips him again and Luffy rushes to his side. Foxy gives him the afro Luffy used in the boxing match against him. Luffy removes his straw hat and puts on the afro. Luffy prepares for a showdown, but Kiba refuses to fight a pirate worth 100,000,000.\n"
}