{
  "chapter_number": "Episode 152",
  "title": "Sail into the Sky! Ride the Knock-Up Stream",
  "short_summary": "The Going Merry is re-fitted by Masira and Shoujou to be more flight capable, and the Straw Hat Pirates catch a ride on the Knock Up Stream and head to Skypiea.\n",
  "long_summary": "The Straw Hats are awaiting Luffy's return. Nami is very upset that Luffy is taking too long and that they might miss the Knock-Up Stream. At that moment, Luffy arrives. The Straw Hat crew set out and Cricket tells Luffy that The City of Gold or the Sky Island has not yet proven to be non-existent. He tells Luffy that he may be laughed at; however, that is what romance is about. Cricket then thanks him for returning the gold.\nThe Blackbeard crew have moved out, and are looking for the Straw Hats to capture Luffy because of his high bounty. Luffy begins to make fun of the South Bird, pointing out that the bird is really uncomfortable when not facing south.\nOnce at sea, the Dark Cumulonimbus Cloud is spotted and the Straw Hats and Saruyama Alliance make their way towards the cloud. The Straw Hats guide their ship towards the whirlpool so as to ride the knock-up stream. Usopp, Nami. and Chopper begin to lose their nerve as they make their way into the whirlpool and plead with Luffy for them to go back. However, Luffy is far too excited to let them do that. Just as they got to the center of the whirlpool, the currents vanish and Nami explains that the main event is about to occur. While waiting for the knock-up stream, the Blackbeard pirates catch up to the Straw Hats and Blackbeard tells Luffy that he is there to claim his 100,000,000 head. Luffy, unaware of the increase, questions Blackbeard about this, before Blackbeard raises the poster for them to see as well as Zoro's bounty of 60,000,000. Usopp confirms that it was a new bounty poster and informed Luffy and Zoro of their amounts, with Nami deducing that the new bounty must be a result of what occurred at Arabasta. Both Luffy and Zoro are pleased with their high bounties.\nJust as the Blackbeard pirates prepared to attack, the Knock-Up Stream erupts and the Straw Hat's ship rides the stream up towards the Cumulonimbus Cloud aided by Nami's exceptional navigation skills. Meanwhile, the Blackbeard pirate's boat is smashed to pieces, leaving them stranded in the ocean.\n"
}