{
  "chapter_number": "Episode 236",
  "title": "Luffy vs. Usopp! The Spirit of the Clashing Men",
  "short_summary": "Usopp challenges Luffy in order to decide who keeps the Going Merry. Though he is injured, Usopp fights harder than he has ever fought before. Luffy actually seems to pose no threat but all the while, he remembers what great friends they used to be, sailing together on the same ship. Even after taking a harsh beating, Luffy defeats Usopp. Luffy and the crew then leave Usopp and the ship behind.\n",
  "long_summary": "As promised, Usopp returns to Scrap Island at 10pm for the duel with Luffy. Luffy tells him not to have any regrets regardless of the outcome. Usopp replies that, unlike previous enemies, he is well aware of what Luffy is capable of, and is ready to defeat him. He tells Luffy to come at him with everything he has. The rest of the Straw Hat Pirates watch from the deck of the Going Merry with varying degrees of concern.\nUsopp starts with some of the boasts he made when they first met. When Luffy comes at him with Gomu Gomu no Pistol, Usopp uses his Hissatsu Ketchup Boshi to fake coughing up blood. This stops Luffy in his tracks out of concern. Usopp mocks him for showing pity on the enemy, and blinds him with a Flash Dial, then hits him with Hissatsu Tamago Boshi, pelting his former captain with rotten eggs. Luffy tells Usopp to get serious; Usopp says he is, reminding him that this is how he fights. Usopp shoots Hissatsu Tabasco Boshi right in Luffy's mouth, making him spit fire and fall back right onto a pile of caltrops, scratching up his body. When Luffy gets up, Usopp knocks him back down with Hissatsu Koshou Boshi, which explodes in a cloud of ground pepper. Luffy coughs in fits and repeatedly lands in the caltrops.\nLuffy recovers enough to finally get out of the caltrops, remarking how much it hurts. Usopp says he will not give Luffy a chance to retaliate, and starts to amp up the danger with Shuriken Ryuuseigun, firing strings of throwing stars at Luffy, forcing him to focus on dodging. He gets in an area that appears to be smoky. Usopp says it is actually gas coming from a Breath Dial, but he could not smell it because of the rotten eggs. Usopp fires Kaen Boshi, setting off a tremendous explosion that throws Going Merry back from the shore. For a moment, Luffy lays on the ground and thinks about the past with Usopp. The water thrown up by the explosion makes it look like the ship itself is crying.\nUsopp remarks he knows that explosion would not kill Luffy. Luffy tries to attack with Gomu Gomu no Gatling, but Usopp responds with Sakuretsu Saboteso Boshi, which explodes on Luffy's fist and pummels Luffy with small pins. Usopp fires several Sanren Kayaku Boshi at Luffy, forcing him to dodge the resulting explosions. Luffy finally knocks Usopp back with Gomu Gomu no Pistol. But when he tries Gomu Gomu no Bazooka, Usopp catches it with an Impact Dial and dishes it back out on Luffy, knocking Luffy back, but also injuring his arm with the recoil. That was the last of Usopp's tricks. Out of ideas, he stands there and takes it as Luffy fires Gomu Gomu no Bullet, punching him hard in the chest and knocking him out, winning the duel.\nPutting his straw hat back on, Luffy tells Usopp that he can keep the Going Merry, and bids him goodbye. Chopper wants to treat him, but Sanji stops him, saying it is wrong to show pity on the loser of a duel. Chopper still leaves some supplies for him to help treat himself. As he returns to the ship, Luffy tears up, commenting on the heavy burden. Zoro responds that it is the burden of the captain, and the rest of the crew relies on him to bear it. As Luffy, Chopper, and Nami tear up over this turn of events, the crew then leaves the ship, and a crying Usopp, behind.\n"
}