{
  "chapter_number": "Episode 106",
  "title": "Trap in a Desperate Situation! Breaking Into Rain Dinners",
  "short_summary": "Most of the Straw Hat Pirates, along with Smoker, are trapped by Crocodile. Vivi reunites with the royal guardian Pell, but is captured by Miss All Sunday who also defeats Pell. Crocodile reveals his invincible Devil Fruit power. Miss All Sunday shows her Devil fruit powers.\n",
  "long_summary": "Luffy, Zoro, Nami, and Usopp run towards the Rain Dinners casino. They know that without Vivi, they do not know what Crocodile looks like and realize that Vivi is not there with them. They start shouting for both Vivi and Crocodile but realize this is useless. Smoker catches up to them and chases them inside the casino, but the casino security personnel stop him saying that government employees are not allowed in the casino. He persists in chasing after the group and the ruckus causes casino security to try and also stop Luffy's group.  They are unable to contain the commotion so the manager, Miss All Sunday, tells the personnel to send them to the VIP room.\nThe group is led to the VIP room and Smoker continues to give chase. Inside, the hallway is split into two, with a sign saying that VIPs should go to the left and pirates should go to the right. The group decides to go to the right, being that they are pirates. This leads to a dead-end and a trapdoor. The trapdoor opens and the group, along with Smoker, fall down said trapdoor. \nMeanwhile, Chopper is still looking for his crewmates and sees Tashigi. He realizes that the Marines are after the Straw Hats and tries to stop her. However, Tashigi bumps into him and falls on top of him, her glasses also falling onto Chopper's eyes. Chopper becomes disoriented and dizzy due to the prescription of Tashigi's eyeglasses. Tashigi, unable to see without them, does not recognize Chopper who has fallen down. Sanji sees this and hides. Chopper gives back her glasses, but she still does not recognize him. Sanji and Chopper are reunited.\nIn the casino, Luffy's group and Smoker are inside a prison cell. Luffy notices that something is wrong as he is feeling weak all of a sudden. Smoker then hits Luffy with his jitte causing Luffy to fall and feel helpless like he's falling into the sea. Smoker explains that the tip of his weapon is made of sea prism stone which is a rare mineral that gives off a mystical energy with the same wavelength as the ocean or basically a solid form of the sea. It affects Devil Fruit users the same way as if they have fallen into the ocean. As Zoro is about to attack Smoker for attacking Luffy, Crocodile interrupts and tells them to try to get along since they are about to die together anyway.\nCrocodile tells Smoker that he knows he is there on his own without orders from the government, since he knows the government trusts him completely, being a Warlord of the Sea. Crocodile then proceeds to tell them that he will deal with them after their \"guest of honor\" arrives.\nMeanwhile, outside Vivi is fending off Baroque Works Billions, and she is knocked down and about to be captured. Shortly after, bullets rain down on the Billions from the sky. Pell then swoops down and carries Vivi to safety. Pell updates Vivi on her father's plans and then eliminates the Billions who were after her. Just as she is about to leave and find the Straw Hats, Miss All Sunday appears saying that she has been \"invited\" to a gathering. Vivi attacks her but is overpowered and falls down. Pell tries to take her down, but Miss All Sunday manages to use her Hana Hana no Mi Devil Fruit powers and overpowers him, too. Miss All Sunday then takes Vivi to the casino.\nBack inside the prison cell, Luffy's group and Crocodile wait for Vivi and Miss All Sunday to arrive. Vivi arrives and tries to attack Crocodile, but her attack is ineffective as Crocodile has turned into sand. Crocodile reveals that he has eaten the Suna Suna no Mi fruit which turns him into a Sand Human. Crocodile then has Vivi sit down and states that the \"party\" is about to begin. Miss All Sunday then agrees and tells everyone that it is already noon and that it is time for Operation Utopia. Asked what this was, Crocodile then says that Operation Utopia means the demise of the Kingdom of Arabasta. \n"
}