{
  "chapter_number": "Episode 210",
  "title": "Foxy the Silver Fox! A Violent Interference",
  "short_summary": "With only Luffy, Nami, and Porche's boats remaining, it is an all out war to the goal, but after Foxy exposes his Devil Fruit powers, Porche wins and choose to take Tony Tony Chopper from the crew. The second round prepares to start. \n",
  "long_summary": "The Straw Hat Pirates overcame the various forms of sabotage at the hands of the Foxy Pirates. The Straw Hat Pirates now must traverse a coral reef. They find that the reef is filled with currents. While the Cutie Wagon was pushed back, the Straw Hats' boats manage to overcome the currents.\nHowever, Foxy fires a smokescreen arrow that renders the Straw Hats unable to see. They manage to overcome this sabotage too, but they approach the Long RIng, a giant whirlpool. They use the Impact Dial to fly over the whirlpool. However, the Well Whatever landed on the Long Cape and broke, disqualifying it from the game.\nOnly the Barrel Tiger and Cutie Wagon remain. The Cutie Wagon finally overcomes the coral reef by using Capote's Two-Fish Engine technique. Meanwhile, the Barrel Tiger clears the Long Breaking Waves obstacle and Foxy's Fake Sign. So, Foxy disguises himself as an elderly woman and asks the Barrel Tiger to stop and help her. Nami refuses and continues on. \nNami then passes through Foxy's fake finish line, but Porsche falls for the trick and stops. Nami finally finds the real finish line and approaches it, but Foxy uses his Noro Noro no Mi powers to slow down the Barrel Tiger, allowing the Cutie Wagon to win.\nFoxy explains that his powers allow him to emit particles that can slow down an object. He then selects Tony Tony Chopper as his new crewmate as the prize. Chopper tearfully accepts joining the Foxy Pirates. \nBecause Chopper was intended to participate in the second event, and that the Straw Hats cannot change their order, they will only have two participants for the second event: Zoro and Sanji. Foxy explains the second event, the \"Groggy Ring,\" where one player on each team would be the ball that would have to go through the other team's ring. \nFoxy introduces his teammates, the Groggy Monsters: Hamburg, Pickles and Big Pan. Heavily disadvantaged, Zoro and Sanji prepare to start the event.\n"
}