{
  "chapter_number": "Episode 147",
  "title": "The Pirate's Summit! The Man Who Talks of Dreams and the King of Underwater Exploration",
  "short_summary": "Luffy orders Zoro not to fight back. The two of them along with Nami then meet a man outside the bar who told them that Sky Island does exist. They leave Mock Town, and get into a fight with Masira's brother Shoujou, another salvage monkey.\n",
  "long_summary": "It opens in the bar where Bellamy is still hitting Luffy and Zoro and the bar customers are laughing saying the town is not for dream loving pirates like Luffy and his crew. Nami is angry that Luffy and Zoro are not fighting back since they could easily defeat those guys. After much beating, Bellamy ordered someone get Luffy and Zoro from his sight stating they are eyesores. They were kicked out of the bar. Sarquiss offered to buy Nami stating that she would not survive the new era with those guys. Nami responded saying she is too good to join a team of pansies like Bellamy's crew. They responded laughing and saying the crew is full of weaklings. Nami grabbed Luffy and was walking down the street when someone yelled out saying Sky Island exists. Nami recognized Blackbeard and he told her that Luffy and Zoro won the fight and her tongue lashing was impressive as well. He said the new era Bellamy talks about is rubbish. He went on saying that people's dreams never end and if Luffy seeks the Summit, he would find fights that fists alone would not take him to. Blackbeard left saying he hopes Luffy finds Sky Island.\nReturning to the ship, the rest of the Straw Hat crew inquired as to why Luffy and Zoro look so beat up. Nami still very angry at what occurred at the bar asked why they could not fight back. Zoro stated that she had mentioned something earlier about that and Nami, still angry, said it was in the past. Chopper asked if they found anything related to the Sky Island and Nami stated she does not care about that anymore and just mentioning about Sky Island made the whole bar mock her. Robin returned and gave Luffy a map stating that a man was outcast for talking about his dreams.\nOn their way to find the man, they came across Shoujou. Luffy voiced that Shoujou looked weird and the Shoujou pirates took offense to that however, Shoujou brushed it off. Shoujou went ahead and told Luffy that a Warlord named Crocodile has been kicked off and he (Shoujou) is awaiting his invitation to join the Warlords of the Sea. Luffy told Shoujou to move aside because they had a place to go. Shoujou became upset and said that this area was his territory and if they want to pass by, they have to pay the toll fee. On hearing that, Usopp recognized that Masira had said the same thing. Shoujou heard Masira's name and asked what about Masira. Luffy responded saying they sort off kicked him but he is probably alive. Shoujou got very angry and began to use his Havoc Sonar. However, doing this, Shoujou was destroying his ship as well as the Straw Hats'. The Straw Hats fled from the reach of his voice.\nMeanwhile, back at the bar, a customer was talking about how a beautiful and strong woman was inquiring about Mont Blanc Cricket. Another responded saying that sea territory belonged to the Saruyama brother but Cricket is known to have acquired a new gold treasure. On hearing this, Bellamy asked where the man was located and would like to meet him. He demanded to be told more.\n",
  "characters": [
    "Nami",
    "Roronoa Zoro",
    "Monkey D. Luffy",
    "Sarquiss",
    "Rivers",
    "Ross",
    "Bellamy",
    "Lily",
    "Mani",
    "Muret",
    "Terry",
    "Marshall D. Teach",
    "Shanks (flashback)",
    "Portgas D. Ace (flashback)",
    "Usopp",
    "Tony Tony Chopper",
    "Sanji",
    "Nico Robin",
    "Shoujou"
  ],
  "ssum_frequencies": [
    [
      "fight",
      2
    ],
    [
      "the",
      2
    ],
    [
      "them",
      2
    ],
    [
      "with",
      2
    ],
    [
      "a",
      2
    ],
    [
      "luffy",
      1
    ],
    [
      "orders",
      1
    ],
    [
      "zoro",
      1
    ],
    [
      "not",
      1
    ],
    [
      "to",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      29
    ],
    [
      "and",
      25
    ],
    [
      "to",
      18
    ],
    [
      "that",
      16
    ],
    [
      "luffy",
      14
    ],
    [
      "they",
      11
    ],
    [
      "shoujou",
      11
    ],
    [
      "is",
      9
    ],
    [
      "was",
      9
    ],
    [
      "saying",
      8
    ],
    [
      "his",
      8
    ],
    [
      "nami",
      8
    ],
    [
      "a",
      8
    ],
    [
      "he",
      8
    ],
    [
      "about",
      8
    ],
    [
      "bar",
      6
    ],
    [
      "zoro",
      6
    ],
    [
      "not",
      6
    ],
    [
      "of",
      6
    ],
    [
      "bellamy",
      4
    ]
  ]
}