{
  "chapter_number": "Episode 227",
  "title": "Marine High Admiral Aokiji! The Threat of the Greatest Power",
  "short_summary": "The man they met, Marine Admiral Aokiji, appears to be incredibly lazy. He first displays his Devil's Fruit ability by freezing the sea so some deserted people can get off the island. Unfortunately, he's determined to catch Robin, Luffy, Sanji, and Zoro attack but they seem to be no match.\n",
  "long_summary": "The crew is shocked to see Robin panicking at the sight of the man they met, and immediately faced him, ready to attack. She tells the crew that the man is marine Admiral Aokiji one of the three Admirals: Akainu, Aokiji, and Kizaru; one of the World Government's three greatest power. Usopp questions why Aokiji is there but Aokiji ignored him and turned towards Nami and tells her that she is a \"super-babe\", which angers Sanji and Usopp.\nAokiji explains to them that he is only out for a walk. The crew questions Robin if she had mistaken Aokiji for another man, because of the way he talks, as his speeches are messed up, and forgot what he was supposed to say. Aokiji defends himself that they should not judge people by their appearance and that his motto is \"Justice with laziness\", to which both Sanji and Usopp agree. Aokiji then lies down saying that he is tired, which made Usopp question why he was sleeping while standing up, and says that he doesn't have plans to capture them and that he came there only to check up on Robin's whereabouts after the events of the Arabasta incident. He also tells them that he will report Robin being with the Straw Hats to headquarters, saying that the crew's total bounty will change from Luffy and Zoro's bounty of  160,000,000 to 239,000,000 because of Robin's bounty of  79,000,000 though Aokiji has trouble summing it up. Luffy tries to attack Aokiji but is held back by Usopp and Sanji. Aokiji tells him that he will not do anything when a group of people who are stranded on the island after their ship was wrecked.\nChopper tends to their injuries while Sanji cooks the food that he and Usopp have gathered. While eating, Nami asks what happened to them to which they replied that on their way home from their tour, a giant frog doing a crawl stroke collided with their boat. The group drifted to the island and waited for help when they saw a man riding a bicycle in the middle of the sea, which Usopp found absurd. Aokiji admitted that it was him, the man riding the bicycle. Luffy then remembered that he was supposed to attack Aokiji, but Sanji and Usopp stops him again, with Aokiji stating that he is only taking a walk. Luffy keeps arguing with Aokiji saying that he should go.\nAokiji decides that it is time to go and that he will help the group of stranded people get off the island, telling them to get ready and that there is a populated island nearby. Luffy warns the group that Aokiji is a marine, which prompt a man to ask what the problem is, and makes Luffy realize that normally marines are the good guys and pirates are the bad guys. Usopp and Chopper question how the group will get off the island when there are no boats nearby. Aokiji tells them not to worry, to which Robin replied that it is possible because of his powers.\nWhen the group is almost done preparing, they, along with everyone else, went to the shore. The Straw Hats help them secure their food and supplies, with Sanji saying that there is enough food for ten people. Luffy and Nami are relieved when Aokiji is really telling the truth when he said that he will help them, but Luffy still wonders how he will help them. Aokiji proceeds to the shore, tells everyone to stand back, and puts his hand in the water while everyone watches in anticipation. Suddenly, a Sea King appears, startling everyone, and Usopp and Luffy shouts at Aokiji to run and watch out, however, Aokiji just sat there still, ignoring everyone else and the beast. Luffy and Zoro prepares to attack when Aokiji activates his power, Ice Age, ultimately freezing the sea along with the Sea King, shocking everyone. Aokiji returns to retrieve his coat while stating that the ice should last a week, and telling the group to follow the ice path in order to reach a populated island in 4 days. Overcoming their shock, the group thanks Aokiji, saying that he made a miracle.\nAfter everything is set, the group is ready to head out, and the Straw Hats see the off. The group thanks the Straw Hats for their help, with Luffy and the others telling them to take care. The crew have fun on the ice for a while and return back, when they saw Aokiji sitting on the ground watching them. Luffy asks why he is staring, and Aokiji replied that he is like his grandfather. Upon hearing him mention this, Luffy starts to sweat while Aokiji tells them that long ago, his grandfather used to cause a lot of trouble for him. He also tells them that he came for Robin and to have a look at Luffy, and says that he should just kill them off right there. He explains that even if the World Government is still ignoring them, if they study their backgrounds and past deeds, though small in group, they will be troublesome for them. Aokiji continues that what makes their crew dangerous is Nico Robin. Luffy angrily shouts at Aokiji that he will beat him up, but Aokiji ignored him and proceeds to tell them that Robin's bounty not only shows her strength, but also reflects on the threat she poses to the World Government. Aokiji, albeit mockingly, compliments how well she did to survive as a child by betraying her partners and using them as tools, surviving the underworld concerned with only herself, and asks her if the crew is her next hiding place.\nSanji is angered by this asking him what his grudge against Robin is, to which Aokiji answers that he has no grudge but explains them that if there is any connection between him and Robin, it is because he failed to capture her once. He tells them that when they take her in, they will soon regret it, telling them that every organization that she have been was completely destroyed except herself. The crew defends Robin saying that they do not care about the past and that she is their friend. The Admiral states that she has become popular with the group, triggering Robin to use her devil fruit ability to grab hold of him. Aokiji calmly says that he is disappointed at her and tells her that he overestimated her and that he thought she was a more intelligent woman, but Robin uses her Treinta Fleur: Cluth, and shatters Aokiji's body like ice, leaving the crew shocked. However the crew is shocked more when the ice reforms and turns into Aokiji.\nAokiji calmly stands up, and cuts a few grass and throws them in the air. He blows at it, freezing it in the process, in order to make an Ice Saber, and swings it at Robin. As it was about to hit, Zoro intercepted it and Sanji kicks the saber out of Aokiji's hand using his Slice Shoot. Luffy went in to attack using his Gomu Gomu no Pistol, but before his attack connects, Aokiji suddenly grabs Zoro's arm and Sanji's leg. When Luffy's attack connects, Aokiji uses his powers to freeze his own body, along with Luffy's fist, Zoro's arm, and Sanji's leg, leaving the rest of the crew shocked and scared. With all three down, Chopper voice his concern about their frozen body parts, saying that if they do not treat it fast, they will get frostbite and that their tissues will rot. Nami shouts at Robin to run away, however she is ignored. Aokiji tells Robin that even if she had found some good friends, she'd still be the same, which Robin tries to tell him that he is wrong, and that she is no longer the same before. However, before Robin could finish what she was saying, Aokiji grabs her in a bear hug and proceeds to freeze his body, ultimately freezing her own as well, while the crew watches in horror.\n"
}