{
  "chapter_number": "Episode 22",
  "title": "The Greatest Pirate Fleet: Captain Don Krieg",
  "short_summary": "Gin returns to the Baratie with his also-starving captain Don Krieg to whom Sanji once more gives food. However, Krieg betrays the cook once he regains his energy and attacks the Baratie, despite the cook's best efforts to stop him.\n",
  "long_summary": "Sanji attempts to charm Nami, treating her with a fruit macedonia, which gets him into an argument with Zeff. However, fog arrives, and the customers notice the arrival of Krieg's fleet. Fearing Krieg's reputation, the patrons immediately flee the restaurant.\nKrieg enters the Baratie with Gin, begging for food and promising not to attack the ship if fed. Against the wishes of Patty and all the other staff, Sanji agrees to feed him, giving Krieg a bowl of rice. Krieg hungrily eats the food, but staying true to his reputation, once he finishes his food, he betrays the Baratie, launching an invasion. Having a damaged ship and a hundred starving subordinates, he demands the staff to feed all of his crew members, then vacate the Baratie so he could take the ship for himself.\nSanji attempts to comply with Krieg's demands, but the other staff restrain him, refusing to give up the ship. Patty shoots him with Shokuatari Meatball, but his golden armour leaves him completely unharmed by the explosive. In response, gun barrels emerge from the armour, and he opens fire at the kitchen staff. At this point, Zeff decides to submit to Krieg, giving him food for his crew members.\n",
  "characters": [
    "Zeff",
    "Sanji",
    "Roronoa Zoro",
    "Nami",
    "Monkey D. Luffy",
    "Usopp",
    "Don Krieg",
    "Carne",
    "Patty",
    "Gin"
  ],
  "ssum_frequencies": [
    [
      "the",
      4
    ],
    [
      "to",
      3
    ],
    [
      "baratie",
      2
    ],
    [
      "his",
      2
    ],
    [
      "krieg",
      2
    ],
    [
      "once",
      2
    ],
    [
      "gin",
      1
    ],
    [
      "returns",
      1
    ],
    [
      "with",
      1
    ],
    [
      "alsostarving",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      18
    ],
    [
      "to",
      9
    ],
    [
      "him",
      6
    ],
    [
      "with",
      5
    ],
    [
      "and",
      5
    ],
    [
      "his",
      5
    ],
    [
      "he",
      5
    ],
    [
      "a",
      4
    ],
    [
      "of",
      4
    ],
    [
      "krieg",
      4
    ],
    [
      "food",
      4
    ],
    [
      "ship",
      4
    ],
    [
      "staff",
      4
    ],
    [
      "sanji",
      3
    ],
    [
      "kriegs",
      3
    ],
    [
      "baratie",
      3
    ],
    [
      "for",
      3
    ],
    [
      "but",
      3
    ],
    [
      "attempts",
      2
    ],
    [
      "an",
      2
    ]
  ]
}