{
  "chapter_number": "Episode 140",
  "title": "Inhabitants of Neverland! The Pumpkin Pirates!",
  "short_summary": "The inside of the Rainbow Mist is full of wrecked ships and treasure and is guarded by five children. The children are actually friends of Henzo that got lost in the mist over 50 years ago.\n",
  "long_summary": "Inside the Rainbow Mist (a mysterious fog that is a portal to another dimension), Henzo and The Straw Hat crew, aside from Sanji, Nami, and Chopper, arrive in Ape’s Concert, a pirate ship graveyard within the Rainbow Mist. Robin explains that here beyond the Rainbow Mist is a land of eternity with untold treasures where all of its inhabitants never age. Luffy brings a chest full of treasure on board the Merry and tells everyone there’s a lot more on the shipwrecks. A mysterious voice threatens the crew with a curse of the dead if they do not return the treasure and leave right away. Ghosts then suddenly appear and an arrow is shot almost hitting Zoro. Luffy attacks the ghosts finding it is actually children trying to scare off any intruders. A boy named Rapanui announces they are The Pumpkin Pirates and demand the Straw Hats leave or else he will set off a bomb. Henzo recognizes Rapanui and the rest of the children and explains who he is, they’re very old friends. Trying to prove himself, Henzo sets off the bomb Rapanui is holding stating that it is just the \"Ka-boom Mark 3\", an invention of Henzo's that only tricks an opponent. Rapanui sets off a smoke screen and all the children disappear.\nAs a flashback, Henzo explains to everyone how years ago (as a child himself) the Pumpkin Pirates dreamed of becoming real pirates and tells of a time when their town of Ruluka was attacked and set on fire by The Wetton Pirates. The children flee the town by stealing the Pirates’ ship as Captain Wetton and his crewmate Ian chase them. As the children fight off Wetton and Ian, Wetton and Henzo fall overboard and the rest of the children sail directly into the Rainbow Mist never again returning. Understanding now that the Rainbow Mist kept the children from aging, the crew attempts to find a way out of Ape’s Concert.\nBack in the town of Ruluka, Sanji continues to fight Lake, the grandson of the town’s mayor Wetton, over not paying the towns Harbor Taxes. A coin hits Lake in the head knocking him over. He asks Sanji if he was the one that threw the coin at him so Sanji, Nami, and Chopper decide to lie and say it was. Lake picks up the coin and takes that as a payment for the tax to dock their ship in the towns harbor and formally welcomes them to the town. They proceed to the harbor looking for the rest of the crew. Lake tells them that The Going Merry was last seen heading towards Ape’s Concert beyond a strange mist in the ocean where a ship graveyard is. He tells them that the mayor has announced all the shipwrecks there have untouched cargo just laying around with jewels and coins and tells them Henzo is employed by the government to research how to safely enter Ape’s Concert. Nami tells Sanji and Chopper they need to go inside it to find their friends and hopefully the treasure. Mayor Wetton then walks up and punishes Lake for saying too much and tells them no one is allowed inside the Rainbow Mist without his permission.\n",
  "characters": [
    "Monkey D. Luffy",
    "Usopp",
    "Nico Robin",
    "Roronoa Zoro",
    "Henzo",
    "Rapanui Pasqua",
    "Pukau",
    "Akibi",
    "Rongo",
    "Isoka",
    "Wetton",
    "Ian",
    "Nami",
    "Sanji",
    "Tony Tony Chopper",
    "Lake",
    "Flip"
  ],
  "ssum_frequencies": [
    [
      "the",
      4
    ],
    [
      "of",
      3
    ],
    [
      "mist",
      2
    ],
    [
      "is",
      2
    ],
    [
      "and",
      2
    ],
    [
      "children",
      2
    ],
    [
      "inside",
      1
    ],
    [
      "rainbow",
      1
    ],
    [
      "full",
      1
    ],
    [
      "wrecked",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      50
    ],
    [
      "and",
      25
    ],
    [
      "a",
      19
    ],
    [
      "to",
      14
    ],
    [
      "of",
      14
    ],
    [
      "is",
      10
    ],
    [
      "that",
      9
    ],
    [
      "mist",
      7
    ],
    [
      "tells",
      7
    ],
    [
      "children",
      7
    ],
    [
      "rainbow",
      6
    ],
    [
      "henzo",
      6
    ],
    [
      "wetton",
      6
    ],
    [
      "them",
      6
    ],
    [
      "sanji",
      5
    ],
    [
      "in",
      5
    ],
    [
      "off",
      5
    ],
    [
      "he",
      5
    ],
    [
      "as",
      5
    ],
    [
      "lake",
      5
    ]
  ]
}