{
  "chapter_number": "Episode 234",
  "title": "Rescuing a Crewmate! The Raid on the Franky House",
  "short_summary": "Luffy, Sanji, Zoro, and Chopper follow Usopp's bloody trail to the Franky House where they find him passed out in front. The four of them challenge the Franky Family only to find out that their real target, Franky himself, is gone and has taken the money with him. Luffy decides to say good-bye to Merry.\n",
  "long_summary": "The episode starts off with the scene of Usopp standing in the doorway of the Franky House, demanding the money back from the Franky Family. Members of the Franky House mock him and call him weak, leading him to attempt to attack Franky. Franky dodges, and continues to mock Usopp while Usopp is down on the floor and out of breath. After a final kick to the chin, Franky leaves Usopp with the rest of his family members and says he's going out shopping with the Straw Hats money. However, Usopp shoots an exploding star at Franky, that doesn't affect him at all. As Franky leaves the house, members of the Franky Family beat up Usopp. \nThe scene then switches to Nami, wielding a pistol and protecting the last briefcase of money on the Going Merry, while reassuring herself that \"they\" (Chopper, Sanji, and Zoro, who are presumably going to get Usopp and head to the Franky House), can do it and she would only be a burden if she went along with them. \nThe episode switches to the perspective of Chopper, Sanji, and Zoro, who seem to have went the wrong way, as Usopp is not where Nami told them he would be. Chopper then notices a trail of blood, leading them to realize that Usopp might have gone to the Franky House on his own. Suddenly, Luffy falls out of the sky and lands in the canal. After Luffy was saved, they are assured that Usopp probably went to the house by himself. \nWe then see the government officials who visited Iceburg leaving Iceburg's office. The main government official of the group then goes on to talk about how Iceburg might have \"it\", insinuating that he has something of importance. From the perspective of Iceburg, Kalifa knocks on the door, and they speak about the \"it\" that the government official, Corgi, was referring to, telling us that he has whatever \"it\" is. We then see a wanted poster of a young Nico Robin on the wall of Iceburg's office. \nThe perspective then switches to Chopper, Zoro, Luffy, and Sanji, who find an unconscious Usopp outside of the Franky House. Seeing Usopp that way fueled their anger, and they head into the Franky House. The group walks in on a bunch of money-high Franky Family members, who are partying. After seeing one of the members get punched, the rest of them become scared. However, they gain back their confidence which immediately disappears again after Luffy punches through steel armor. After the Franky Family members lose, the scene cuts to Franky himself, getting on a train, and then back to the Straw Hats who decide to go back to the ship instead of chasing Franky. Luffy also decides they will say goodbye to the Going Merry.\n"
}