{
  "chapter_number": "Episode 126",
  "title": "I Will Surpass You! Rain Falls on Arabasta!",
  "short_summary": "Luffy and Crocodile reach the finale of their battle, but it will take more than the Shichibukai's defeat to quell the civil war.\n",
  "long_summary": "Vivi is distraught after Pell's sacrifice. Even though he got the bomb away, the shock wave still knocks people down and damages buildings. None of the Straw Hats on the surface can believe it, either. Even worse, the residents of Alubarna just get up and start killing each other again. Tashigi is held back by Marines on the scene from interfering. Having lost all hope, Vivi just starts repeatedly screaming, \"PLEASE STOP FIGHTING!\", from the bell tower. Only the Straw Hats can hear her. Nami sensing Vivi's pain and frustration tells the others to go stop the civil war at all costs.\nUnder Alubarna, the tomb is crumbling. King Cobra and Miss All-Sunday are both out, as well as apparently Luffy. Crocodile revels in what seems to be his ultimate victory. However, Luffy gets up, much to Crocodile's shock. Cobra comes to as well as Luffy declares he cannot be beaten. Crocodile tries to get him with his hook again, but Luffy kicks it away so hard the hook breaks off.\nLuffy starts beating on Crocodile, and is making headway, throwing him through the ruins. Crocodile has no idea why the scorpion venom is not working on Luffy. He deploys a knife from the stub of his hook, but when he lunges at Luffy, he gets kicked up into the ruins' rafters. Tired of these games, he uses Sables Pasado to blow away more ruins. Luffy inflates his body, then twists and blows, rifling up toward Crocodile. Luffy begins Gomu Gomu no Storm, using his Gatling attack while rocketing toward his enemy. Crocodile counters with Desert La Spada, forming a giant set of claw blades, but they are neutralized by Luffy's blood-soaked fists. Crocodile gets pummeled against the ceiling of the ruins. To Cobra's shock, Crocodile is eventually driven through several feet of bedrock and hundreds of feet into the air above Alubarna.\nThe Straw Hats and Vivi see Crocodile's unconscious body tumble through the air, and Vivi recalls reading about the worsening situation in Arabasta during their journey. Although the Straw Hats rejoice in Luffy's victory initially, the civil war continues to rage around them. As Vivi continues to beg them to stop, rain suddenly begins to fall. As they feel Alubarna's first rainfall in three years, the people finally stop fighting. Eventually the dust clears, and the people finally hear Vivi's pleas to stop fighting. The people drop their partisans when they realize their princess is alive and well. As Crocodile collides with the street, Luffy hits the bottom of the tomb next to King Cobra. Vivi tells her people the nightmare is finally over and Cobra thanks Luffy.\n",
  "characters": [
    "Nefertari Vivi",
    "Tashigi",
    "Usopp",
    "Nami",
    "Tony Tony Chopper",
    "Sanji",
    "Roronoa Zoro",
    "Pell (flashback)",
    "Smoker (flashback)",
    "Nefertari Cobra",
    "Nico Robin",
    "Crocodile",
    "Monkey D. Luffy",
    "Miss Friday (flashback)",
    "Mr. 13 (flashback)",
    "Matsuge (flashback)",
    "Miss Doublefinger (flashback)",
    "Koza",
    "Kebi",
    "Toto (flashback)"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "luffy",
      1
    ],
    [
      "and",
      1
    ],
    [
      "crocodile",
      1
    ],
    [
      "reach",
      1
    ],
    [
      "finale",
      1
    ],
    [
      "of",
      1
    ],
    [
      "their",
      1
    ],
    [
      "battle",
      1
    ],
    [
      "but",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      32
    ],
    [
      "to",
      13
    ],
    [
      "and",
      12
    ],
    [
      "luffy",
      11
    ],
    [
      "of",
      9
    ],
    [
      "crocodile",
      9
    ],
    [
      "is",
      8
    ],
    [
      "as",
      7
    ],
    [
      "vivi",
      6
    ],
    [
      "he",
      6
    ],
    [
      "his",
      6
    ],
    [
      "people",
      5
    ],
    [
      "stop",
      5
    ],
    [
      "straw",
      4
    ],
    [
      "hats",
      4
    ],
    [
      "on",
      4
    ],
    [
      "up",
      4
    ],
    [
      "cobra",
      4
    ],
    [
      "in",
      4
    ],
    [
      "ruins",
      4
    ]
  ]
}