{
  "chapter_number": "Episode 25",
  "title": "The Emergence of the Superb Kicking Skill: Sanji vs. the Iron Wall Pearl",
  "short_summary": "Krieg formally begins his invasion on the Baratie, and the chefs are overwhelmed by one of Krieg's officers, \"Iron Wall\" Pearl. Sanji defeats Pearl, but Zeff is now held at gunpoint by Gin.\n",
  "long_summary": "Krieg briefly speaks with his crew about his intentions, stating that if he could seize the Baratie, its inconspicuous appearance could be used for deception. Zeff's logbook could also provide useful strategies for traversing the Grand Line, as well as information surrounding the legendary treasure, One Piece. This motivates his men to start battle.\nTo prevent damaging the restaurant's interior from battle, Sanji orders a staff member to raise the \"fins,\" two platforms on either side of the restaurant which could function as the battlefield. The Krieg Pirates enter the Baratie's port-side fin. As the chefs battle, patissier Patty and charcutier Carne operate the Sabagashira I, a fish-shaped paddleboat, and charge at Krieg. Krieg's armour blocks the Sabagashira's artillery, and he then throws the boat back at the Baratie. The boat crashes into the fin.\nThe chefs charge at the Krieg Pirates, but are defeated. Remembering how they were accepted into Baratie, Patty and Carne increase their efforts and defeat many enemy forces, but are taken down by one of Krieg's officers, \"Iron Wall\" Pearl, a man covered in metal shields.\nPearl flaunts his record, as he has won all of his battles without shedding a single drop of blood. However, just as he speaks, Krieg strikes the mast Luffy is holding onto. Luffy falls and hits Pearl from behind, causing Pearl to hit his head against one of his shields, giving him a nosebleed. His record tarnished, Pearl enters an enraged state, where he sets himself on fire, which spreads to the entire fin.\nDespite this, Sanji manages to strike Pearl several times with his combat abilities, utilizing only his legs. Pearl is knocked back, and he is crushed by a falling mast, knocking him out. Despite the initial victory, Gin catches Zeff off-guard, holding him at gunpoint.\n"
}