{
  "chapter_number": "Episode 294",
  "title": "The Resounding Bad News! The Buster Call is Invoked",
  "short_summary": "While bragging to Nico Robin, Spandam accidentally invokes the Buster Call. The marines and agents starts to evacuate, leaving the Galley-La Company foremen and the Franky Family tied up. Meanwhile, the rematch between Monkey D. Luffy and Rob Lucci finally begins.\n",
  "long_summary": "After Kumadori's defeat, Chopper goes on a wild frenzy in his Monster form, knocking Franky over in the process. In the tunnel, Spandam gloats to Robin that once they cross the Gates of Justice, Robin's hopes will be dashed. Luffy calls out to Robin forcing Spandam to take Robin the rest of the way. Luffy then confronts Lucci in a storage room.\nIn the storage room, Lucci admires the Straw Hat captain's skill and Luffy couldn't have done so without his friends.\nMeanwhile, Chopper climbs the tower while Zoro is still bound to Usopp at a disadvantage against Kaku and Jabra. In Kalifa's bathroom, Nami's legs have been rendered softened leaving her weak. The CP9 reminds Nami she could make sacrifices to make beauty. However, Nami hopes to turn the fight around. Franky wakes up to give chase to Chopper.\nKashii and Oimo continue to hold the line blaming them for lying to them. In their efforts, Kashii is distracted by cannons and brought down by the Marines. The Galley-La workers soon find themselves surrounded by Marines. On a long staircase, Spandam pulls out a Transponder Snail trying to call in CP9, but Robin sees it's the Golden Transponder Snail, the very same one that obliterated Ohara. Then, the Marines think Aokiji activated the signal and it would take them 30 minutes to arrive.\nSpandam reminds Robin that in order to assure she gets handed to the Government, he activated the Buster Call, as he is willing to make sacrifices in the name of justice. Robin tells her captor of what happened in Ohara years ago. With the Pluton blueprints burned, all he has is Robin. Spandam learns his Transponder Snail's still up. He attempts to impersonate Luffy, but Robin issues evacuation orders before Spandam disconnects. Meanwhile, the other CP9 agents Lucci, Kaku, Kalifa and Jabra vouch to finish things up quickly. The Marines and agents begin to evacuate leaving the Galley La workers and Franky Family members behind and tied up.\nWith time running out, Zoro intends to remember using Usopp as the Nose Storm sword. Luffy and Lucci begin their fight with the agent's head being flung off. The two begin to exchange blows with none seemingly breaking through. With the storage room wrecked, Luffy attempts to brush his way through as he calls out to save his friend.\n"
}