{
  "chapter_number": "Episode 268",
  "title": "Catch Up with Luffy! The Straw Hat Pirates' All-Out War",
  "short_summary": "The Straw Hat Pirates enter an all-out war to catch up with Luffy. Sanji and Zoro bicker over who's stronger, Nami injures her own comrades with her improved weapon, and Sogeking fails at being a decoy. The Watchdog Unit of the Law show up to stop them and the foremen of Galley-La Company stay behind to fight.\n",
  "long_summary": "Luffy being surrounded by thousands of Marines is cornered on a cliff, when the Big Bazooka units fire at him making him fall off. The Marines find Luffy hanging off the cliff and try to make him fall to his death by stepping on his fingers, but the cliff collapses and Luffy starts running on top of the falling Marines. The Marines who did not fall tries to shoot down Luffy while he runs away.\nZoro and Sanji are arguing which one of them is better. The Marines notice Sogeking and Chopper and shoot the Rocketman but stop firing once they find out that Kokoro, Chimney and Gonbe were hostages (a trick invented to fool the Marines). Nami makes a cloud in the sky and uses Thunderbolt Tempo to take out most of the Marines. Unfortunately, Usopp's Perfect Clima-Tact design has left the power of the Tempo beyond her control, and it ends up firing thunderbolts all over the island. Nami gets launched away by her own attack and whacks Usopp over the head for messing up the weapon a second time. Her attack has backfired so badly even Zoro and Sanji have been hit. So, the Straw Hats (excluding Nico Robin) try to catch up with Luffy. Luffy is still fighting with the Marines, and notices that some Marines are leaving to stop the pirates at the Main Island front gate. Luffy now knows that his crew, Franky Family and Galley-La Company have arrived.\nZoro notices that they are being followed by the Watchdog Unit of the Law and that Marines begin to surround them. Sodom and Gomorrah come barging in with the Galley-La Company and Franky Family. Using his ropes, Paulie helps the Straw Hats get on. Galley-La go and fight the Marines, allowing the Straw Hats to focus on CP9.\nSpandam explains how he knew that Robin was coming to Water 7 by Aokiji, who also gave him permission to use the Buster Call. Robin gets punched for asking Spandam why Aokiji gave permission for the Buster call. Robin is reminded of her past by Spandam.\n"
}