{
  "chapter_number": "Episode 6",
  "title": "Desperate Situation! Beast Tamer Mohji vs. Luffy!",
  "short_summary": "Luffy defends himself from Buggy's assassin, Beast Tamer Mohji and his lion Richie. Allying himself with the town's mayor as well as a dog, the Straw Hats return to Buggy's base to confront him.\n",
  "long_summary": "Having warded off the Buggy Pirates, a wounded Zoro drags Luffy's cage to a local pet food shop. The mayor appears and takes Zoro into his house to nurse his wounds. Meanwhile, Luffy interacts with Chouchou, a dog defending the shop. The mayor explains that Chouchou's owner passed away from illness, so he continues to defend the deceased owner's store as a memento. Although Nami arrives with the key to Luffy's cage, Chouchou eats the key before the cage could be unlocked.\nBuggy sends his first mate, Mohji the Beast Tamer, to search for and eliminate Zoro. Riding his lion Richie, he finds Luffy still trapped in the cage. Mohji orders Richie to attack Luffy, inadvertently destroying his cage and setting him free. He then strikes Luffy into a house, destroying it.\nRichie raids the store for food and burns it to the ground as Chouchou fights in vain to defend the store. After seeing Mohji's actions, Luffy came to Chouchou's aid, defeating both Richie and Mohji before giving the dog a single box of pet food salvaged from the fire.\nMohji returns to Buggy to report his defeat. As an act of vengeance, Buggy fires a Buggy Ball into the town, destroying the mayor's house with Zoro still in it. Although Zoro was fortunately unharmed by the blast, the mayor decides to stand up to Buggy for his callous invasion of the town. Nami agrees to temporarily join forces with Luffy and Zoro and assist Boodle in confronting Buggy.\n",
  "characters": [
    "Buggy",
    "Nami",
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Richie",
    "Mohji",
    "Chouchou",
    "Boodle",
    "Hocker (flashback)"
  ],
  "ssum_frequencies": [
    [
      "himself",
      2
    ],
    [
      "buggys",
      2
    ],
    [
      "the",
      2
    ],
    [
      "as",
      2
    ],
    [
      "to",
      2
    ],
    [
      "luffy",
      1
    ],
    [
      "defends",
      1
    ],
    [
      "from",
      1
    ],
    [
      "assassin",
      1
    ],
    [
      "beast",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      20
    ],
    [
      "to",
      14
    ],
    [
      "buggy",
      7
    ],
    [
      "a",
      7
    ],
    [
      "and",
      7
    ],
    [
      "his",
      7
    ],
    [
      "zoro",
      6
    ],
    [
      "luffy",
      6
    ],
    [
      "cage",
      5
    ],
    [
      "with",
      4
    ],
    [
      "mohji",
      4
    ],
    [
      "richie",
      4
    ],
    [
      "in",
      4
    ],
    [
      "food",
      3
    ],
    [
      "mayor",
      3
    ],
    [
      "into",
      3
    ],
    [
      "house",
      3
    ],
    [
      "chouchou",
      3
    ],
    [
      "he",
      3
    ],
    [
      "store",
      3
    ]
  ]
}