{
  "chapter_number": "Episode 44",
  "title": "Setting off with a Smile! Farewell my Hometown, Cocoyasi Village!",
  "short_summary": "The townspeople across the island celebrate Arlong's defeat. The Straw Hat Pirates then depart towards their next destination, taking Nami along with them as a permanent member.\n",
  "long_summary": "News of Arlong's defeat spread to all villages in the island, and the townspeople celebrate their liberation. As Luffy eats and Zoro receives proper treatment for his wounds from Nako, Nami visits Bell-mère's grave with Nojiko and Genzo, where she reveals her intentions of leaving her village to join Luffy's crew.\nNightfall arrives and as the party continues, Nami consults Nako to have her Arlong Pirates tattoo removed. She replaces the tattoo with one depicting a mikan branch and a pinwheel before returning to her house to pack. She then departs, leaving behind the hundred million bellies she stole.\nMeeting the crew on the dock, Nami ignores the citizens attempting to thank her as she jumps onto the Going Merry. It is revealed she pickpocketed the townspeople as she ran past them. The citizens still thank her as she leaves. Meanwhile, it is revealed Genzo, feeling he no longer needed his pinwheel, left it on Bell-mère's grave.\n",
  "characters": [
    "Nojiko",
    "Chabo",
    "Monkey D. Luffy",
    "Sanji",
    "Usopp",
    "Roronoa Zoro",
    "Nako",
    "Johnny",
    "Yosaku",
    "Nami",
    "Genzo",
    "Bell-mère"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "townspeople",
      1
    ],
    [
      "across",
      1
    ],
    [
      "island",
      1
    ],
    [
      "celebrate",
      1
    ],
    [
      "arlongs",
      1
    ],
    [
      "defeat",
      1
    ],
    [
      "straw",
      1
    ],
    [
      "hat",
      1
    ],
    [
      "pirates",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      11
    ],
    [
      "she",
      8
    ],
    [
      "to",
      6
    ],
    [
      "her",
      6
    ],
    [
      "and",
      5
    ],
    [
      "as",
      5
    ],
    [
      "nami",
      3
    ],
    [
      "it",
      3
    ],
    [
      "of",
      2
    ],
    [
      "townspeople",
      2
    ],
    [
      "his",
      2
    ],
    [
      "nako",
      2
    ],
    [
      "bellmères",
      2
    ],
    [
      "grave",
      2
    ],
    [
      "with",
      2
    ],
    [
      "genzo",
      2
    ],
    [
      "leaving",
      2
    ],
    [
      "crew",
      2
    ],
    [
      "tattoo",
      2
    ],
    [
      "a",
      2
    ]
  ]
}