{
  "chapter_number": "Episode 254",
  "title": "The Shout of Nami's Soul! Return of Straw Hat Luffy!",
  "short_summary": "Nami finally reaches Luffy and tells him that he needs to hurry before Robin reaches Enies Lobby. Chopper finds Zoro and hands him the Sandai Kitetsu so he can escape the chimney. Luffy pushes apart the buildings he was stuck between and Paulie grabs them all so they can escape the Aqua Laguna's massive wave.\n",
  "long_summary": "Nami is continuing to head toward Luffy's direction while the other people are remarking how brave but stupid her actions are. Tony Tony Chopper spots something in the distance in a chimney thinking it's a sea anemone but it turns out to be Zoro. Overjoyed, Chopper heads toward Zoro at great speed. Meanwhile, Nami continues running toward the buildings that Luffy is trapped behind while remembering how Iceburg told her that Robin sacrificed herself and the entire world just to save her friends. Kokoro is beginning to worry as she and everyone else notice a large wave of Aqua Laguna is coming. Chopper makes it to Zoro while Nami finally makes it to Luffy having reach him as far as she can go. Nami angrily calls out to Luffy wanting to know why he is out there. Luffy says that the pigeon guy knocked him away and got stuck between some buildings. Nami explains to Luffy on why Robin did what she did and Luffy says he is glad. Luffy promises that he won't let Robin die. The waves continue to get closer as Chopper tries to pull Zoro out. Zoro then notices that Chopper has his Sandai Kitetsu as he knows it's cursed and asks Chopper to give it to his free hand. The giant waves begin to close in on the Straw Hats as Luffy prepares to free himself.\nLuffy manages to break out from the buildings using his brute strength while Zoro uses Sanjuroku Pound Ho to free himself from the chimney. Luffy uses his powers to get himself and Nami out of harm's way while Chopper eats a Rumble Ball and quickly gets himself and Zoro out of the way. However, just as it looks like the Straw Hats are safe, the waves continue to come and engulfs them. Fortunately for them, Paulie saves them using his ropes and pulls them all to safety. The group then run away from the coming waves and make it to safety with the other people. The people then start saying how the waves are even stronger this time around and notice the waves going back for now. Zoro is trying to get Chopper off of his face while Luffy thanks Paulie for saving them. Nami is surprised about the storm and Paulie says that even he is surprised as Aqua Laguna has never hit that hard before. Kokoro tells them that they are lucky to be alive while Zoro finally manages to get Chopper off of his face. Luffy wonders what Zoro was doing when the wave hit, and Chopper says that he was stuck in a chimney. Luffy begins to laugh at Zoro but Nami angrily pulls his face saying he did something similar twice himself. Luffy then wants to know where Sanji (and Usopp) are and Nami says that she has a lot more to tell them.\nAt Enies Lobby, Spandam is seen eating with Funkfreed saying how Admiral Aokiji was generous enough to have him control many government agents and battleships. He also says how he can't wait until CP9 brings him Robin and Cutty Flam. On the Sea Train, Sanji has finished beating all of the government agents in a train car. Sanji excitingly hurries forward to save Robin. Back at Water 7, Zoro has just been informed by Nami about Robin's actions and Sanji's whereabouts. Zoro asks Luffy what they should do next. Luffy says that they must set out and rescue them right away. Zoro stands up knowing that's what Luffy was going to say, and the Straw Hats prepare to make their next move.\n"
}