{
  "chapter_number": "Episode 59",
  "title": "Luffy, Completely Surrounded! Admiral Nelson's Secret Plan",
  "short_summary": "At last Commodore Nelson has seen through the ambitions of Eric, but takes it a little too personally and now the mystical dragon's life is in danger.\n",
  "long_summary": "The Going Merry manages to dodge Nelson Royale's cannonballs. Meanwhile, Lieutenant Commander Hardy sees Nelson's ships, and decides to relax, knowing that the Going Merry will be captured. However, Eric, who wanted the Dragon's Nest to himself, decides to pursue the Going Merry himself with a rowboat.\nAfter Luffy uses the Gum Gum Balloon to bounce one of the cannonballs back to one of Nelson's boats, Nelson commands the Marines to use the Big Elimination Cannon. To combat this, Usopp fires a cannonball into the Big Elimination Cannon, causing it to explode.\nNext, Luffy uses the Gum Gum Crossing Bridge move to create a bridge, allowing for Sanji and Zoro to board the Marine ship, then launches himself onto the Marine ship. Luffy and Sanji attack the army of Marines while Zoro cuts the chains connecting the Marine ships.\nEric boards the raft holding Ryu and Apis. He connects the raft to his rowboat and sails away. He betrays Nelson Royale, however, by refusing to give the dragon to him. Angered by his betrayal, Nelson commands the Marine ships to fire at Eric's boat. \nEric fights with Apis over Ryu, and Eric throws her down. However, Ryu gets up, knocks Eric off the rowboat, and roars. Apis is happy that Ryu can move and fly, but to her horror, Ryu flies towards Nelson's ship, getting hit by several cannonballs on the way. \nEventually, Ryu finally succumbs to the cannonballs, falling into the water. Ryu tells Luffy to keep Apis safe before dying.\n",
  "characters": [
    "Nelson Royale",
    "Eric",
    "Usopp",
    "Apis",
    "Ryu",
    "Roronoa Zoro",
    "Monkey D. Luffy",
    "Nami",
    "Sanji"
  ],
  "ssum_frequencies": [
    [
      "the",
      2
    ],
    [
      "at",
      1
    ],
    [
      "last",
      1
    ],
    [
      "commodore",
      1
    ],
    [
      "nelson",
      1
    ],
    [
      "has",
      1
    ],
    [
      "seen",
      1
    ],
    [
      "through",
      1
    ],
    [
      "ambitions",
      1
    ],
    [
      "of",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      23
    ],
    [
      "to",
      18
    ],
    [
      "and",
      8
    ],
    [
      "ryu",
      7
    ],
    [
      "eric",
      5
    ],
    [
      "nelson",
      4
    ],
    [
      "cannonballs",
      4
    ],
    [
      "luffy",
      4
    ],
    [
      "gum",
      4
    ],
    [
      "marine",
      4
    ],
    [
      "apis",
      4
    ],
    [
      "going",
      3
    ],
    [
      "merry",
      3
    ],
    [
      "nelsons",
      3
    ],
    [
      "ships",
      3
    ],
    [
      "however",
      3
    ],
    [
      "himself",
      3
    ],
    [
      "a",
      3
    ],
    [
      "rowboat",
      3
    ],
    [
      "of",
      3
    ]
  ]
}