{
  "chapter_number": "Episode 212",
  "title": "Rapid-Fire Red Cards! Groggy Ring",
  "short_summary": "The bickering rivals Sanji and Zoro manage to overcome the opposing team by working together for a few seconds. Luffy chooses Tonjit's horse, Shelly, over Chopper.\n",
  "long_summary": "The episode begins with Itomimizu narrating that Sanji and Zoro have been defeated, but is interrupted when the two Straw Hats suddenly stand up. The remaining Straw Hat members cheer for them as Itomimizu goes on to doubt if Zoro and Sanji have any strength left. Foxy then orders a \"Monster Burger\" from the Groggy Monsters, which causes the Foxy Pirates to go into a shock. The Straw Hats in the audience wonder what it could mean. The Foxy Pirates then start to cheer as Hamburg, Pickles and Big Pan pull out weapons, claiming to grind, slice and crush Zoro and Sanji into a \"monster burger\". Itomimizu says that this is clearly against the rules, but the referee is stretching and not watching the field. Luffy is seen getting enraged at the referee, but he is being held back by Nami and Usopp. \nThe Groggy Monsters start their attack with Hamburg aiming straight at Sanji, but he defeats Hamburg easily and sends him flying right in between the pans that Big Pan was crushing together. Pickles, angered at Hamburg's defeat, charges at Sanji, but is stopped by Zoro. Pickles tries to attack Zoro with his swords, but Zoro sends him flying with Mutouryuu: Tatsumaki. Pickles flies spinning at Big Pan and accidentally slices him in the chest. As Big Pan starts to fall over, Sanji runs behind him and makes him stand back up with Anti-Manner Kick Course. Zoro then starts running towards Big Pan with Pickles standing in between them, but Sanji quickly kicks him out of the way and straight into the referee. The referee tries to issue a red card, but he notices that both his cards and whistle are gone before passing out. It is then revealed that Nami stole them from him. Back in the field, Zoro is seen running at Sanji, and at first, Itomimizu thinks they are fighting again, but Zoro merely jumps on Sanji's leg, who sends him flying at Big Pan with Armée de l'Air Power Shoot. Zoro grabs Big Pan by his mouth and proceeds to land his head into the goal, much to the shock of the Foxy Pirates.\nThe watching Straw Hats start to cheer, as do some of the Foxy Pirates, before Foxy scolds them for praising the enemy. The referee then wakes up as Nami persuades him to blow the whistle, and he does, not knowing of the situation, and Itomimizu announces that the game is over and the Straw Hats are the winners as the Straw Hats cheer for Zoro and Sanji. \nItomimizu explains that now that the Straw Hats have won, they can either choose a member of the Foxy Pirates or take their flag. Luffy says that he's already decided, and several Foxy Pirates immediately start to think that Luffy is going to pick them as Chopper silently pleads Luffy to hurry. Just as Luffy is about to say who he chooses, Nami interrupts him. She tells Luffy that Foxy is probably going to meddle in the next game and suggests that Luffy choose Foxy in their team. She proceeds to say that even if they'd choose Chopper now, they could still lose him in the next game if the Foxy Pirates win, and taking Foxy out now would be the best way to ensure Chopper's return to the crew. The Foxy Pirates are shocked at this and call it the \"peanut strategy\", claiming that the Straw Hats are unfair if they do this. After Zoro agrees with them and says that Nami is in the wrong, she snaps at the Foxy Pirates and warns them not to get cocky. Zoro is seen on the ground with a huge lump on his head, suggesting that Nami punched him as well. \nItomimizu then says that Luffy is still free to choose anyone he wants from the Foxy Pirates. The pirates who thought they were going to be picked still think so, but this time Foxy is also thinking that Luffy might pick him. Then Robin points out that if they choose Foxy now, he would become their crew member, and the rest of the Straw Hats immediately say they don't want him, which shocks Foxy. He becomes depressed and his crew gathers around to comfort and encourage him. He cheers up at first, but when Sanji tells him to cut it, he becomes depressed again.\nItomimizu then steers the conversation back to where it was: who will Luffy choose? Chopper holds back his tears as Luffy says that he's going to take something back. Chopper cheers up, thinking Luffy is going to choose him, but then Luffy shouts out Shelly's name. Nami and Usopp start complaining and pulling at Luffy's face. Tonjit and Shelly appear in front of the Straw Hats and Luffy tells Tonjit he got Shelly back from the Foxy Pirates for him. Tonjit expresses concern over Zoro and Sanji's beat up appearances, thanks Luffy for what he did and then asks if Chopper is okay with this. Chopper seems crushed, but Luffy tells him to wait and promises that he will definitely win the next round and get him back. Luffy asks Chopper if he has a problem with it, to which Chopper says he doesn't. The episode ends with each of the Straw Hats looking forward to the next game. \n"
}