{
  "chapter_number": "Episode 5",
  "title": "Fear, Mysterious Power! Pirate Clown Captain Buggy!",
  "short_summary": "Luffy, Nami, and Zoro confront Buggy the Clown. Buggy threatens to fire a Buggy Ball at Luffy, but this attack is redirected back at his men.\n",
  "long_summary": "The girl introduces herself as Nami, a thief targeting and stealing from pirates. After collaborating with Luffy to escape from the Buggy Pirates, they find refuge at a restaurant, where Nami reveals her goal of collecting 100 million Berries for an unknown cause. She then goes on and reveals her navigation skills.\nNami betrays Luffy, tying him up and handing him over to the Buggy Pirates as a gesture of good will. Buggy accepts, locks Luffy into a cage, and prepares a Buggy Ball, a powerful, explosive cannonball. Buggy's pirates fire the cannon into the distance, destroying an entire row of houses. Zoro, who has just arrived at the town, notices the explosion.\nBuggy then orders Nami to fire a Buggy Ball at Luffy, but she refuses to do so. Another pirate lights the cannon's fuse for her, but Nami extinguishes the fuse with her bare hands, burning herself. Buggy orders his pirates to attack her.\nZoro arrives at her aid and attacks Buggy, cutting off his hand and leg. However, Buggy's dismembered hand stabs Zoro from behind, then reattaches itself to Buggy's arm. He reveals that he ate the Bara Bara no Mi, allowing him to split himself into pieces, control them, and reattach them. Despite this, Zoro runs to the cannon, readjusts it to aim at the Buggy Pirates, and allows Nami to reignite the fuse, firing the cannon.\n",
  "characters": [
    "Nami",
    "Superhuman Domingos",
    "Pinky",
    "Monkey D. Luffy",
    "Buggy",
    "Roronoa Zoro",
    "Tightrope Walking Funan Bros",
    "Acrobatic Fuwas"
  ],
  "ssum_frequencies": [
    [
      "buggy",
      3
    ],
    [
      "luffy",
      2
    ],
    [
      "at",
      2
    ],
    [
      "nami",
      1
    ],
    [
      "and",
      1
    ],
    [
      "zoro",
      1
    ],
    [
      "confront",
      1
    ],
    [
      "the",
      1
    ],
    [
      "clown",
      1
    ],
    [
      "threatens",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      14
    ],
    [
      "to",
      10
    ],
    [
      "buggy",
      9
    ],
    [
      "and",
      8
    ],
    [
      "a",
      7
    ],
    [
      "nami",
      6
    ],
    [
      "pirates",
      6
    ],
    [
      "her",
      6
    ],
    [
      "at",
      5
    ],
    [
      "luffy",
      4
    ],
    [
      "zoro",
      4
    ],
    [
      "from",
      3
    ],
    [
      "reveals",
      3
    ],
    [
      "of",
      3
    ],
    [
      "then",
      3
    ],
    [
      "him",
      3
    ],
    [
      "into",
      3
    ],
    [
      "buggys",
      3
    ],
    [
      "cannon",
      3
    ],
    [
      "fuse",
      3
    ]
  ]
}