{
  "chapter_number": "Episode 97",
  "title": "Adventure in the Country of Sand!The Demons that Live in the Scorching Earth",
  "short_summary": "After leaving Erumalu, the Straw Hat Pirates plus Ace continue through the desert, facing the many dangers of it. Vivi and Nami explain what Dance Powder is and what it has done to Arabasta.\n",
  "long_summary": "The Straw Hats are on their journey to Yuba. Luffy is tired and thirsty, so the crew let him drink a mouthful of water, but he fills his cheeks to the fullest, so Nami hits him. During the night, in their camp, Vivi starts talking to Ace about Luffy. Ace then tells Vivi that Luffy has always been that way since he was a child, and that he has not changed a bit. He also tells her that he always had charisma and befriends people around him. In the morning, Luffy founds an extremely poisonous scorpion, but mistakes it for a shrimp. When Vivi wakes up and sees Luffy holding the scorpion she yells to leave it alone since a sting is extremely poisonous.\nThey continue their journey and Luffy proposes to have lunch because he is hungry. Vivi tells him that they are only one tenth of their way and Luffy makes up a proverb for eating. She then tells Luffy they can have a meal when they arrive to the next rocks and Luffy runs ahead. Later, Luffy invites the crew to play rock, paper, Hasami and whoever wins will carry all the equipment. He wins and starts to carry the equipment but then complains, saying that it's unfair, since he won the game. Usopp spots the next rocks and after telling the crew, Luffy runs ahead extremely fast. As he enters the rocks, a bird lands on one of them. He starts to hear noises, so he gets further into the spot, seeing a lot of birds on the ground and moaning. He grabs one of them and says to him that he will get a doctor, rushing out for Chopper. \nThe crew returns to the place only to find the birds are missing and their stuff all gone. Vivi explains that Warusagi are bandit birds that take advantage of travelers to steal their belongings. The birds are in front of them, showing off the things they got from them. Luffy starts chasing the birds and Vivi tell him to not do that, but he continues anyway. As he is chasing them, one bird falls and carnivorous plants start to get out of the sand. One of the plants eats Luffy, but he is able to break free. He then sees a camel that is going to be eaten by a plant and saves him after he asks him for help. After that, something big starts moving behind them. Ace apologizes for all the trouble his brother always brings but the crew thinks it is okay. Usopp spots Luffy far away riding a camel rapidly towards them. They wonder what is chasing him until Vivi remembers there are giant lizards that wait for their prey below the sand. Zoro, Sanji and Luffy are able to beat it, but another one appears behind Ace. The lizard is able to trap Ace in his mouth but it then explodes with fire inside it and Ace comes out. The Straw Hats eat the meat of the gigantic lizard and Nami names the camel Matsuge. The camel then is willing to carry her and Vivi through the desert. Everyone then continues their journey.\nWhen Luffy, Chopper, and Matsuge are running about to the group, Franky's theme can be heard.\n",
  "characters": [
    "Monkey D. Luffy",
    "Nami",
    "Roronoa Zoro",
    "Tony Tony Chopper",
    "Usopp",
    "Portgas D. Ace",
    "Sanji",
    "Nefertari Vivi",
    "Warusagi Birds",
    "Matsuge",
    "Sandora Lizard",
    "Barbarossa (silhouette)",
    "Rasa (silhouette)"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "it",
      2
    ],
    [
      "and",
      2
    ],
    [
      "what",
      2
    ],
    [
      "after",
      1
    ],
    [
      "leaving",
      1
    ],
    [
      "erumalu",
      1
    ],
    [
      "straw",
      1
    ],
    [
      "hat",
      1
    ],
    [
      "pirates",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      35
    ],
    [
      "to",
      21
    ],
    [
      "and",
      21
    ],
    [
      "he",
      18
    ],
    [
      "luffy",
      16
    ],
    [
      "a",
      13
    ],
    [
      "that",
      13
    ],
    [
      "is",
      10
    ],
    [
      "of",
      10
    ],
    [
      "him",
      9
    ],
    [
      "are",
      8
    ],
    [
      "their",
      8
    ],
    [
      "but",
      8
    ],
    [
      "vivi",
      8
    ],
    [
      "then",
      7
    ],
    [
      "them",
      7
    ],
    [
      "ace",
      6
    ],
    [
      "it",
      6
    ],
    [
      "for",
      6
    ],
    [
      "they",
      6
    ]
  ]
}