{
  "chapter_number": "Episode 239",
  "title": "The Criminals are the Straw Hat Pirates?The Bodyguards of Water 7",
  "short_summary": "The Galley-La Company continues to fight Luffy and explains that Robin and a masked man attacked Iceburg. Franky is enraged that they've stolen his opponent. An incredibly high tide called the \"Aqua Laguna\" is coming, Chopper and Sanji rush to warn Usopp. Luffy raises some chaos in order to meet with Iceburg, and he demands to know what is happening. Iceburg says he wants to see Robin one more time.\n",
  "long_summary": "After getting up, Franky is surprised to hear that Iceburg has been shot while Nami is shocked to hear that Galley-La is blaming them for the attempted murder. Luffy yells out that they haven't shot anybody but Paulie doesn't believe him. Paulie then says that Iceburg explained that two people attacked him: a tall man with a mask and the other being Nico Robin. Luffy and Nami are extremely shocked to hear this while Paulie thinks that she and the rest of the Straw Hat Pirates came to Water 7 just to murder Iceburg. Franky is surprised to hear that Iceburg survived five shots and Paulie informs him that Iceburg is a tough guy before turning his attention back to Luffy. Suddenly, Luffy is cut on the face by a weapon thrown by Kaku who says that Luffy and the rest of the Straw Hats are wanted: dead or alive. He then says that now that Luffy and the other Straw Hat Pirates have broken the law, the law has turned their back on them. Luffy gets up and explains that they choose to become pirates and doesn't believe that Robin will try and kill someone.\nLuffy gets up and wants to talk to Iceburg himself still saying that Robin cannot have done such a thing. Peepley Lulu then says that they won't let Luffy anywhere near Iceburg implying that criminals don't have the right to make demands. The Water 7 citizens then cheer at the remark and some of them manage to hold down Nami. Luffy still doesn't want to believe that Robin will try and kill someone but Paulie ignores his pleas. Paulie warns Luffy that there is no place to run or hide and prepares for a fight. He ties Luffy by his wrist trapping him but Luffy then dodges the blades thrown by Kaku. Paulie taunts Luffy while Luffy says that he still doesn't want to fight. Lulu drops his pistols knowing that Luffy's ability makes him invulnerable to gun shots and takes out saws along with Rob Lucci and Tilestone takes out a cannon. Tilestone fires the cannon and it appears to have hit Luffy. However, Luffy manages to dodge it by grabbing onto a rope that is holding a large crate hanging above at the last second. Lucci jumps up a Luffy with the large saw and misses Luffy but cuts the rope that he was grabbing onto. Luffy lands on the ground and dodges the broken crate pieces that try to fall on him. Luffy nearly runs into Lulu who attempts to attack him with swords but Luffy dodges each attack and backs himself to the nearby wall. Kaku traps Luffy by pinning him down onto the will with his blades and Tilestone blasts him with the cannon.\nAs a large smoke engulfs the area, Franky can be seen cheering for Galley-La as they overpower Luffy. However, Franky doesn't really mean it as he believes that he is the one that should defeat Luffy. Franky gets up and yells out to Galley-La to get out of his way. However, Kaku simply informs him that once they are done with Luffy, Franky can fight them all he wants. Franky gets real upset thinking that Galley-La is simply ignoring him and begins to charge up a large amount of energy. He then lets it all out a hurricane-powered blast that knocks away Galley-La, the citizens, and destroys Dock One in the process (Coup de Vent). During the blast, Nami escapes by headbutting the man that was trapping her and manages to get out of the blast range. Paulie explains how strong the move is while the large crane falls down and a large amount of smoke emerges the remains of Dock One. Nami is shocked to see how strong Franky really is and notices that there is no more angry mob. Suddenly, Luffy appears, unharmed, telling Nami to run. Luffy says that they must talk to Iceburg and the people notice that they are trying to escape. Luffy grabs onto Nami and grabs onto a building to get away.\nJust outside the gates of Water 7, Sanji and Chopper are watching over the Going Merry where Usopp is residing in. Sanji then says that they shouldn't get too close so that Usopp wouldn't recognize them. Sanji and Chopper suddenly start yelling at each other saying how Aqua Laguna is going to hit soon and must evacuate. Usopp starts to come out from the ship and Sanji and Chopper run away before he could notice them. Usopp is confused as he thought he heard someone but remembers how they are talking about the storm and notices the wind starting to pick up. Back at the remains of Dock One, Mozu and Kiwi remind Franky that Luffy and Nami are getting away. However, Franky says that his Coup de Vent exhausted him and his hair is a sign of this. Franky then promises to chase after Luffy again once he is recharged. In another area, Galley-La are getting themselves back up after Franky's last attack. Kaku is surprised at Franky's strength but Paulie remains them that they can't get away. Paulie says that the Aqua Laguna is going to hit soon and there are only two ways they could leave Water 7: by their ship or by the next Sea Train. Paulie knows that they will try to take the Sea Train and tells all of the members of Galley-La to hunt them down. As a Sea Train is heading for Water 7, Chimney and Gonbe can be seen from the window. Kokoro taunts them saying not to fall into the ocean.\nLuffy and Nami manage to make it to Galley-La Company but notices a bunch of shipwrights acting like guards. Nami concludes that Iceburg is inside and Luffy then bursts through the window. The people soon recognize Luffy knowing he is after Iceburg and the shipwrights begin to chase him. Luffy is running in the hall trying to look for Iceburg's room but nearly runs into a mob of shipwrights. Luffy runs in the opposite direction while, in another room, Kalifa informs Iceburg that Luffy is in the building. Iceburg then says that he has a plan while Luffy continues to run away from the shipwrights. Eventually, Kalifa notices Luffy and lets him get into Iceburg's room. As the shipwrights reach Kalifa, she informs them that Luffy hasn't been around and the shipwrights begin to scout the area. In Iceburg's room, Luffy thanks Iceburg for saving him from the shipwrights and Iceburg knows that Luffy isn't here to murder him. Luffy wants to hear Iceburg's side of the story about who attacked him and Iceburg concludes that Nico Robin was the culprit. Luffy thinks that there might be someone else that looked like Robin but Iceburg suddenly holds up a gun to him and he wants Luffy to bring Robin to him. Outside, the people are reading the newspaper articles about the Straw Hat Pirates attempting to murder Iceburg. Robin can then be seen reading the same newspaper article and looks down at the people with an emotionless stare.\n"
}