{
  "chapter_number": "Episode 102",
  "title": "Ruins and Lost Ways! Vivi, Her Friends, and the Country's Form!",
  "short_summary": "Zoro, Chopper, and Luffy manage to get themselves lost because of Luffy's hallucinations and stumble across some huge underground ruins which has a Poneglyph.\n",
  "long_summary": "This episode starts off with Luffy hallucinating because of dehydration. The crew is very confused on what he is doing, as he runs around the desert screaming random names. He starts throwing punches at people that are not there. Nami tells Zoro to get Chopper, but they see Chopper has collapsed because of the heat. Since Chopper has collapsed and cannot help Luffy, Nami tells Zoro to take care of Luffy. When Zoro starts walking towards Luffy to get him, Nami and the rest of the crew start off again, as they want to get to Yuba as fast as possible. When they start off Vivi thinks to herself that Luffy, Zoro, and Chopper probably will not be all right, foreshadowing that they will not be.\nZoro approaches Luffy, dragging Chopper, and tells Luffy to calm down. Luffy who is throwing punches at his hallucinogenic enemies, mistakes Zoro as Crocodile. He punches Zoro very hard, invoking Zoro to start fighting back. Zoro does not want to hurt Luffy, so he puts his swords away. He starts the beginning of a fist fight. The two continue throwing punches until they both punch each other very hard. This knocks both of them out. They collapse unconscious into the desert sand.\nChopper then wakes up confused on what happened, as he was asleep when they were fighting. Chopper runs over to where Zoro and Luffy are and wakes Zoro up using a pungent smelling medicine. Zoro asks Chopper where the group is and Chopper replies telling him they were gone when he arose. At first Zoro says they will just follow the group's footprints, but then he realizes the desert wind will have eroded them away.\nThe scene then changes to Nami and Vivi in an ancient ruin. Vivi remarks how Kingdoms change and fade away, that civilizations grow and die on this land, but the people stay the same. It is clear that she is afraid that her father's kingdom will fall to Baroque Works and become a fading kingdom. Nami tells her not to worry, that Luffy will take them down along with Crocodile. Vivi agrees, but she is still worried.\nBack to Luffy, Chopper, and Zoro. After a while Luffy wakes up and is confused on why they are alone. Zoro punches him, telling Luffy that it is his fault and now they are lost. They set off in a random direction. Once Luffy realizes what happened he starts complaining. Zoro and Chopper walk on ahead.\nThey start talking about why each one joined the crew. Chopper remarks that the crew seems so wild compared to him. Zoro then starts talking about how everyone has different goals, and their goals to be the best in what they do unite them.\nWhile they are still talking Luffy spots some shade and uses his rubber arm rockets to propel the three of them to the cave. Zoro sits on a rock that turns into a sink hole. He falls into a cavern. He spots the Poneglyph, and wonders what it is. Luffy and Chopper then both fall into the cavern and join Zoro.\nWhen their eyes have adjusted, they realize they are in a dome built by humans. Zoro, Luffy, and Chopper decide to leave and catch up with the rest of the group. Luffy swings his arm trying to get up and out of the underground dome, but misses making it slowly collapse. He finally succeeds and zooms out of the dome. They are sent flying into the sky. When they land Chopper smells that the wind has changed. He catches wind of Nami's perfume. They head off in that direction to meet up with the group.\nThe perspective changes back to the rest of the group. Nami and Vivi start talking about Luffy and how the crew came about. Nami says that in the pirate crew each person has an ability. Zoro has his swords, Nami is a navigator, Usopp is the liar, Luffy is the fighter, Chopper is the doctor, and Sanji is the cook. Each one of them plays a crucial role in the fabric of the Straw Hat Pirates and without each and every one of them doing their role, the crew would fall apart. This is how they can trust each other, through the fact that they know each one of them has some unique trait that allows them to be able to get through anything. Vivi is impressed with her answer and overall likes that theory. She turns her head and sees Luffy, Chopper, and Zoro coming over the horizon. She now knows Nami is right, that she does not have to worry because each crew member is powerful and loyal.\n"
}