{
  "chapter_number": "Episode 144",
  "title": "The Log is Taken! Salvage King, Masira!",
  "short_summary": "Nami's Log Pose begins to point to the sky, after that, a big ship falls from sky and the crew finds a map of an island named 'Skypiea' on a 200-year-old ship. Meanwhile, Masira and his crew appear to salvage the ship and think the Straw Hat Pirates are trying to steal their salvage. Nami thinks that it would be easier for them if Masira's salvage crew salvages the ship for them.  Luffy, Sanji, and Zoro continue to search the ship for clues while the salvage crew works to bring up the wreck.  Eventually a giant sea turtle appears and eats the entire wreckage with everyone inside.\n",
  "long_summary": "The Straw Hat Pirates notice some debris falling from the sky, initially thinking it was rain. Suddenly, an entire wrecked ship falls from the sky causing huge waves rocking the Going Merry after almost hitting it. When the seas have calmed down the Crew tries to figure out how a ship could fall from the sky. Nami then notices that her log pose is pointing towards the sky, thinking that it is broken. Robin suggests that the log pose isn't broken but is merely registering an island with strong magnetic pull further suggesting that it must be pointing towards Sky Island.\nThe Straw Hats are both in disbelief and excitement. Robin explains that Sky Island isn't exactly just an island in a sky, but rather, an entire ocean. Luffy tells them to set their course towards Sky Island but Sanji points out that they can't actually fly. Robin goes on to admit that her knowledge about the island is based solely on word of mouth and that she has never actually seen it. Nami thinks that the whole thing is made up and insists that their log pose is simply broken. Robin then argues that instead of trying to fix something that isn't broken, they should try to find a way to get to Sky Island. She further says that in the Grand Line, one must not doubt their log pose no matter how crazy things get, stating that this is the most steadfast, unbreakable rule in the Grand Line. \nRobin proceeds to study the skull of one of the sailors from the ship that just fell from the sky while Luffy and Usopp investigate the wreckage. After piecing together the skull, Robin sees that it has been punctured from an ancient medical procedure called craterization and deduces that the man must have been dead for at least 200 years. She further deduces that the ship must be St. Briss, an exploration ship from the South Blue. \nMeanwhile, as the ship is sinking, Luffy starts drowning. After being pulled up, he announces that he found a map of Skypiea within the wreckage. Nami inspects the map and remains skeptical since it could be a fake treasure map, further pointing out that even if it were real, the map doesn't show them how to get to the Sky Island. In order to get more information on how to get to Sky Island, Nami proposes that they salvage the ship that has now sunk to the bottom of the ocean. Sanji, Zoro, and Luffy volunteer to go, using special barrels attached to the Merry designed by Usopp which allows them to breathe underwater. \nWhile the trio is descending towards the shipwreck, a pirate ship arrives to where the ship has sunk. The captain of the ship introduces himself as Masira, Captain of the Masira Pirates and declares that the sunken ship is now the property of the King of All Salvagers. He orders his crew to raise the ship. Masira notices the presence of the Straw Hats and warns them about stealing \"his ship\" since, according to him, all ships that sink in the area are his property. The Straw Hats decide not to tell Masira that they have already sent a team to the shipwreck and also decide not to stop him from raising the ship. Nami uses her charms to avoid suspicion from Masira and he starts to try to impress her.\nAs Masira's crew is setting the cradle to raise the sunken ship, they ascend beaten up and unable to talk. However, Masira still does not suspect The Straw Hats. Underwater, Luffy, Zoro, and Sanji have made it to the wreckage and start to explore, during which time, Masira is able to set the cradle and starts raising the ship. The St. Briss starts to fill up with air and ascends but the Masira Pirates start to encounter problems caused by Luffy's group. Masira decides to investigate this himself and swims under. He finds the trio inside and asks them what they were doing in his territory. Instead of answering, Luffy simply states that he (Masira) looks like a monkey, which Masira takes as a compliment thereby losing aggression towards the group. While they are exchanging pleasantries, a gigantic turtle suddenly eats the St. Briss and surfaces beside the Going Merry.\n",
  "characters": [
    "Monkey D. Luffy",
    "Nami",
    "Usopp",
    "Tony Tony Chopper",
    "Sanji",
    "Nico Robin",
    "Roronoa Zoro",
    "Masira"
  ],
  "ssum_frequencies": [
    [
      "the",
      9
    ],
    [
      "to",
      6
    ],
    [
      "ship",
      5
    ],
    [
      "and",
      5
    ],
    [
      "a",
      4
    ],
    [
      "crew",
      4
    ],
    [
      "salvage",
      4
    ],
    [
      "for",
      3
    ],
    [
      "sky",
      2
    ],
    [
      "that",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      61
    ],
    [
      "to",
      34
    ],
    [
      "that",
      26
    ],
    [
      "and",
      19
    ],
    [
      "ship",
      16
    ],
    [
      "sky",
      12
    ],
    [
      "is",
      12
    ],
    [
      "of",
      12
    ],
    [
      "masira",
      11
    ],
    [
      "a",
      10
    ],
    [
      "from",
      9
    ],
    [
      "it",
      9
    ],
    [
      "island",
      9
    ],
    [
      "in",
      7
    ],
    [
      "they",
      7
    ],
    [
      "an",
      6
    ],
    [
      "robin",
      6
    ],
    [
      "luffy",
      6
    ],
    [
      "he",
      6
    ],
    [
      "straw",
      5
    ]
  ]
}