{
  "chapter_number": "Episode 74",
  "title": "The Devil's Candle! Tears of Regret and Tears of Anger",
  "short_summary": "Having subdued the giants, Baroque Works makes their move. Mr. 3 introduces Zoro, Nami, Vivi, and Brogy to the slow torture of becoming living statues of wax.\n",
  "long_summary": "After explosively beating down on the still trapped Luffy, Mr. 5 and his partner take Vivi to the giants' duel site, where Mr. 3 is busy further restraining Brogy with his wax. After that, Mr. 3 creates a large, cake-shaped pedestal upon which Vivi, Nami, and Zoro are placed. On top of the pedestal, he creates a rotating platform upon which he places several large candles, which spray wax over his prisoners, slowly turning them into wax figures. Then he explains to Brogy how he manipulated their duel, causing the giant to burst out in anger and break his restraints. However, before he can completely free himself, Mr. 5 knocks the giant out with several explosions and Mr. 3 renews the restraints. Meanwhile, Karoo digs Luffy out from under the rock. The bird, Luffy, and Usopp arrive at the scene just as Zoro attempts to free himself by cutting off his legs.\n",
  "characters": [
    "Brogy",
    "Mr. 3",
    "Dorry",
    "Miss Goldenweek",
    "Nefertari Vivi",
    "Miss Valentine",
    "Karoo",
    "Usopp",
    "Monkey D. Luffy",
    "Mr. 5",
    "Nami",
    "Roronoa Zoro",
    "Igaram (flashback)"
  ],
  "ssum_frequencies": [
    [
      "the",
      2
    ],
    [
      "of",
      2
    ],
    [
      "having",
      1
    ],
    [
      "subdued",
      1
    ],
    [
      "giants",
      1
    ],
    [
      "baroque",
      1
    ],
    [
      "works",
      1
    ],
    [
      "makes",
      1
    ],
    [
      "their",
      1
    ],
    [
      "move",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      9
    ],
    [
      "mr",
      5
    ],
    [
      "and",
      5
    ],
    [
      "his",
      5
    ],
    [
      "he",
      5
    ],
    [
      "to",
      4
    ],
    [
      "luffy",
      3
    ],
    [
      "3",
      3
    ],
    [
      "wax",
      3
    ],
    [
      "which",
      3
    ],
    [
      "out",
      3
    ],
    [
      "after",
      2
    ],
    [
      "on",
      2
    ],
    [
      "5",
      2
    ],
    [
      "vivi",
      2
    ],
    [
      "duel",
      2
    ],
    [
      "brogy",
      2
    ],
    [
      "with",
      2
    ],
    [
      "creates",
      2
    ],
    [
      "a",
      2
    ]
  ]
}