{
  "chapter_number": "Episode 190",
  "title": "The Destruction of Angel Island! Terror of The Descending Raigo!!",
  "short_summary": "Angel Island is destroyed by Enel's attacks. Luffy decides to go and ring the golden bell before Enel takes it away.\n",
  "long_summary": "The scene starts with the group at the foot of the beanstalk with Wyper asking about the golden bell. Usopp is completely lost as Wyper continues by asking Robin where the bell is. Usopp begs to get out in fear for his life as Robin tells Wyper it's at the top of the beanstalk. Robin says the ruins spoke of the city landing on Giant Jack which sent the bell flying high up into the clouds.\nThen there is a quick flash back of the crew walking through the forest. Then Enel speaks of finally having the bell as Luffy catches up to Enel so much so that Enel notices him and sends a lightning bolt at Luffy which he avoids, but it causes giant jack to split causing Luffy to fall with it. Wyper tries to climb the beanstalk but notices it has been cut. \"Great warrior Kalgara longs to hear its sound... that is our goal,\" says Wyper. Luffy tries to climb the stalk but is struggling to hang on as Enel mocks him saying he'll show him something miraculous.\nThen Luffy uses the golden ball and his rubber ability \"Gomu Gomu Yo-Yo\" to fling himself up but ends up breaking the vine and falling down. Nami runs over him to the surprise of Luffy as he thought he'd succeeded in flying up higher.\nThe scene cuts to the city dwellers questioning a giant ball that Nami explains is a thunderhead bursting to scene with giant thunder bolts. With the group seeing this and Robin saying a thunder cloud shaped like a sphere. The city dwellers try and make it to the ocean, and it cuts to Enel saying the Ark Maxim has truly made him omniscient as the ball falls upon the city. Enel exclaims \"Raigo!\" as the ball explodes on top of the city with the survivors looking back wondering if the White Berets have survived and realizing their homeland is gone forever.\nEnel laughs and says \"this is what the sky should look like\" then the scene cuts to a terrified Usopp and horrified Gan Fall.  Next it cuts to Conis on the Going Merry saying she wants to take them back to the blue sea. Then it cuts to Luffy and Nami with Luffy saying he has some unfinished business with Nami saying \"your life is more important than gold\". Luffy then says he won't die asking Nami if she'd seen it, the City of Gold, \"it wasn't a lie, the old timer's ancestor.\" Then it cuts to a flashback with Cricket and Luffy says he has to ring the bell so that the old timer and the monkeys would hear it and stop searching the ocean floor. It cuts to a flashback with the crew and Luffy explaining his intentions. Then to the crew with Zoro saying when Luffy says he's going to do something he'll do it.\nLuffy stands exhausted at the cut base of the beanstalk then grabs Enel's ship, and Enel easily kicks him off falling back down. Nami refuses to join him, and Enel exclaims all will perish sending everything back to the way it's supposed to be. This infuriates Luffy, but Enel easily stops him from climbing up again, this doesn't stop Luffy from trying but once again Enel stops him saying \"it's beyond anyone from stopping me now\". A flashback with Cricket saying we will send you to the sky.\nLuffy yells out \"I'm going to ring that bell\", and this ends the episode.\n",
  "characters": [
    "Usopp",
    "Sanji (K.O.)",
    "Roronoa Zoro",
    "Pierre (K.O.)",
    "Gan Fall",
    "Nico Robin",
    "Tony Tony Chopper (K.O.)",
    "Wyper",
    "Aisa",
    "Enel",
    "Monkey D. Luffy",
    "Nami",
    "Shandia Chief",
    "Conis",
    "Su",
    "Mont Blanc Noland (picture)",
    "Mont Blanc Cricket (flashback)",
    "Masira (flashback)",
    "Shoujou (flashback)"
  ],
  "ssum_frequencies": [
    [
      "angel",
      1
    ],
    [
      "island",
      1
    ],
    [
      "is",
      1
    ],
    [
      "destroyed",
      1
    ],
    [
      "by",
      1
    ],
    [
      "enels",
      1
    ],
    [
      "attacks",
      1
    ],
    [
      "luffy",
      1
    ],
    [
      "decides",
      1
    ],
    [
      "to",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      49
    ],
    [
      "to",
      29
    ],
    [
      "and",
      17
    ],
    [
      "luffy",
      16
    ],
    [
      "it",
      13
    ],
    [
      "with",
      12
    ],
    [
      "a",
      11
    ],
    [
      "enel",
      11
    ],
    [
      "of",
      9
    ],
    [
      "is",
      9
    ],
    [
      "then",
      9
    ],
    [
      "him",
      9
    ],
    [
      "saying",
      9
    ],
    [
      "as",
      7
    ],
    [
      "cuts",
      7
    ],
    [
      "bell",
      6
    ],
    [
      "says",
      6
    ],
    [
      "city",
      6
    ],
    [
      "up",
      6
    ],
    [
      "but",
      6
    ]
  ]
}