{
  "chapter_number": "Episode 232",
  "title": "Galley-La Company! The Magnificent Dock #1",
  "short_summary": "Paulie makes his debut when he retrieves Usopp's stolen money as he runs from debt collectors. Kalifa shows Luffy, Nami, and Usopp around Dock 1 and tells them how Iceburg founded the Galley-La Company.  While Usopp's attention is focused on the sight of a cannon being prepared for a galleon, the Franky Family sneaks up from behind and mugs him. A dock worker finds his suitcases and brings them back to Luffy and Nami, but Usopp is nowhere to be found. Kaku returns from the Going Merry and tells them that their keel is irreparably damaged. \n",
  "long_summary": "As Usopp continues to pursue the Franky Family, the latter was stopped by Paulie (a shipwright foreman in dock #1) as he was escaping from debt collectors. After realizing the money in the yagara he stole from the Franky Family, he tried to run away with the money and Luffy tried to stop him but Lucci stopped Luffy and said he'd do it, it was shown that Kaku is now checking the floorboard of Merry. As Lucci successfully stopped Paulie from taking the money, Franky Family was introduced to Usopp, Nami, and Luffy as demolition workers and that they are bounty hunters on the side. After the money was returned to the Straw Hats, Lucci and Paulie engage in a fight that did not last long and finally the Straw hats was permitted to enter Dock #1.\nInside the dock #1, as Kalifa states how Galley La company was built, Luffy on the other hand was shown asking Iceburg to join their crew, Iceburg then ask if they have no shipwright in the crew which Luffy proudly admitted and stated that they went to Water 7 to find a shipwright and to make him join their crew, which lead them again to the subject of Luffy asking Iceburg to be one of their crew, which was rejected right away by Iceburg saying that he is the mayor of Water 7.\nIceburg suddenly asked if Nico Robin is really their crewmate, Luffy confirmed and said that Robin is a smart woman. Usopp was seen admiring craftsman work when he was suddenly attacked, again  by the Franky Family. On the other hand, as Chopper tries to find Robin, he found Sanji in stead.\nKaku finally returned and Zoro was shown in Merry's deck remembering the conversation with Kaku. Back to Luffy and Nami, one of the craftsmen of Galley la company (GLC) brought back the cases that Usopp was carrying. As Luffy and Nami go on and on about how they want Merry repaired, and that they would pay enough, as they were stopped by Kaku and said that the Straw hats have been having some tremendous journey. Luffy said that it was true and told them about their adventures and asked that they don't believe him, only to be answered by Kaku that he believes Luffy because Merry's scar from battles are too deep, and said that Merry was beyond repair even with the GLC's capability, Merry's chances of reaching the next island would be zero.\nIn the last scene, Zoro was shown looking at Merry, asking her if it's true that she can no longer sail.\n"
}