{
  "chapter_number": "Episode 165",
  "title": "Floating Land of Gold, Jaya! To God's Shrine!",
  "short_summary": "The Shandia's attack on Upper Yard has started. The crew is finally reunited, and everyone speaks up about what has happened. Chopper takes care of Gan Fall, and the pirates plan to steal the gold on the island.\n",
  "long_summary": "Nami, Zoro, and Robin made a huge discovery about Jaya that it did not sink to the bottom of the ocean but instead rose to the sky, along with all the native animals that have adapted to live in the sky. According to Nami, the half of Jaya in the sky is the City of Gold, to which Nami thinks God is praising her for being good. Meanwhile, the Shandia have started their invasion on Upper Yard and are up against the Priests. Luffy, Sanji, and Usopp have finally left the Ordeal of Balls and find themselves in a grass field full of skulls. Usopp assumes that the skulls are to intimidate anyone one who passes and says it's working. Just as Luffy, Sanji, and Usopp were traveling down the Milky Road, they heard explosions and saw several Shandia warriors flying above them. Wyper looked and fired an iron ball at them but Luffy rebounds it with Gomu Gomu no Fusen which surprises Wyper and the other Shandia. Sanji recognized that Wyper was the Guerilla that attacked them on their arrival. Wyper states that he will kill Enel and them if they get in his way, which signified that the Guerillas and Enel are enemies. Luffy is angered by Wyper for attacking him and takes actions by challenging him to a fight, but Wyper left commenting that they may not even make it out of the island alive.\nMeanwhile, the battle continues between the Shandia and the priests from Upper Yard. Luffy, Sanji, and Usopp are still making their way to the sacrificial altar through the Milky Road which seems like a roller coaster ride. Zoro's party arrived back to the ship and realized that Chopper was attacked and feared the worst, but Chopper came out crying. Luffy's party arrives at the end of the Milky Road and there were Sky Sharks that were ready to be beaten. Luffy knocked them out using Gomu Gomu no Gatling Gun and found the ship and the rest of the crew.\nThe crew believe that the ship was too dangerous to sleep inside, so they went ashore and went camping for the night. The Straw Hats had a session reviewing what had happened. Luffy's group, Zoro's group and Chopper gave reports learning of the priests, Mantra, and the City of Gold. Luffy made the decision that they would be taking treasure from the City of Gold.\n",
  "characters": [
    "Nami",
    "Roronoa Zoro",
    "Nico Robin",
    "Fuza",
    "Shura",
    "Braham",
    "Monkey D. Luffy",
    "Sanji",
    "Usopp",
    "Wyper",
    "Ohm",
    "Holy",
    "Gedatsu",
    "Raki",
    "Kamakiri",
    "Genbo",
    "Tony Tony Chopper",
    "Gan Fall",
    "Pierre"
  ],
  "ssum_frequencies": [
    [
      "the",
      5
    ],
    [
      "on",
      2
    ],
    [
      "has",
      2
    ],
    [
      "and",
      2
    ],
    [
      "shandias",
      1
    ],
    [
      "attack",
      1
    ],
    [
      "upper",
      1
    ],
    [
      "yard",
      1
    ],
    [
      "started",
      1
    ],
    [
      "crew",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      37
    ],
    [
      "and",
      22
    ],
    [
      "that",
      12
    ],
    [
      "to",
      11
    ],
    [
      "of",
      11
    ],
    [
      "luffy",
      7
    ],
    [
      "wyper",
      6
    ],
    [
      "a",
      5
    ],
    [
      "they",
      5
    ],
    [
      "them",
      5
    ],
    [
      "but",
      4
    ],
    [
      "sky",
      4
    ],
    [
      "in",
      4
    ],
    [
      "which",
      4
    ],
    [
      "shandia",
      4
    ],
    [
      "are",
      4
    ],
    [
      "sanji",
      4
    ],
    [
      "usopp",
      4
    ],
    [
      "gomu",
      4
    ],
    [
      "nami",
      3
    ]
  ]
}