{
  "chapter_number": "Episode 101",
  "title": "Heat Haze Duel! Ace vs. Scorpion Man",
  "short_summary": "Ace is hunted by a bounty hunter named Scorpion and finds out that Blackbeard is not in Arabasta after all. He leaves the group to continue looking for him, leaving Luffy a mysterious piece of paper, explaining that it will help them meet again at the top.\n",
  "long_summary": "The episode starts off showing the Arabasta desert. A man named Scorpion is shown sleeping on top of a large rock outlook with a bird that looks like an ostrich wearing a helmet called Popo. Food is scattered across the ground. Popo walks over to Scorpion and wakes him up. When Scorpion asks what's the matter. Popo points to rising smoke in the distance. Scorpion grabs his spyglass and points it to where the smoke is rising up. He sees the Straw Hats and Ace. Once Scorpion realizes who it is sweat covers his face and he gets excited. He has been waiting for the day that he finally tracked down Portgas D. Ace.\nThe Straw Hats and Ace are eating, Luffy and Usopp are asking for seconds. Sanji kicks them telling them to stop being greedy. After hearing this Luffy steals some from Zoro's plate. They all start fighting.\nVivi starts talking to Nami and asks why every meal turns into a fight. Nami responds by telling her to ignore it. They both admire Portgas D. Ace for eating quietly and cleaning his fork and plate. \"He sure is different,\" remarks Nami, comparing Ace to Luffy. Nami starts talking about how much Ace is worth, and that his bounty makes bounty hunters drool.\nSwitching back to Scorpion, he is loading a rocket launcher and starts aiming at Ace. He says, \"With this one shot, I'll settle everything.\" He lights the fuse on his rocket. Popo sneezes on the fuse putting it out without Scorpion noticing.\nNami starts getting ready to set off traveling to Yuba. She tells the rest of the Straw Hats to start getting ready by cleaning up. Two shadows appear behind some rocks without anyone noticing. Then all of a sudden a piece of meat starts to rise with no one touching it. This catches Luffy's attention. It is then revealed that it is rising due to a fishing rod pulling it up. Luffy still not noticing this, thinks that the meat is floating and talking. Once the two shadows pull the meat in, they start running away. Luffy chases after it.\nIt is then revealed as two boys trying to get food because they are starving. They had not eaten in ten days. As they start eating it, Ace asks if they came from the badland. They are shocked for a second that they were caught. They then get aggressive and scared of Ace, asking who are you, and saying that they won't give back the food. The eldest brother pulls out a revolver and says, \"One move and you're a dead man.\" Ace does not appear to be scared. Instead he smirks and calmly states, \"Dangerous things like that won't frighten me.\" The brother fires the weapon and Ace easily deflects it.\nThe Straw Hats come up behind Ace asking who they are. The eldest brother drops the revolver and says, \"We have something to ask of you. We need you to find and capture a man.\" The two boys pull out a picture of Scorpion.\nReturning to Scorpion, he is still waiting for the fuse to go off, even though it is no longer burning. He asks if Popo is ready, but he then realizes that Popo ate the fuse. Scorpion screams at Popo which catches Luffy's attention, who is right under where they are located. Luffy hops up and starts talking to them. In the commotion Scorpion looses track of Ace.\nThe two boys tell Ace they have traveled all across the badlands looking for him. Usopp asks who is the person they are looking for. Nami tells Usopp it is a bounty hunter called Scorpion. Ace tells them that he has business with Scorpion because the person who defeated Blackbeard in Yuba was called Scorpion.\nLuffy finds out the person he is talking to is the bounty hunter Scorpion. He tells Luffy that he is going to find and kill Fire Fist Ace. Luffy tells him that is funny and Scorpion responds by telling him \"Don't mock me\" in a playful tone.\nThe two boys realize who Ace is. They ask Ace if he is the real Ace, but he is too busy scanning the desert for something. Usopp asks if there is something wrong. He responds by saying, \"Two men and a bird.\"\nScorpion rides up with Luffy and says, \"I am Scorpion and I am going to defeat you.\" He is very nervous and it is obvious he is faking everything. They set up a 'true' battle between him and Ace.\nScorpion shoots a net at Ace, but he knocks it away back onto Scorpion. Then Ace quickly punches and defeats him. Ace tells Scorpion that he could not have defeated Blackbeard because he is too weak.\nThe eldest boy yells, \"That is enough, Dad!\" Everyone is surprised that Scorpion is their father. It turns out that they were originally farmers. Once the drought set in their farm died. The father told his children that he would become a bounty hunter, take down Ace, and return rich.\nHis children now tell him that he is no match for Fire Fist Ace. He chuckles and nervously says, \"What are you saying? Your dad is now the world's greatest bounty hunter.\" Scorpion gives a speech to his children, and returns to the fight. His children beg him not too. Just as he is about to launch the rocket his children tell him to stop. He drops the rocket, it goes off and hits a rock. The rock explodes sending smaller rocks towards them. Ace then saves all three of them from a certain death. They then return home to the badlands. At the end of all of this, Ace leaves. Before he leaves he gives Luffy a piece of paper and tells Luffy that next time they see each other it will be at the top of Pirates Summit.\n"
}