{
  "chapter_number": "Episode 295",
  "title": "5 Namis? Counterattack with the Mirage!",
  "short_summary": "As the battle between the Straw Hats and CP9 rages on, Nami seems to be at a disadvantage. However, with the distraction from Chopper in Monster Point, Nami finds a weakness of Kalifa's ability: water. After returning herself to normal, she then uses her Perfect Clima-tact to duplicate herself by five.\n",
  "long_summary": "Spandam continues to drag Robin along the way to the Gates of Justice who tries to talk him out of the Buster Call. He hopes that when he turns her over, Spandam will get a promotion. He also reminds her that Luffy is fighting Lucci and will likely lose.\nMeanwhile, Luffy and Lucci continue their duel in the storage room and the pirate tries to throw his enemy aside, however Lucci kicks Luffy away from the door that will lead him to Robin. He also stops a crate from hitting him and dodges Luffy's rapid punches. Lucci continues to dominate the fight.\nThe Marines and agents continue running for their lives while Chimney spots that the Enies Lobby tower is all crocked. She tells Kokoro of the secret route she and Luffy took.\nElsewhere, Kalifa prepares more bubbles and uses the Shave to take Nami by surprise. She continues to soften up Nami. With her body slippery, she can't even use the Clima-Tact. Kalifa thinks she made the Straw Hat navigator beautiful and attempts a Tempest Kick on her. But what hit was a fake. A mirage had been created by Nami. Kalifa frantically tries to hit Nami but keeps hitting decoys. Just then, Chopper bursts through in his Monster form.\nKaku and Jabra attempt to take down Usopp and Zoro before the Buster Call arrives. As they fight, Zoro knows the two CP9 agents are afraid of the Nose Sword. The Straw Hat swordsman decided a killer attack; Alure. Kaku and Jabra think Zoro is trying to bait them and charge. Zoro attacks but the two dodge.\nOn Kalifa and Nami's fight, Kalifa thinks Chopper is the latter, but Nami spots that the reindeer and hardly recognized him. The CP9 female agent tries to hit the doctor. Nami tries to talk sense into Chopper but he continues his rampage. A bath thrown by Chopper lands on Sanji hard and the monstrous reindeer continues his rampage. Kalifa then tries another Tempest Kick but even in her slippery state, Nami dodges. Suddenly, the slipperiness wears off because of the water from the bath. Nami attempts to get to the leaking water, but Kalifa stands in her way.\nKalifa continues to hold Nami at her mercy, but Nami deploys Cloudy Tempo and summons Rain Tempo, washing all the softness form Nami. She then cools down the area. Nami then deploys a number of illusions, a fat Nami, a burly Nami, a skinny Nami and a shot Nami. With this, Nami prepares her final blow.\n"
}