{
  "chapter_number": "Episode 52",
  "title": "Buggy's Revenge! The Man who Smiles at the Execution Platform!",
  "short_summary": "Zoro and Sanji show up too late to stop Buggy but a bolt of lightning shows up just in time to stop the execution and help Luffy avoid being killed.\n",
  "long_summary": "Luffy has climbed up onto the platform where Gol D. Roger was executed 22 years before. A guard calls for him to get down, since the World Government owns the platform. Alvida then hits the guard with her mace. The entire crowd, man and woman, swoons over her new look, but Luffy only remembers her previous appearance. She claims she likes how he hit her at their previous encounter, and would love to have a strong man like him. Other policemen move in, but are disarmed by Alvida's beauty.\nIn comes Buggy, who uses a Buggy Bomb to blow up the courtyard fountain. A piece of the fountain shoots right at Alvida, but slips right off her body, leaving her unharmed. Alvida tells Luffy she ate the Sube Sube no Mi Devil Fruit, which makes her body super-smooth and gave her a younger, more attractive appearance (which she downplays as if she always was). Then Buggy and his crew remove their capes, and Buggy talks about \"Buggy-Kun's Great Adventure\". The crowd runs in fear when they realize who it is, but Luffy unwittingly makes fun of his name. Cabaji slams a set of stocks down on Luffy, trapping him. Buggy declares his intention to publicly execute Luffy right there on the same platform where Gold Roger died.\nElsewhere, Nami notices bizarre weather patterns; a storm is forming unexpectedly. She tells Sanji and Usopp that they have to hurry back to the Going Merry. Zoro arrives and asks if they've seen Luffy, and has a premonition that something's about to happen. At another part of town, a Marine reports to Smoker and Tashigi that Luffy, Buggy and Alvida are all gathered in the town square. He orders one unit to sea to intercept any escape, and another to surround the square covertly for an ambush. When the other Straw Hats hear what Buggy has planned for Luffy, Zoro and Sanji run off to rescue him, leaving Nami and Usopp to take their supplies to the ship. When he surveys the scene at the square, Smoker thinks how pathetic Luffy looks. He decides to wait with his men and allow Buggy to take care of Luffy before swooping in. Luffy freaks out when he realizes he's about to die.\nNami tells Usopp this storm is going to be big. If the Marines stop Luffy and Buggy during the storm, they may not be able to escape. Marines are already preparing to raid the harbor of any pirate ships. But the Going Merry is more in imminent danger from Mohji and Richie, who guess which ship is Luffy's based on the jolly roger with the straw hat on it, intent on burning it to ensure Luffy can't escape if he manages to evade execution. Back at the square, Luffy drones for mercy as if bored. Given a chance for \"last words\" by Buggy, he declares that he will be the Pirate King. Those forced to stay and watch stand in shock. This buys time for Zoro and Sanji to arrive. As they fight through Buggy's and Alvida's men, however, Buggy swings the sword. Tashigi is shocked to find that Zoro is in league with a pirate. Sanji is too far away to kick the platform down. Smoker prepares to give the order to attack when Luffy's head falls. As the sword comes down, Luffy calls out to his crew.\nSmoker notes that Luffy has a huge grin on his face. But right before Buggy's sword touches Luffy's neck, a bolt of lightning strikes him and the execution platform. The platform catches fire and collapses, and Luffy's hat flutters down to the ground as rain begins to fall. There to pick it up...is Luffy, standing unharmed by Buggy, who has been electrocuted. He laughs at his luck. Sanji asks Zoro if he believes in God now.\nAs the shocked crowd just stares at him, Smoker gives the word to attack, and Luffy, Zoro and Sanji make a run for it. As they are pursued by Marines, Smoker thinks about Luffy smiling. He thinks Luffy couldnt've known Zoro and Sanji would save him. He immediately thought of Roger. Luffy acted exactly the same way Roger did at his execution. Unit 1 was grounded because the rain ruined their gunpowder, and the new wind with the present storm would be a tail wind for a ship going to the Grand Line. Smoker decides to take Luffy on personally.\nBut elsewhere on the island, a man in a green hood with a large facial tattoo walks through the streets, saying the \"storm of fate\" has arrived.\n"
}