{
  "chapter_number": "Episode 48",
  "title": "The Town of the Beginning and the End - Arrival at Loguetown",
  "short_summary": "The crew arrive in Loguetown to shop for goods, but Luffy is pursued by the Marine captain Smoker. Meanwhile, Zoro meets Smoker's assistant, Tashigi, who bears a striking resemblance to Kuina.\n",
  "long_summary": "Upon arriving at Loguetown, the crew separate to tour the town and shop for goods. However, the Marine captain stationed in Loguetown, Smoker, is informed of Luffy's activity in East Blue. Smoker leaves his post to search the town for Luffy, instead battling and defeating another pirate, Gally. Smoker then helps Luffy locate the historic execution platform, unaware he is the fugitive he is looking for.\nLuffy goes to the Gold Roger bar, whose owner personally met Roger when he arrived in Loguetown. After a brief conversation, Luffy departs, only for Smoker to enter immediately after. Smoker remembers witnessing Gol D. Roger's execution in his childhood. Just before Roger was killed, he announced that he left behind the One Piece, a legendary treasure for another pirate to find.\nLuffy finally locates the execution platform. Meanwhile, Smoker discovers that the boy he had helped was indeed his target. He runs to the execution platform to capture Luffy.\nMeanwhile, Zoro meets Smoker's right-hand, Tashigi, who defeats two men harassing her. Zoro helps Tashigi, but accidentally crushes her glasses when he discovers she bears a striking resemblance to his childhood friend, Kuina.\n",
  "characters": [
    "Monkey D. Luffy",
    "Sanji",
    "Roronoa Zoro",
    "Nami",
    "Usopp",
    "Hanger",
    "Ed",
    "Alvida",
    "Smoker",
    "Mashikaku",
    "Yu",
    "Gally",
    "Tashigi",
    "Koze and Packy",
    "Raoul",
    "Killer Giant (skull)",
    "Gol D. Roger (flashback)"
  ],
  "ssum_frequencies": [
    [
      "the",
      2
    ],
    [
      "to",
      2
    ],
    [
      "crew",
      1
    ],
    [
      "arrive",
      1
    ],
    [
      "in",
      1
    ],
    [
      "loguetown",
      1
    ],
    [
      "shop",
      1
    ],
    [
      "for",
      1
    ],
    [
      "goods",
      1
    ],
    [
      "but",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      11
    ],
    [
      "to",
      8
    ],
    [
      "he",
      8
    ],
    [
      "smoker",
      6
    ],
    [
      "luffy",
      6
    ],
    [
      "for",
      5
    ],
    [
      "in",
      4
    ],
    [
      "his",
      4
    ],
    [
      "execution",
      4
    ],
    [
      "loguetown",
      3
    ],
    [
      "is",
      3
    ],
    [
      "platform",
      3
    ],
    [
      "roger",
      3
    ],
    [
      "a",
      3
    ],
    [
      "town",
      2
    ],
    [
      "and",
      2
    ],
    [
      "another",
      2
    ],
    [
      "pirate",
      2
    ],
    [
      "helps",
      2
    ],
    [
      "when",
      2
    ]
  ]
}