{
  "chapter_number": "Episode 256",
  "title": "Rescue our Friends! The Oath that Links the Enemies",
  "short_summary": "The Rocketman finally makes it out to sea. As the train connects with the tracks, Luffy has to rescue Chimney before she's thrown off by the wind. In the meantime, Iceburg has a flashback about when he finally met Franky again in Water 7. With Luffy and Chimney safe in the train, Paulie tells his fellow carpenters who the real culprits were. The Straw Hat Pirates, Franky Family, and Galley-La Company form an alliance.\n",
  "long_summary": "Rocketman is seen going through an underground canal much to the surprise of the Straw Hats. Luffy ends up getting water in his nose much to the annoyance of Nami. Luffy feels as he is falling and Kokoro says they are almost at the exit. Suddenly, Rocketman comes charging out of Water 7 and into the sea. Zambai and the rest of the Franky Family follow behind with their King Bulls, Sodom and Gomorrah. Zambai thanks Luffy for allowing them to come and fires the connection cannons that link their ship with Rocketman. Zoro yells at them for almost hitting him. Luffy asks Kokoro if Rocketman can go any faster and Kokoro says it will once they reach the railway. Kokoro then spots the railway and attempts to get the Sea Train onto them but it keeps moving away much to her annoyance. Suddenly, Chimney and Gonbe are seen on the front much to the shock of Kokoro who thought they stayed with Iceburg. Kokoro asks Luffy to get them but soon, Rocketman gets on the railway and it's speed increases dramatically. Luffy, Chimney, and Gonbe are sent flying away but fortunately, they fly into one of the larger members of the Franky Family.\nThe two Sea Train employees are watching as Rocketman finally reaches the railway and speeds off. They comment on Kokoro's experience on handling the Sea Train. They think they should inform Iceburg on the current situation. Elsewhere, Iceburg can be seen looking worried. Iceburg remembers how Kokoro told him that Franky survived being run over by a Sea Train so he will be alright. Iceburg remembers awhile back on how Kokoro is seen drinking and is saddened thinking that Franky had died. Kokoro tells Iceburg that she know he can doing being the first apprentice of Tom. Iceburg then tells Kokoro that they will share a drink someday and says that he will watch over Tom's dreams. Years later, Iceburg is informed by Kalifa that someone named \"Cutty Flam\" is here to see him. Iceburg looks very shocked but tells Kalifa to turn him away. Later that night, Iceburg meets up with Franky in a different location. Iceburg is surprised to see Franky's new body but Franky tells him that the Sea Train mangled up his old body so he had to make himself another. However, Franky is angry that Iceburg is building ships for the World Government after what they did to Tom years ago. Iceburg angrily tells Franky about who made the weapons that caused the incident in the first place. Iceburg continues saying he has never forgiven Franky even after Tom forgave him. A little while later, Iceburg is seen giving the blueprints to Pluton to Franky and tells him not to call himself \"Cutty Flam\" anymore knowing the World Government will be targeting him. He then tells Franky to leave Water 7 but Franky is worried about the World Government going after Iceburg. Iceburg, who has broken in tears, says he is glad that Franky is alive. Franky then yells out to Iceburg saying he won't leave Water 7 and Iceburg yells back at him saying it's to protect the blueprints.\nBack in the present and on the Sea Train that is heading for Enies Lobby, Franky can be seen climbing onto the top of it.  Franky wonders why he is thinking about Iceburg but is worried about Lucci telling him he's dead. In Rocketman, Luffy, Chimney, and Gonbe are brought inside after nearly dying. Zoro comments on the few extra people they got referring to Paulie, Peepley Lulu, and Tilestone. Paulie decided to come along saying the enemy that they are going after are the same ones that tried to kill Iceburg. Tilestone and Lulu agree to follow behind Paulie wanting to avenge Iceburg. Zambai speaks up saying that the enemy is also the one that kidnapped Franky. Lulu and Tilestone then tell Paulie to tell them who are the culprits on Iceburg's attempted assassination saying they won't be shocked on who they are. Paulie says that the culprits are Lucci, Kaku, Kalifa, and Blueno but, to his anger, Tilestone and Lulu are greatly surprised at this thinking the culprits were someone else. Luffy suddenly speaks up saying that even though they got into a fight with Galley-La Company and the Franky Family earlier, they all share a common enemy. Luffy says that the strongest of the group and Lucci and that he is going to be the one that fights him. Zoro says that it's a battle against those four. Nami notices the giant waves of Aqua Laguna coming but Luffy ignores this and offers to form an alliance. Paulie and Zambai agree to an alliance and Luffy says that for now, they fight as one and together, they will achieve their goal. Everyone cheers as Rocketman approaches a large wave.\n"
}