{
  "chapter_number": "Episode 111",
  "title": "The Miracle Sprint! Arabasta the Animal Land",
  "short_summary": "Luffy is left for dead by Crocodile, but is helped by the mysterious Miss All Sunday who asks him why do the \"Ds\" keep fighting?'. The rest of the Straw Hat Pirates reach Alubarna.\n",
  "long_summary": "Water has reached Yuba and Toto is relieved. Another sandstorm is caused by Crocodile. Meanwhile, Crocodile pierces Luffy in his stomach and tells him he failed. Luffy is bleeding some water caused by the one he drank earlier to rehydrate his arm. Luffy grabs his arm heavily and Crocodile is surprised he is still alive.\nHe throws Luffy into the quicksand and heads to Alubarna. The rest of The Straw Hats are riding on Hasami. Usopp is telling Chopper one of his stories and Zoro is working out by using Matsuge as a dumbbell. Zoro and Sanji argue with each other because Sanji thinks Zoro is scared. Nami hits them and says it's not the time to fool around. Vivi believes in Luffy and says he will meet them in Alubarna. She was the one who was worried the most. Nami bonks her on the head and say she worries about the rebellion.\nSmoker orders Tashigi to go to Alubarna. She has to decide whether to pursue the Straw Hats or support the royal army while Smoker goes out to sea. Smoker says he will accept responsibility for whatever choice she makes. Nami and the others have to cross a wide river if they want to make it to Alubarna. Hasami cannot cross the ocean, so they decide to make him speed up enough to run on the water. Nami motivates Hasami by using her dancing outfit to make him run across the ocean since Hasami likes dancer girls.\nThey reach 3/4 across the ocean when Hasami sinks down into the sea. They swim back up and they are attacked by a Sea Monster, who is quickly defeated by the Kung-Fu Dugongs.  The Kung-Fu Dugongs reply that they would never disobey their master's will (Luffy). They reach shore and see something coming after them in the distance. It is revealed to be Karoo and the Super Spot-Billed Duck Troops.\nLuffy is stuck in the middle of the quicksand and tries to struggle out, but is being covered in the sand. Nico Robin saves him by using her Hana Hana no Mi powers and asks him about the \"Will of the D\", also having retrieved Luffy's hat.\nPell arrives, still injured and asks Nico Robin what she did to Vivi. She replies that Luffy saved her and that she is safe, telling Pell to aid Luffy. While she leaves, Luffy grabs onto Pell while yelling for meat. Back in Alubarna the Royal Guards are preparing for battle. The King is shown to have been kidnapped by Mr. 4 and Miss Merry Christmas, as he expresses not wanting Chaka and Koza to fight. Igaram is shown to be still alive.\n"
}