{
  "chapter_number": "Episode 76",
  "title": "Critical Counterattack! Usopp's Quick Wit and Kaenboshi!",
  "short_summary": "Usopp frees Luffy from Miss Goldenweek's control. With Karoo's help and his plan, Usopp helps Luffy rescue the others, who take on Mr. 5 and Miss Valentine. Nami and Vivi are able to fight Miss Valentine, while Usopp and Zoro take on Mr. 5. Luffy and Karoo pursue Mr. 3 and Miss Goldenweek into the forest, where Mr. 3 attempts to trap them with one of his tricks. Meanwhile, Sanji wanders around the island in search of the others, only to stumble across a Candle House in the middle of nowhere.\n",
  "long_summary": "Once back at the pedestal, Usopp finds Luffy drinking tea with Miss Goldenweek, while their friends are already completely covered in wax and their time is running out. He burns Luffy's shirt, upon which Miss Goldenweek had painted, using a flaming projectile. Luffy, again himself, attempts to destroy the pedestal but is interrupted by the returning Mr. 3, who creates himself a Candle Champion. Usopp is finally struck down by Mr. 5's explosive shots, but is still able to make Karoo run around the pedestal dragging behind it a rope, which Usopp soaks in flammable oil just as Miss Valentine begins to crush him with the intent doing it fatally. Luffy then grabs Mr. 3 at his burning, three-shaped hairdo and uses it to inflame the rope, burning the large wax structure and freeing the others. As they emerge from the flames, Miss Valentine's wicked smile turns to horror when she sees Nami and Vivi freed and is defeated and Zoro makes quick work of Mr. 5. Luffy and Karoo chase after Mr. 3 and his partner and defeat them, respectively. Meanwhile, Sanji stumbles upon a Candle House, which is Mr. 3's hideout. Suddenly, in the house, Sanji receives a call via a Den Den Mushi from Mr. 0.\n",
  "characters": [
    "Usopp",
    "Mr. 5",
    "Karoo",
    "Monkey D. Luffy",
    "Miss Goldenweek",
    "Miss Valentine",
    "Sanji",
    "Nami",
    "Roronoa Zoro",
    "Nefertari Vivi",
    "Brogy",
    "Mr. 3",
    "Dorry",
    "Mr. 0/Crocodile (unclearly seen)"
  ],
  "ssum_frequencies": [
    [
      "and",
      6
    ],
    [
      "the",
      5
    ],
    [
      "miss",
      4
    ],
    [
      "mr",
      4
    ],
    [
      "usopp",
      3
    ],
    [
      "luffy",
      3
    ],
    [
      "to",
      3
    ],
    [
      "of",
      3
    ],
    [
      "with",
      2
    ],
    [
      "his",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      10
    ],
    [
      "and",
      9
    ],
    [
      "mr",
      7
    ],
    [
      "is",
      6
    ],
    [
      "a",
      6
    ],
    [
      "to",
      5
    ],
    [
      "luffy",
      4
    ],
    [
      "miss",
      4
    ],
    [
      "pedestal",
      3
    ],
    [
      "usopp",
      3
    ],
    [
      "in",
      3
    ],
    [
      "which",
      3
    ],
    [
      "3",
      3
    ],
    [
      "it",
      3
    ],
    [
      "at",
      2
    ],
    [
      "with",
      2
    ],
    [
      "goldenweek",
      2
    ],
    [
      "their",
      2
    ],
    [
      "wax",
      2
    ],
    [
      "upon",
      2
    ]
  ]
}