{
  "chapter_number": "Episode 36",
  "title": "Survive! The Mother Bell-mère and Nami's Family!",
  "short_summary": "Arlong killed Bell-mère and accepted Nami into his pirate crew, promising to sell the village back to her in exchange for 100,000,000 bellies. In the present day, Nami almost acquires bellies to buy back her town, but Nezumi comes to seize her property.\n",
  "long_summary": "The Arlong Pirates confronted Bell-mère at her house for her monthly tribute. Bell-mère was unable to defend herself against Arlong, and also could not pay for both herself and her children, only possessing 100,000 bellies. Townspeople attempted to hide Nojiko and Nami as her daughters so Bell-mère would be able to pay for herself. However, Bell-mère refused, refusing to deny the existence of her family, and paid the tribute for her daughters, not for herself. After bidding farewell to Nojiko and Nami, she was shot dead by Arlong.\nImpressed with the map drawn by Nami, Arlong accepted her into the crew, where she was given plenty of money. Nami intended to raise one hundred million bellies so she could buy her village back from Arlong. Nami would become a pirate thief under Arlong, stealing from pirates and burying her savings underground.\nHowever, in the present day, Nami is confronted by Nezumi. As her treasures were stolen goods, Nezumi seized her treasures, confiscating it as government property.\n",
  "characters": [
    "Nojiko",
    "Nami",
    "Bell-mère (flashback)",
    "Genzo",
    "Arlong",
    "Kuroobi",
    "Chew",
    "Hatchan",
    "Nako",
    "Pisaro",
    "Yosaku",
    "Johnny",
    "Nojiko",
    "Usopp",
    "Sanji",
    "Monkey D. Luffy",
    "Nezumi"
  ],
  "ssum_frequencies": [
    [
      "to",
      4
    ],
    [
      "her",
      3
    ],
    [
      "nami",
      2
    ],
    [
      "the",
      2
    ],
    [
      "back",
      2
    ],
    [
      "in",
      2
    ],
    [
      "bellies",
      2
    ],
    [
      "arlong",
      1
    ],
    [
      "killed",
      1
    ],
    [
      "bellmère",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "her",
      11
    ],
    [
      "the",
      6
    ],
    [
      "arlong",
      6
    ],
    [
      "to",
      6
    ],
    [
      "and",
      6
    ],
    [
      "nami",
      6
    ],
    [
      "for",
      5
    ],
    [
      "bellmère",
      4
    ],
    [
      "herself",
      4
    ],
    [
      "was",
      3
    ],
    [
      "as",
      3
    ],
    [
      "she",
      3
    ],
    [
      "by",
      3
    ],
    [
      "pirates",
      2
    ],
    [
      "confronted",
      2
    ],
    [
      "tribute",
      2
    ],
    [
      "could",
      2
    ],
    [
      "not",
      2
    ],
    [
      "pay",
      2
    ],
    [
      "bellies",
      2
    ]
  ]
}