{
  "chapter_number": "Episode 63",
  "title": "A Man's Promise! Luffy and the Whale Vow to Meet Again",
  "short_summary": "After hearing the story of Laboon the whale, Luffy comes up with a clever solution to his problems. From Laboon's caretaker, Crocus, the crew learns more about the Grand Line and how to navigate through it via Log Pose, since compasses are useless there. The crew finally decide to travel to Whisky Peak.\n",
  "long_summary": "Crocus begins to tell the story of Laboon to the Straw Hat Pirates. He explains that Laboon has been waiting for a group of pirates for over fifty years. Fifty years ago, Laboon came along with a group of pirates known as the Rumbar Pirates. The pirates did not wish to bring the young whale in their dangerous journey and wanted to leave it in West Blue, where it originally inhabited but it had followed the pirates on their journey. To Laboon, the pirates were like its own family. The Rumbar Pirates stayed in the Reverse Mountain for a few months to repair their ship, during which Crocus became friends with them. Once they were ready to leave on their journey, they asked Crocus to look after Laboon and left him in the care of Crocus promising to return back after three years. The captain of the ship asked Laboon to wait for them, and promised him that no matter what happens in their journey, they would come for him and he is still their friend.\nThe scene shifts back to Straw Hat Pirates. They finally understand why Laboon has been bellowing and ramming his head against the wall. Crocus reveals that he is a doctor and has been treating Laboon's wound from the inside. Luffy immediately asks him to become the doctor of his crew to which Crocus declines reasoning that he is no longer as young as he used to be. Crocus finally let them out of Laboon through a tunnel and the Straw Hat Pirates briefly discuss on the possibility of the Rumbar Pirates death. Usopp declines on the possibility of their death and believes that they are indeed alive and will come back for Laboon. Crocus however says that the pirates possibly ran away from Grand Line and will not be returning back for Laboon. The Straw Hat Pirates further discuss that the pirates running away and not fulfilling their promise of coming back for Laboon, and question Crocus why he did not tell Laboon about the pirates' betrayal, as he is perfectly capable of understanding human speech. Crocus tells them that he indeed tried but the whale refused to listen to him. Sanji tells him that since Crocus himself got betrayed, Laboon should not be his problem anymore but Crocus tells him that he is not going to let the whale die as he has forged a certain relationship with it.\nSuddenly, Luffy breaks the mast off Going Merry and strikes the whale with it. Laboon retaliates and begins fighting with Luffy. Luffy stops the whale and declares that it is a draw between them. Luffy labels Laboon as his rival and promises to have a rematch with him after they had completed their journey. He then asks Laboon to wait for him and not to heal himself as they will be fighting soon. Luffy then paints a Jolly Roger on Laboon's face.\nMiss Wednesday and Mr. 9 escape from the Straw Hat Pirates' ship but they drop their Log Pose, which Luffy picks up. They decide to return back to their boss as the time limit to their mission was over. Suddenly, Mr. 13 and Miss Friday, the Unluckies fly over them and drop a bomb on them.\nNami discovers that the usual compass and common sense does not work on Grand Line because of the magnetic fields of various minerals found on Grand Line. Crocus says that they need to have a Log Pose in order to advance on their adventure. Luffy reveals that he found a Log Pose on the ship. Crocus then tells them that Log Pose readapts to the magnetic field of the various islands and will point them in the right direction, which when followed eventually leads to Laugh Tale. Usopp questions if the One Piece is there, to which Crocus replies that only one man and his crew has ever reached there, the Pirate King Gol D. Roger and mentions that One Piece is a myth and no one really knows if it exists or not. Luffy reveals that they will know for sure when they reach there, so it does not really matter. While they are conversing, Luffy eats all the food and Sanji kicks him for not saving any for others. The Log Pose suddenly breaks and Nami kicks both. Crocus says that he would give his Log Pose for saving Laboon. Later, Laboon brings out Sanji, Luffy, Mr.9 and Miss Wednesday out of the sea. Mr.9 and Miss Wednesday requests to go on a journey with the Straw Hat Crew to Whisky Peak, their homeland. Crocus tells the crew to leave them be for trying to hurt Laboon but Luffy agrees to take them to their hometown. The crew then continue on their journey to Whisky Peak and the episode ends with Crocus saying goodbye to the Straw Hat Crew and remembering Gol D. Roger.\n"
}