{
  "chapter_number": "Episode 100",
  "title": "Rebel Warrior Koza! The Dream Sworn to Vivi!",
  "short_summary": "The Straw Hats, Vivi and Ace are still traveling through the desert. Vivi tells Nami about her childhood, her childhood affiliation and reveals the identity of the rebel leader.\n",
  "long_summary": "The Straw Hats, Vivi and Ace are still traveling together on their way to the Yuba Oasis.  Vivi intends to meet with the rebel army there. Luffy and Usopp, thirsty and tired, began struggling with each to get a drink of water from the skin bottle. Sanji decides to save his for Nami and Vivi, but Luffy tries to take his water bottle away from him. At that point, Luffy, Usopp and Sanji begin fighting over the water in the skin bottle. Nami asks Vivi to tell her more about the Rebel army and Vivi went to tell her of the events that occurred 11 years back.\nA young Koza is seen before King Cobra complaining that his village is dried up and the king is doing nothing to help. The King in turn, told him that the weather is commanded by God and that he has no power over nature. Just then Toto arrived beseeching the king that he would accept the punishment for his rude son. Cobra promised to look after the village affected by the drought and told Toto to remain in Alubarna. Koza, still upset at the king, said the king does not understand the feelings of the people and fled his sight. Cobra then told Toto that Koza is a good child because he cares for the people and their feelings. Vivi, standing by the hallway saw Koza running down crying and called him a crybaby. Igaram is seen telling Cobra that the country's budget will not suffice to help the whole village affected by the draught and Cobra, comically hitting him on the head, told him to take money out of their personal wallets.\nJust then, Vivi appeared before her father and told him she got into a fight but lost. Igaram was angry that Koza hit the princess and Toto was pleading to the king for him to commit suicide as a way of apology. Cobra told them to stay out of it for it is simply a children's quarrel. In the village, Vivi challenged Koza for the position of leader of the Suna Suna Clan. After their fight, Koza announced Vivi as the new assistant leader of the Suna-Suna Clan. Igaram and Cobra were watching in hiding and Cobra commented that Vivi has made friends, which is important for the next ruler to have. Vivi, after joining the clan became close to Koza's family. Vivi was about to be kidnapped when the Suna Suna Clan launched an offensive against the kidnappers to protect Vivi. Meanwhile, in the desert, a scorpion came out from the ground and was about to attack Luffy, making Zoro, Sanji, Chopper and Luffy all together beat the scorpion.\nThe Suna Suna Clan continued to fight the kidnappers, when a third one appeared grabbing Vivi. Vivi bit him and ran towards the ruins. Igaram and Cobra appeared after the children have been defeated and inquired on what had happened. They were told, and they went after Vivi. At the ruins, the kidnappers were looking for Vivi and one found her. Koza came from behind and hit him with a club. The kidnapper and Koza went at each other but Koza defeated him by hitting him in the head but got cut by the kidnapper's sword near his left eye. Just then the other two arrived and when they were about to fight Koza, when Igaram and Cobra knocked them out. Pell and Chaka also defeated the rest of the kidnapping ring crew.\nVivi, upon Koza's recovery cried and told him not to give his life to save hers, after remembering their resolve to protect her. Cobra thanked Koza for his noble deed, although Koza said he did it for a friend. Cobra asked if Koza loved the country and he replied \"yes\" saying it is the country of his birth and Cobra commented that he also loves the country. Koza told Vivi about Toto accepting the position of a representative to build the Oasis of Yuba into a town, since it is the hub of Western Arabasta. Koza told her he was leaving with his father and would help build Yuba with his own two hands. Koza, upon leaving told Vivi to become a great princess.\nIn the present, Nami comments that Vivi's friend - Koza - seems like a good person and asked what that had to do with the Rebels. Vivi then revealed to Nami that Koza was the leader of the Rebel army.\n",
  "characters": [
    "Matsuge",
    "Nefertari Vivi",
    "Nami",
    "Monkey D. Luffy",
    "Usopp",
    "Sanji",
    "Portgas D. Ace",
    "Roronoa Zoro",
    "Tony Tony Chopper",
    "Nefertari Cobra (flashback)",
    "Koza (flashback)",
    "Toto (flashback)",
    "Karoo (flashback)",
    "Igaram (flashback)",
    "Aswa (flashback)",
    "Agotogi (flashback)",
    "Okame (flashback)",
    "Kebi (flashback)",
    "Natto (flashback)",
    "Chaka (flashback)",
    "Pell (flashback)"
  ],
  "ssum_frequencies": [
    [
      "the",
      4
    ],
    [
      "vivi",
      2
    ],
    [
      "and",
      2
    ],
    [
      "her",
      2
    ],
    [
      "childhood",
      2
    ],
    [
      "straw",
      1
    ],
    [
      "hats",
      1
    ],
    [
      "ace",
      1
    ],
    [
      "are",
      1
    ],
    [
      "still",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      61
    ],
    [
      "and",
      34
    ],
    [
      "to",
      29
    ],
    [
      "vivi",
      21
    ],
    [
      "koza",
      19
    ],
    [
      "a",
      15
    ],
    [
      "of",
      15
    ],
    [
      "that",
      14
    ],
    [
      "cobra",
      13
    ],
    [
      "him",
      12
    ],
    [
      "his",
      11
    ],
    [
      "told",
      11
    ],
    [
      "for",
      10
    ],
    [
      "is",
      10
    ],
    [
      "in",
      8
    ],
    [
      "king",
      7
    ],
    [
      "he",
      7
    ],
    [
      "with",
      6
    ],
    [
      "her",
      6
    ],
    [
      "by",
      6
    ]
  ]
}