{
  "chapter_number": "Episode 34",
  "title": "Reunited! Usopp Tells Nami's True Story",
  "short_summary": "Arlong's officers decimate a Marine ship, led by Pudding Pudding, that came to rescue survivors of Gosa Village. Usopp reveals to the crew he is indeed alive, having been saved by Nami. Nojiko then explains to them Nami's past.\n",
  "long_summary": "Nami confronts the crew at the paddy field, clarifying her allegiance to the Arlong Pirates and asking them to leave the island before they are captured. However, determined to take Nami as his Navigator, Luffy vehemently refuses to leave the island, lying on the road to sleep. No longer wanting to face danger on the island, Johnny and Yosaku decide to part ways with the crew, bidding farewell to Zoro.\nUsopp, revealed to be alive, reunites with the crew, revealing that Nami stabbed the back of her own hand, leaving him unharmed and allowing him to escape alive.\nMeanwhile, the Marine 77th Branch, led by Commodore Pudding Pudding, near the island to rescue survivors from Gosa Village and capture Arlong. Arlong decides to send only three of his officers to repel the attack. While Chew intimidates the Marine forces onboard, Kuroobi tears off the ship's rudder and Hatchan creates an artificial maelstrom, sinking the ship and presumably killing all invading forces. Then, Arlong, to prevent Nami from purchasing Cocoyasi Village, summons Marine 16th Branch, led by Captain Nezumi, to her house.\nNojiko meets with Nami at her house, where Nami reveals she built truly positive experiences with the crew while they were together. Nojiko then goes to the crew, explaining to them Nami's past. Nami and Nojiko were raised in Cocoyasi Village by a woman named Bell-mère.\n",
  "characters": [
    "Johnny",
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Sanji",
    "Yosaku",
    "Nojiko",
    "Chabo",
    "Arlong",
    "Chew",
    "Hatchan",
    "Kuroobi",
    "Take",
    "Shioyaki",
    "Pudding Pudding",
    "Usopp",
    "Kuro (flashback)",
    "Buchi (flashback)",
    "Sham (flashback)",
    "Nezumi",
    "Genzo",
    "Nako",
    "Bell-mère (flashback)"
  ],
  "ssum_frequencies": [
    [
      "to",
      3
    ],
    [
      "by",
      2
    ],
    [
      "pudding",
      2
    ],
    [
      "arlongs",
      1
    ],
    [
      "officers",
      1
    ],
    [
      "decimate",
      1
    ],
    [
      "a",
      1
    ],
    [
      "marine",
      1
    ],
    [
      "ship",
      1
    ],
    [
      "led",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      18
    ],
    [
      "to",
      17
    ],
    [
      "nami",
      7
    ],
    [
      "and",
      7
    ],
    [
      "crew",
      5
    ],
    [
      "her",
      4
    ],
    [
      "arlong",
      4
    ],
    [
      "island",
      4
    ],
    [
      "with",
      4
    ],
    [
      "marine",
      3
    ],
    [
      "by",
      3
    ],
    [
      "village",
      3
    ],
    [
      "nojiko",
      3
    ],
    [
      "at",
      2
    ],
    [
      "them",
      2
    ],
    [
      "leave",
      2
    ],
    [
      "they",
      2
    ],
    [
      "his",
      2
    ],
    [
      "on",
      2
    ],
    [
      "alive",
      2
    ]
  ]
}