{
  "chapter_number": "Episode 123",
  "title": "Smells Like Croc! Run to the Tomb of the Royal Family, Luffy!",
  "short_summary": "Crocodile joins Nico Robin in the tomb, and orders her to translate the Poneglyph. Robin tells him that Pluton was not mentioned and that it was only about history. However, Crocodile accuses her of lying and stabs her in response. When Luffy recovers from the last round of fighting, he chases after Crocodile into the tomb.\n",
  "long_summary": "Luffy's body water got dried out by Crocodile leaving Luffy close to death. However, the water he had shot out at Crocodile came falling and landed on him which brought him back to life. After Luffy recovered, he went searching for Crocodile. Nico Robin and King Cobra, on the way to the royal tomb, encountered the Marines and were ordered to surrender, however she overcame them easily. Sometime afterwards, Crocodile came by and laughed at them for being easily overcome.\nMeanwhile, the remainder of the Straw Hat crew, Vivi and Pell are still in search of the hidden cannon and time is counting down fast. Luffy, on the pursuit of Crocodile, came by Tashigi and requested which route Crocodile took. After some contemplation, she showed Luffy the way Crocodile went and scolded herself after he took off. Upon nearing the tomb, Luffy began to bleed and fell to the ground sleeping. Meanwhile, with the help of Cobra, Nico Robin found the Poneglyph and started reading it. Crocodile at this point had reached the location of the Poneglyph as well. The Straw Hats are still in search of the bomb.\nUpon encountering the Poneglyph, Nico Robin read and inquired from Cobra if there were any more Poneglyphs in the country and Cobra asked if she was disappointed by the one they found. Crocodile finds them and tells Nico Robin to read what is written on the Poneglyph. She began reading however, she was simply reading the history of Arabasta to him. On hearing that, Crocodile got very upset and asked if the Poneglyph revealed the location of the ancient weapon – Pluton. Nico Robin answered him saying nothing of the name Pluton is mentioned in this Poneglyph. Crocodile then told her that she has been useful for the four years they had been together operating Baroque Works. However, she would have to die since she broke her promise of not giving him the location of Pluton after reading the Poneglyph. Nico Robin tried to kill him but failed. At that point, Cobra had initiated a timer that would destroy the underground tomb stating that both Crocodile and Nico Robin would die along with him because he would never let Crocodile have the \"Country of Sand.\"\nDuring the search of the bomb Vivi ends up with a skinned knee when one of her platform sandal straps disintegrates from all the abusive running that has worn it apart and sends her tumbling onto the hard, stony road. Losing her other sandal in the fall, she is forced to abandon the ruined pair and continue running barefoot, making her search all the more painful as her unprotected feet get beaten up while she dashes through the rough streets of Alubarna. She got a revelation of the possible location of the bomb and had Usopp summon the remainder of the Straw Hats when they crossed the streets. Luffy is finally awake from his nap and went running searching for Crocodile. Crocodile informs Cobra that his plan to bury all three of them together is futile because he is able to turn the bedrock of the tomb to sand and make his escape.\n",
  "characters": [
    "Monkey D. Luffy",
    "Crocodile",
    "Nico Robin",
    "Nefertari Cobra",
    "Tashigi",
    "Usopp",
    "Roronoa Zoro",
    "Tony Tony Chopper",
    "Nami",
    "Sanji",
    "Nefertari Vivi",
    "Pell",
    "Kebi (flashback)"
  ],
  "ssum_frequencies": [
    [
      "the",
      4
    ],
    [
      "crocodile",
      3
    ],
    [
      "and",
      3
    ],
    [
      "her",
      3
    ],
    [
      "robin",
      2
    ],
    [
      "in",
      2
    ],
    [
      "tomb",
      2
    ],
    [
      "that",
      2
    ],
    [
      "was",
      2
    ],
    [
      "of",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      46
    ],
    [
      "and",
      20
    ],
    [
      "of",
      20
    ],
    [
      "crocodile",
      15
    ],
    [
      "to",
      14
    ],
    [
      "she",
      11
    ],
    [
      "him",
      7
    ],
    [
      "nico",
      7
    ],
    [
      "robin",
      7
    ],
    [
      "is",
      7
    ],
    [
      "poneglyph",
      7
    ],
    [
      "that",
      7
    ],
    [
      "her",
      7
    ],
    [
      "luffy",
      6
    ],
    [
      "cobra",
      6
    ],
    [
      "he",
      5
    ],
    [
      "had",
      5
    ],
    [
      "on",
      5
    ],
    [
      "in",
      5
    ],
    [
      "by",
      4
    ]
  ]
}