{
  "chapter_number": "Episode 188",
  "title": "Released from Disgrace! The Tears of the Great Warrior!!",
  "short_summary": "In the flashback: Mont Blanc Noland and Kalgara are enjoying themselves, as well as the villagers and Noland's crew, but that changes one day, as the villagers start hating their new friends.\n",
  "long_summary": "This episode is the continuation of the flashback from 400 years ago.\nThe villagers are still enraged by the earthquake that they think was punishment for Noland killing Kashigami. They gather around the cage in which Noland's crew is held prisoner and prepare to execute them to appease the Gods. However, Seto sits down in front of the cage to block the way - to the villagers' dismay - and tells them they should be ashamed of themselves.\nIn the forest, Noland is still stuck in the crevice as Kalgara gloats and tells him this is the punishment of the Gods and his crew will be dead by the end of the evening. Noland struggles to get out and Kalgara is impressed by his efforts.\nThe sun is setting and the crew as well as Mousse are being led to the Sacrificial Altar. Kalgara is still gloating at Noland but Noland is defiant and confronts Kalgara about the moral disgrace that are human sacrifices. Kalgara beats Noland up while defending his people's traditions. The villagers are getting ready to burn the crew and Mousse.\nNoland continues to guilt Kalgara about their rituals and Kalgara reveals that he believes so strongly in them that Mousse is actually his daughter and he was ready to let her die because of his faith in the Priest's words. Both men hear a noise in the forest and it is another large python - although smaller than Kashigami. Kalgara speculates it must be Kashigami's son that came to avenge his father. Noland explains to Kalgara that the Tree Fever struck his own village 60 years ago and that they did discover a cure called conine that he can extract from the bark of the Kona Tree  that he had gone to get in the forest and still holds in his hand. Kalgara is obviously troubled and Noland shames him about stepping in the way of progress and letting his village die of the disease. The python suddenly attacks Noland but Kalgara strikes and kills it. Kalgara is anguished about what he has done (since he believes the python is a aod) but tearfully asks Noland whether he can really save his village.\nNoland's crew administer the cure, to the delight of the villagers Kalgara is also tearingly reunited with his daughter. Noland recovers from his injuries as well and everybody is happy and getting along. Later Kalgara and Noland's crew are walking in the forest and encounter a mini-version of the earlier python - Kashigami's grandson. Kalgara and Noland are getting along great to the crew's astonishment. They comment on how happy Noland looks.\nKalgara leads Noland and his crew to a spot and the bell starts ringing. They go down some stairs and they are in Shandora. Noland and everyone are amazed. The city is all covered in gold and the rest of the villagers is there as well ringing the bell. Kalgara tells the crew about Shandora. \nNoland's crew rushes to get some treasure and Noland tries to stop them. But Kalgara says it is fine, and except for the belfry they can take what they want as a thank you for saving the village. They never cared about the Gold. What they were protecting was a special stone on which a Poneglyph is written. Kalgara says no one knows how to read it but their ancestors fought to protect it and they want to honor their ancestors by protecting this stone that symbolizes their victory. Kalgara also explains that the Shandorian Golden Belfry Bell allows the souls of their ancestors to come back to their Land safely and to tell them the villagers are still here protecting Shandora. That's why they call it the Fire of Shandora. Noland comments on hearing the ringing of the bell in the storm. Both men comment on the snake growing up to be as big as his forebears. Kalgara invites Noland to stay as long as they want and Noland thanks him saying he wants to finish ridding the village of the Tree Fever and to collect some plant samples as well. Some members of the crew tell Noland there was an Eternal Pose and a map in the treasure. The map shows the island and Kalgara mentions that Shandora means \"Right eye of the Skull\" as the island is shaped like a skull. Later, Noland shows the curious villagers a pumpkin the crew had grown in the greenhouse on their ship and gives them some seeds to grow it themselves.\nThe villagers, upset and angry about something the crew has done, refuse to talk to the crew. They are \"Killers of Gods\" regardless of whether they saved the villagers or not. The Chief tells them not to confront them since they are leaving soon anyway. Noland and his crew happily arrive at the village but everyone shuns them and goes home. Seto tells Noland that Kalgara does not want to see him and reminds them they should leave soon. Noland's crew is puzzled. Kalgara is seen sulking in Shandora and tells a villager he will kill Noland if he sees him.\nLater on the beach the crew notices the bell hasn't been rung today for the first time since they have been on the island. Noland tells the crew they have two more days of work to do on the island and then they will leave. He reminisces about Kalgara offering him Muse's hand in marriage (that he turned down on account of his own family back home) and then Seto's hostile word and runs to Shandora to confront Kalgara. He wants to know what they have done but Kalgara launches a spear at Noland grazing his cheek and asks him if he came here to die and to leave. Noland is stunned.\n"
}