{
  "chapter_number": "Episode 26",
  "title": "Zeff and Sanji's Ambition: The Sea of Dreams - All Blue",
  "short_summary": "Sanji's past was revealed, as Zeff saved Sanji's life and sacrificed his leg so he could pursue his dreams of locating the All Blue. In the present day, Luffy destroys the Baratie's port-side fin.\n",
  "long_summary": "Gin holds Zeff at gunpoint, threatening to shoot. Pearl recovers from Sanji's attacks and prepares a counterattack, stating that Gin would shoot if Sanji were to dodge his attacks. With this, Sanji has no choice but to take his attacks, as he is struck in the head by his shields. While he is down, Sanji reflects on his childhood with Zeff.\nAs a child, Sanji was working as a cook aboard a cruise ship, which was then attacked by Zeff's crew, the Cook Pirates. The Cook Pirates plundered the ship and beat Sanji, where Sanji states his dream of locating the legendary All Blue. However, the ships were suddenly caught in a storm, and a particularly strong wave swept Sanji overboard. Zeff chose to risk his life, diving into the sea to save Sanji from drowning. Another strong wave then sunk both ships, presumably killing all people onboard.\nZeff attempted to save Sanji, but his leg became caught by the ships' wreckage. Zeff had to cut of his own leg with a chain to set himself free. He then rescued Sanji and carried him to a deserted, rocky island. On the island, they divided their rations amongst themselves and went to opposite ends of the island to spot incoming ships.\nAlthough Sanji rationed his share of the food to last twenty days, it eventually ran out and he was left starving for several more days. He confronted Zeff, who held a comparatively larger share, and cut open his bag. He finds, to his horror, that Zeff's \"share\" was treasure, and he had given Sanji all of the food. Sanji then discovers that he had also severed his right leg to save his life. Zeff explains his reasoning, stating that he also shared Sanji's dream of locating the All Blue, so he sacrificed his leg so Sanji could pursue the dream. Sanji and Zeff were eventually rescued by a ship, and they would found the Baratie restaurant together.\nIn the present day, Sanji stands up to Pearl, prepared to fight for the Baratie. Enraged by the Krieg Pirates' actions, Luffy uses Gomu Gomu no Ono, destroying the entire port-side fin.\n"
}