{
  "chapter_number": "Episode 57",
  "title": "Lone Island in a Distant Sea! The Legendary Lost Island",
  "short_summary": "Even for Nami, finding the dragon's lost island proves to be a challenge for the Straw Hat crew. After arriving at Lost Island, the Straw Hat Pirates find an old temple with paintings that might indicate where the Lost Island really is. Also, Eric has been following them throughout the sea.\n",
  "long_summary": "After the Straw Hats’ escape, the Marines prepare to go after them. Eric is not too worried as he feels that they will lead him to the millennial dragons. As a marine tries to report updates to Commodore Nelson, Eric stops him as he wants to keep all the dragonite for himself. Nelson, nonetheless, receives updates and is angered that Eric is keeping a millennial dragon from him. Nelson then orders to deploy a fleet towards Warship Island.\nMeanwhile, the Straw Hats tow Ryu in search of Lost Island. Luffy checks on him, but the dragon has fallen asleep. While Apis is serving lunch, the hot meal spills on Ryu’s head. This wakes him and jogs his memory. He remembers where the Lost Island is, which is east of Warship Island. The Straw Hats head there right away.\nLuffy sees “smoke” in the distance. The Going Merry draws nearer to what seems to be their ship’s reflection. Luffy investigates and is “sucked” into his own reflection. The Marines who were after them, see the Merry disappear into thin air. Eric prepares to go after them.\nThe Going Merry is now surrounded by fog so thick that it is hard to see. Usopp comments that what they saw was a mirage which Nami confirms. The weather changes and they are caught in a storm. The strong waves cause the ropes towing Ryu to break. Zoro quickly catches the ropes and Luffy pulls Ryu to safety. Usopp spots an island at the eye of the storm and Nami decides that they should head towards it.\nThey reach the island and Nami remarks that an island hidden by a mirage and surrounded by stormy seas must have been why no one has never found it. They haul Ryu to the island, but the dragon is still unsure if this is even the Lost Island. They decide to head to the top of the mountain so they can find his nest. They reach a building with a dragon emblem and look for a door to enter. Apis sees a hole on the wall with the same shape as her pendant. They believe that it might be the key to opening the building. Before they could open the door, the ground below them collapses and they all fall into what seems to be a temple. They look up the ceiling and see various ancient paintings which could show clues as to where the real Lost Island is.\nNami explains the science behind mirages. Such knowledge will prove useful to her when she receives her Clima-Tact.\n"
}