{
  "chapter_number": "Episode 178",
  "title": "Gushing Blade Attack! Zoro vs Priest Ohm!!",
  "short_summary": "Zoro finally defeats Ohm with his 108 Pound Cannon technique. Meanwhile, Pagaya and Conis hear the terrible truth about the goal of Enel: to eradicate every person in the sky.\n",
  "long_summary": "Zoro is worried about Nami and Gan Fall, who had been swallowed by the Python. Wyper continues to shoot the Burn Bazooka towards Nola so as to get Aisa out of the snake's stomach. Zoro is faced with the difficulty of fighting Ohm who seems to know Zoro's exact location and attacks him with his Sword. On defeating a Shandia warrior, Zoro attempted to use the opportunity to defeat Ohm using the attack Nitoryu: Taka Nami. However, his attack was countered by Ohm's Eizen Back. Ohm then attacked again using the Eizen Fan, Eizen Fork and Eizen Fleuret. Zoro is becoming frustrated as he is unable to close in on Ohm and his ability to predict his moves. He then launched the attack Sanjuroku Pound Ho, which Ohm countered using the Eizen Whip.\nZoro ran from Ohm and arrived at another location where he discarded his goggles and tied on his bandana, awaiting Ohm. Holy and a Shandia warrior fought and Holy defeated the warrior knocking him out. Ohm counts the total number of fighters as three men and two animals, assuming that Gan Fall will not make it out of the python's stomach. Zoro told Ohm even if he does not know Ohm's location, Ohm's sword will give him the answer. Zoro drew his Katana and launched Santoryu: Hyakuhachi Pound Ho which broke through Ohm's iron cloud and defeated Ohm.\nInside the python's stomach, Luffy used Gomu Gomu No Fusen to ensure that the others are not injured by the impact of the fall. Gan Fall rescued Aisa. However, Aisa took his Lance and pointed it at him in a rage saying he is one of the enemies who stole their homeland. Nami tried reasoning with Aisa that the event occurred 400 years back and Gan Fall was not responsible for it. Gan Fall told Aisa he would gladly give his life if it would quell her anger and apologized to her ancestors. However, Aisa was unyielding and would launch the lance on Gan Fall which Luffy stopped. Luffy told her Gan Fall apologized and there was no reason to kill him. This made Aisa break out in tears.\nRobin has reached the Upper Ruins and is in search of the Belfry Bell. She thought that the City must have fell in its attempts to protect the Poneglyph. She found rail tracks and wondered what was being transported as the tracks appear new. It was then that Enel appeared. He recognized Robin as an archeologist and told her that she is a few years late with regards to finding the gold. Robin asked if he also has the golden bell only to realize that Enel knows nothing of it. Robin discarded the idea saying that if Enel did not find it, then the Bell never made it to the sky. He disproved saying the ringing of a bell was heard when the Upper Yard was shot into the sky 400 years back. He offered for them both to find the golden Belfry Bell. Just then, Enel heard the sound of someone running across the Upper Yard.\nSu made a distress call that brought Conis and Pagaya out, only for them to see a wounded man. The man was a Divine Squad member, one of Gan Fall's men who was forced to labor by Enel. He told them to warn his wife and child that Enel intends to send Skypiea to the Blue Sea and destroy the land. Going on, he further told them to warn everyone that Enel intends to kill all Skypieans. Pagaya told him Enel would lose his position as God if that is done and the Divine Squad member told Pagaya that Enel has the ark, Maxim. He told him the Divine Squad was labored to build an ark that can fly in the sky. Elsewhere, Enel gets up and a worried Robin asks him what he is about to do, and a blast of lightening is seen descending from the sky above where Pagaya, Conis and the Divine Squad member are. Realizing what is about to happen, Pagaya pushes Conis off the land and she is seen falling back towards the Going Merry and crying of a flashback of her father wishing for her and the island's peace. Conis screams for her father as the lightening lands on Pagaya and the Divine Squad member.\n",
  "characters": [
    "Nola",
    "Wyper",
    "Roronoa Zoro",
    "Ohm",
    "Holy",
    "Warashi",
    "Mayushika",
    "Monkey D. Luffy",
    "Nami",
    "Pierre",
    "Aisa",
    "Gan Fall",
    "Nico Robin",
    "Enel",
    "Conis",
    "Sanji (K.O)",
    "Usopp (K.O)",
    "Pagaya",
    "Su",
    "Moyle"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "zoro",
      1
    ],
    [
      "finally",
      1
    ],
    [
      "defeats",
      1
    ],
    [
      "ohm",
      1
    ],
    [
      "with",
      1
    ],
    [
      "his",
      1
    ],
    [
      "108",
      1
    ],
    [
      "pound",
      1
    ],
    [
      "cannon",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      50
    ],
    [
      "and",
      30
    ],
    [
      "to",
      25
    ],
    [
      "of",
      14
    ],
    [
      "he",
      14
    ],
    [
      "that",
      14
    ],
    [
      "is",
      12
    ],
    [
      "his",
      11
    ],
    [
      "a",
      11
    ],
    [
      "was",
      11
    ],
    [
      "ohm",
      10
    ],
    [
      "enel",
      10
    ],
    [
      "told",
      9
    ],
    [
      "gan",
      8
    ],
    [
      "fall",
      8
    ],
    [
      "him",
      8
    ],
    [
      "it",
      8
    ],
    [
      "zoro",
      7
    ],
    [
      "as",
      7
    ],
    [
      "aisa",
      7
    ]
  ]
}