{
  "chapter_number": "Episode 39",
  "title": "Luffy Drowning! Zoro vs Octopus Hatchan!",
  "short_summary": "Zoro faces the six-sword wielding octopus fish-man Hatchan and defeats him. Meanwhile, Nojiko with Genzo are helping out Luffy without being noticed.\n",
  "long_summary": "Zoro battles against Hatchan. Despite Hatchan being unarmed, Zoro struggles against him as he is still injured from his duel against Mihawk and also only has one sword intact. This distracts Sanji, allowing Kuroobi to strike him.\nAs Zoro and Sanji would be unable to rescue Luffy in time, Genzo and Nojiko attempt to save him themselves. They sneak into the base, dive into the pool and attempt to rescue him, but Genzo is unable to break the cement attached to Luffy's feet. Nojiko brings only his head above the surface so he may breathe and Genzo remains underwater to resuscitate him.\nHatchan climbs into his base to get his weapons, six swords for his six tentacles. Zoro borrows from Johnny and Yosaku's swords to use Three Sword Style against Hatchan. Hatchan resorts to targetting Zoro's wounds, striking him in the abdomen. Despite potentially reopening his wounds, Zoro defeats Hatchan with Tatsu Maki, destroying all six of Hatchan's swords and propelling him into the air.\nDespite defeating his opponent, Zoro is too injured to dive into the water to rescue Luffy. Sanji is forced to dive into the water to rescue Luffy, knowing Kuroobi would have an advantage over him underwater. Kuroobi strikes Sanji from behind.\nMeanwhile, Chew chases Usopp through the island outskirts. Nami, who finishes bandaging her wounds at her house, decides to return to Arlong Park and join the battle.\n",
  "characters": [
    "Johnny",
    "Yosaku",
    "Monkey D. Luffy",
    "Nojiko",
    "Genzo",
    "Roronoa Zoro",
    "Hatchan",
    "Sanji",
    "Kuroobi",
    "Nako",
    "Arlong",
    "Dracule Mihawk (flashback)",
    "Usopp",
    "Chew",
    "Kuina (flashback)",
    "Nami"
  ],
  "ssum_frequencies": [
    [
      "zoro",
      1
    ],
    [
      "faces",
      1
    ],
    [
      "the",
      1
    ],
    [
      "sixsword",
      1
    ],
    [
      "wielding",
      1
    ],
    [
      "octopus",
      1
    ],
    [
      "fishman",
      1
    ],
    [
      "hatchan",
      1
    ],
    [
      "and",
      1
    ],
    [
      "defeats",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      16
    ],
    [
      "the",
      10
    ],
    [
      "him",
      8
    ],
    [
      "and",
      8
    ],
    [
      "his",
      7
    ],
    [
      "zoro",
      6
    ],
    [
      "hatchan",
      6
    ],
    [
      "into",
      6
    ],
    [
      "against",
      4
    ],
    [
      "is",
      4
    ],
    [
      "sanji",
      4
    ],
    [
      "rescue",
      4
    ],
    [
      "despite",
      3
    ],
    [
      "from",
      3
    ],
    [
      "kuroobi",
      3
    ],
    [
      "luffy",
      3
    ],
    [
      "genzo",
      3
    ],
    [
      "dive",
      3
    ],
    [
      "six",
      3
    ],
    [
      "swords",
      3
    ]
  ]
}