{
  "chapter_number": "Episode 7",
  "title": "Grand Duel! Zoro the Swordsman vs. Cabaji the Acrobat!",
  "short_summary": "Zoro takes on Buggy's acrobat and chief of staff, Cabaji, engaging in a one-on-one sword fight. After Zoro emerges victorious, Luffy battles against Buggy, where his straw hat is damaged by Buggy's attacks.\n",
  "long_summary": "Luffy knocks Boodle unconscious to prevent him from injuring himself further in battle. Buggy fires a Buggy Ball at the group, but Luffy deflects the cannonball using his rubber body, firing the projectile back at the Buggy Pirates. Buggy's men are decimated by the attack, save for Buggy himself, who had used his subordinates as human shields, and his chief of staff and acrobat, Cabaji, who had used Richie as a shield. Cabaji offers to battle the group on Buggy's behalf, and Zoro decides to duel him one-on-one.\nAt the start of the battle, Cabaji uses dirty tricks to give himself an advantage, aiming for Zoro's stab wound. He also rides on his unicycle to attack Zoro from different angles. However, Zoro uses his Oni Giri technique, slicing Cabaji's chest and defeating him. Cabaji falls off his unicycle, and Zoro falls asleep on the ground, leaving Luffy and Buggy the only combatants left in combat.\nDuring Zoro's battle with Cabaji, Nami breaks away from the group, instead trespassing into the pub. She takes down one of the patrolling guards and uses his key to open a treasure chest, revealing a map of the Grand Line inside.\nLuffy and Buggy battle, with Buggy detaching his body parts to protect himself from Luffy's attacks. However, Buggy manages to damage Luffy's straw hat. Buggy then pierces the hat with three knives, further infuriating Luffy. After Luffy reveals the significance of the hat to Buggy, Buggy reveals that he holds a very strong grudge against Shanks, cursing his name.\n",
  "characters": [
    "Richie",
    "Monkey D. Luffy",
    "Chouchou",
    "Mohji",
    "Roronoa Zoro",
    "Nami",
    "Buggy",
    "Boodle",
    "Cabaji (Debut)",
    "Shanks (flashback)",
    "Lord of the Coast (flashback)",
    "Lucky Roux (flashback)",
    "Yasopp (flashback)",
    "Benn Beckman (flashback)"
  ],
  "ssum_frequencies": [
    [
      "zoro",
      2
    ],
    [
      "buggys",
      2
    ],
    [
      "takes",
      1
    ],
    [
      "on",
      1
    ],
    [
      "acrobat",
      1
    ],
    [
      "and",
      1
    ],
    [
      "chief",
      1
    ],
    [
      "of",
      1
    ],
    [
      "staff",
      1
    ],
    [
      "cabaji",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      17
    ],
    [
      "buggy",
      11
    ],
    [
      "to",
      9
    ],
    [
      "his",
      9
    ],
    [
      "and",
      8
    ],
    [
      "luffy",
      6
    ],
    [
      "battle",
      5
    ],
    [
      "a",
      5
    ],
    [
      "of",
      5
    ],
    [
      "cabaji",
      5
    ],
    [
      "from",
      4
    ],
    [
      "himself",
      4
    ],
    [
      "zoro",
      4
    ],
    [
      "him",
      3
    ],
    [
      "at",
      3
    ],
    [
      "group",
      3
    ],
    [
      "on",
      3
    ],
    [
      "uses",
      3
    ],
    [
      "with",
      3
    ],
    [
      "hat",
      3
    ]
  ]
}