{
  "chapter_number": "Episode 298",
  "title": "The Scorching Kick! Sanji's Full Course of Footwork",
  "short_summary": "Sanji seems to be at a disadvantage due to the active use of Tekkai Kenpo by Jabra, however he uses various kicks from a newly introduced technique called \"Diable Jambe\", which he uses to finish off Jabra.\n",
  "long_summary": "With the Gates of Justice about to open, Sanji believes the Straw Hat Pirates can still save Nico Robin if Usopp does something. Sanji implores Usopp to leave while he faces off with Jabra. The cook tries to take Jabra's Iron Body Kenpo but is knocked back. Just then, Usopp gets an idea to rescue Robin. Before Jabra can give chase, Sanji kicks the wolf-man in the face. Jabra gets up and tries a Ten Finger Pistol, but the cook dodges and retaliates with a Troisième Hachis barrage.\nSanji then continues to pummel Jabra with a number of kicks but is unable to pierce the Iron Body that the wolf-man has. When Sanji does the Deuxième Hachis, it seems to work at first, but Jabra gets back up and knows that the cook is his worthy opponent. The wolf then appears to surrender his key and explains that Robin is his sister. Sanji is perplexed while Jabra tells his story on the West Blue. It seemed like they were happy on the beach when a pirate crew kidnapped Robin. He learned that Robin had escaped and was being hunted by the law. Before Sanji can take the key, Jabra prepares to take him by surprise, but Sanji knows it was all fabricated, so he will kick him twice as hard. Meanwhile, Spandam drags Robin back up the stairs, expecting her to get back up.\nRob Lucci knows that Monkey D. Luffy is not going to get past him, but Luffy tries a number of Gomu Gomu techniques only to get repulsed. Jabra frees himself from where Sanji kicked him and spots that the blonde man had taken the key. Sanji decides to run off and the CP9 wolf-man gives chase but is constantly knocked away. Then, Jabra decides to do his Wolf Hunt High-Speed Scratch to retake the advantage against Sanji. He then blasts Sanji with the Lupus Fall.\nThis time, Sanji intends to stand his ground and builds up his rage. Jabra kicks the cook back with the Devil Wolf technique. Sanji then spins around until his right foot sets on fire. This is Diable Jambe which would pierce the Iron Body. Jabra begins to feel intense pain from the Diable Jambe hitting him. Jabra jumps high and does the Moonlight Ten Finger Pistol piercing the cook. But Sanji does one last kick, Flambage Shot sending Jabra falling to the ground. With their fight over, Sanji walks away.\n"
}