{
  "chapter_number": "Episode 221",
  "title": "The Mysterious Boy With the Whistle and Robin's Guess!",
  "short_summary": "Robin suggests that only those who were sleeping lost their memories. Luffy and the others then remember seeing the mysterious boy who played some kind of flute. Later that night, they discover the boy outside and Luffy tries to fight him. At the last second, he proclaims his memory has returned.\n",
  "long_summary": "Robin informs the Straw Hats about the memories erased from them. Meanwhile, Nami, who left the ship, arrives on a nearby island. A newspaper is dropped from a seagull, and all the residents in the village fight each other over the newspaper. Nami then meets the boy who erased the Straw Hats' memories. He tells her to ride around the island.\nRobin then explains what happened the night they lost their memories. They deduce that only those who fell asleep lost their memories, and that the child stole their memories by playing the low-pitched horn. Luffy figures that although their old memories had been lost, they would just make new memories through their adventures.\nA flashback is shown of Zoro, telling Kuina that either one of them will become the world's strongest swordsman. Kuina's father tells Zoro that Kuina's dream has been passed to him, giving him the Wado Ichimonji. Back in present day, the boy approaches Zoro, but is noticed.\nMeanwhile, Nami, who is bathing, wonders how the Straw Hats ended up as her nakama. She also wonders what happened to her Arlong Pirates tattoo, having forgotten the events of the Arlong Park Arc. A flashback is shown of Nami joining the Arlong Pirates.\nBack to present day, the boy stands on the ship's figurehead and blows the horn. Robin confronts him, waking up all the Straw Hats in the process. Angry, the boy attempts to blow into his horn a sleeping spell, but is confronted by Luffy for sitting on the figurehead. The horn emits a blue, sparkling dust that flows into Luffy's mouth. The boy escapes, but when Luffy wakes up, he regains his memory.\n"
}