{
  "chapter_number": "Episode 284",
  "title": "The Blueprints Aren't Passed! Franky's Decision",
  "short_summary": "After Robin decides she wants to live, the Straw Hat Pirates wait for the bridge, so they can battle CP9. Franky reveals that the Pluton blueprints are with him and burns them in front of Spandam, saying that he's betting it all on the Straw Hats. With unexpected help from Kokoro, Franky and the Straw Hats make a dramatic entrance into the Tower of Justice.\n",
  "long_summary": "We rewind to the point just after Robin tearfully declares she wants to live. Back at the Courthouse, Mozu and Kiwi finally make it to the drawbridge levers atop the towers and throw them. The Straw Hats feel the rumble and realize the drawbridge to the Tower of Justice is lowering. Soon the gap will be closed, and the Straw Hats can advance. CP9 stands defiant, ready for the challenge. Back at the Courthouse, Baskerville declares he will stop the drawbridge. Zambai and Paulie attempt to counterattack, but a shocking fact is revealed. Baskerville isn't one Three-Headed Judge but three judges in a single costume. Because of this, the attacks miss, and Center Baskerville is able to order a trench mortar fired on the drawbridge, jamming it partway. Without a clear path, Spandam can still escape to the Gates of Justice.\nBut then, Franky decides to make a play of his own. He reveals something Spandam had been seeking for a long time: the plans to Pluton. Spandam and CP9 suddenly realize they'd been tricked. Franky had been concealing the plans within his cyborg body the whole time. Spandam demands Franky hand them over, but instead Franky talks to Nico Robin, admitting that he'd misjudged her based on the rumors of her past. The one thing he and the rest of Water 7 had feared the most was the forbidden knowledge she kept in her head. That and the plans in his hand are the only means by which to reconstruct a weapon of mass destruction. The only reason Water 7 had been keeping the plans was in case she or someone tapped into her knowledge and built a Pluton; then it would take another Pluton to counter it. For years, the shipwrights feared Robin because she was a wildcard: a lonely, shunned individual who could be exploited to tragic end. But now, for the first time, Robin is not alone. The Straw Hats stand with her and have already declared their intention to defend her to the end. Knowing this, and knowing the peculiar situation he's in, Franky decides to make a bet. Silently praying that Tom would've understood what he is about to do, he holds the Pluton plans before him...and burns them to ashes in a blast of Fresh Fire. Spandam and CP9 are shocked again as Franky ruins their five-year espionage mission in a stroke. With the World Government actively seeking them, the plans were no longer of value as a countermeasure, so Franky denied them the prize to prevent them being turned against the wishes of the shipwrights. With the plans destroyed, there's only one way left to build Pluton: Robin's knowledge. His bet is that the Straw Hats will rescue Robin: in doing so denying the World Government their last chance to gain access to the weapon. Franky is now siding with the Straw Hats to help ensure this. Suddenly, Franky hears familiar voices from the Courthouse. It's Zambai and the Franky Family, cheering him on. Franky realizes he, too, is not alone. Finally driven to the point of rage, Spandam attacks Franky, sending him over the broken balcony and into the abyss...\nAt that moment, Kokoro's voice sounds from Nami's Den Den Mushi. She has Rocketman running again, and it's making its way to the Courthouse. Kokoro tells the Straw Hats to get ready to jump into the abyss. The Straw Hats are confused at first, but once they hear Rocketman's whistle, Luffy realizes what's happening. He stretches his arms to envelop the others and takes the leap off the Courthouse roof. As the Straw Hats and Franky fall, Rocketman appears at the drawbridge and speeds upward at full tilt, flying off the end and into the air. Luffy steers himself and the rest of the Straw Hats to land atop the midair Rocketman, and the train manages to catch Franky on its dented nose. Rocketman continues its flight, and Spandam (to his horror) and CP9 (to their delight) realize it's going to make it. Kokoro contemplates a sense of déjà vu. Many years ago, Tom's Workers built a ship for a certain audacious pirate by the name of Gold Roger. And today, here are Tom's Workers helping another audacious pirate in Luffy.\n"
}