{
  "chapter_number": "Episode 134",
  "title": "I'll Make it Bloom! Manly Usopp's Eight-Shaku Ball",
  "short_summary": "The crew stops on Fireworks Island that is getting ready for its annual fireworks festival. Usopp meets a young fireworks-maker named Kodama and helps her achieve her dream.\n",
  "long_summary": "The Straw Hats arrive at Fireworks Island just in time for its annual fireworks festival. The locals explain that the tradition of the festival has been going on for 400 years and is carried on by a family who lives on top of the mountain on the island, although now it is just an old man and his granddaughter. This reminds Usopp that they need gunpowder, so he sets off to the mountain to get some from the old man.\nUsopp reaches the mountain and is immediately sent away by the old man, Odama, since the latter has no time for a “novice firework maker” like him, especially on the day of the festival. Usopp tries to convince him by showing Odama a firework of his own making but is instead stunned at the humongous firework inside the old man’s home.\nKodama arrives and inspects Usopp’s firework and compliments it and encourages Usopp to “finish it.”\nMeanwhile, Odama admonishes Kodama for wasting time and sends her off to finish her tasks for the festival. He then orders Usopp to help Kodama, which Usopp reluctantly does after the young girl asks him to help.\nThe two bond and Kodama once again compliments Usopp’s firework and tells him to “finish it.” She explains that any firework is considered unfinished until it blossoms beautifully in the night sky. Usopp then mentions the huge firework he saw earlier and how he would like to see it go off. Kodama explains that a year ago, they tried to fire a similarly huge firework, but the equipment was flawed and there was an accident which killed both of her parents.\nSuddenly, the rain starts again, and Kodama mentions that the party cannot proceed if it continues to rain. Nonetheless, Odama tells them to continue with the preparations.\nKodama tells Usopp that if the weather allows it, she plans on launching the huge firework at the night of the festival. This flusters Usopp as he thinks she cannot launch such a big firework by herself. She assures him that the launch team will help her setup the firework but she will fire it up by herself so everyone else will be safe. She says that their family used to have the technical skills to make and launch 200-gauge shells but somewhere along the way they lost these skills and that it was her parents’ dream to revive the tradition and bring back those skills. She then asks Usopp to distract her grandfather while she and the launch team carry the shell away.\nHowever, Odama finds out about Kodama’s plan from the launch team and forbids his granddaughter from launching the shell. Kodama runs away and Odama tells everyone else to prepare for the festival.\nUsopp notices something about the tower in the old man’s home and asks him if it has been there for 400 years. He then says that he has a hunch that he wants to share with him.\nUsopp then finds Kodama in the cemetery where her parents are buried. Usopp makes her realize that her parents’ dream is not just about launching a 200-gauge shell, but that she is their dream. Their dream is that she carries on the family tradition and becomes a master pyrotechnist. He tells her that while it would be great to bring back their old family tradition, her parents just want her to be safe and sound.\nThe rain suddenly stops and this gets the girl’s spirits up. The festival proceeds and fireworks are displayed in the night sky. Odama then reveals that Usopp was able to devise a pulley system to haul the 200-gauge shell towards the tower in the old man’s home. Furthermore, it is revealed that the said tower is actually a 400-year-old launch platform of their family’s 200-gauge shells. Usopp and Odama prepare to launch the shell after all the other fireworks have been ignited. As Kodama fires her last one, Usopp “finishes” his firework and then has Odama light up the 200-gauge shell which blossoms throughout the island in a gigantic finish.\nKodama sees this and is even more inspired to become a great pyrotechnist. Usopp uses this opportunity to ask for some gunpowder once again and Odama at first says no as Usopp could be a pirate for all he knows, but he then relents.\n",
  "characters": [
    "Monkey D. Luffy",
    "Sanji",
    "Usopp",
    "Nico Robin",
    "Tony Tony Chopper",
    "Nami",
    "Roronoa Zoro",
    "Kodama",
    "Kadoyan",
    "Odama"
  ],
  "ssum_frequencies": [
    [
      "fireworks",
      2
    ],
    [
      "her",
      2
    ],
    [
      "the",
      1
    ],
    [
      "crew",
      1
    ],
    [
      "stops",
      1
    ],
    [
      "on",
      1
    ],
    [
      "island",
      1
    ],
    [
      "that",
      1
    ],
    [
      "is",
      1
    ],
    [
      "getting",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      54
    ],
    [
      "and",
      27
    ],
    [
      "to",
      25
    ],
    [
      "usopp",
      18
    ],
    [
      "that",
      17
    ],
    [
      "a",
      14
    ],
    [
      "her",
      13
    ],
    [
      "firework",
      12
    ],
    [
      "is",
      11
    ],
    [
      "it",
      11
    ],
    [
      "he",
      11
    ],
    [
      "kodama",
      11
    ],
    [
      "odama",
      10
    ],
    [
      "she",
      10
    ],
    [
      "for",
      9
    ],
    [
      "then",
      8
    ],
    [
      "in",
      7
    ],
    [
      "festival",
      7
    ],
    [
      "of",
      7
    ],
    [
      "on",
      7
    ]
  ]
}