{
  "chapter_number": "Episode 94",
  "title": "Reunion of the Powerful! His Name is Fire Fist Ace",
  "short_summary": "While in Nanohana, the Straw Hat Pirates encounter Smoker and Tashigi. A pirate named Portgas D. Ace appears, and is revealed to be Luffy's older brother.\n",
  "long_summary": "In Nanohana, a young man previously shown in Drum Kingdom is shown walking the town. A salesman approaches him claiming to have a magical golden apple, but he refuses to buy it. Chopper and Usopp overhear the offer, but Nami and Zoro stop them from being conned after Zoro finds an associate painting them. Zoro notices a man asking if people in the town had seen Luffy, using his wanted poster. He is directed to Spice Bean where the owner knows many of the townspeople.\nThe present Straw Hats wonder why he is looking for Luffy. Zoro notices the tattoo on the man's back, and knows he is not a bounty hunter. He then sees Tashigi elsewhere in the town, dressing a shopkeeper down for overpricing swords, and hides. Smoker appears, carrying several captured small-time pirates. He is sure Luffy will show up in Arabasta, and has Tashigi take the defeated pirates to the Royal Army. Zoro wonders where Luffy ran off to. He is wandering across the desert, and starts running when he sees a town nearby, hunger driving him to find food.\nAt the Spice Bean restaurant, patrons are gathered around the young man seen earlier, who is face-first in a plate of food. They believe he has dropped dead mid-eating, and suspect he was bitten by a venomous insect. Suddenly, he wakes up, wipes his face off, and resumes eating. He tells everyone he just fell asleep. Shortly after, he falls asleep again. After waking up, the man asks Yoshimoto if he has seen Luffy.\nThey are interrupted by Smoker, who noticed the earlier commotion. He identifies the young man as the Second Division Commander of the Whitebeard Pirates, Portgas D. Ace, startling those present. When asked why he is here, Ace says he is looking for his brother. Luffy is running through Nanohana, tracing the scent of food. Smoker says he is not here for Ace, but will go ahead and try to capture him. Suddenly, Luffy uses Gomu Gomu no Rocket to launch himself towards Spice Bean. He rams Smoker and Ace through the restaurant's rear wall and the walls of several adjacent buildings, then demands the restaurant owner make him food.\nWhile Luffy is chowing down, Ace and Smoker are on their way back to the restaurant. Ace apologizes to a family for disturbing their meal. Smoker identifies Luffy, though it takes a second for Luffy to remember him from their encounter at Loguetown. He stacks all the remaining food in his mouth, and runs, with Smoker chasing him. The owner notes that neither Ace nor Luffy paid for their meals. Luffy knows he cannot beat Smoker, so he goes looking for his crew. Smoker sees Tashigi and orders her to look for the Straw Hats as he pursues Luffy. As she runs, knowing that Luffy is in town, she thinks it is likely for Zoro to be there as well.\nSmoker asks Luffy why he is in Arabasta, to which he responds he came to beat up Crocodile. Smoker asks him how they are connected but Luffy disappears. On the other side of town, Nami, Zoro, Chopper and Usopp catch back up with Sanji, Vivi and Karoo, and tell them the Marine is present. They hear a commotion, and Luffy soon runs to them, with Smoker on his trail. Smoker is intercepted by Ace, who uses Kagero to halt his attack, White Blow.\nLuffy recognizes Ace, and is surprised he is a Devil Fruit user now. Ace tells him he ate the Mera Mera no Mi. He then tells Luffy to run, and says he will hold Smoker off. Smoker asks why Ace is helping the Straw Hats and he says a big brother has to help his little brother. Luffy tells his crew that Ace is his brother, to their shock, as they make their getaway.\n"
}