{
  "chapter_number": "Episode 299",
  "title": "The Drawn Sword's Fierce Attack!Zoro vs Kaku Powerful Slash Showdown",
  "short_summary": "The battle between Zoro and Kaku rages on. Meanwhile Franky finally reaches Luffy.\n",
  "long_summary": "The episode begins just after Sanji's fight with Jabra ends, with Zoro's fight with Kaku just heating up with the two fighters clashing with such power that the tower starts to slide again causing Sanji to wonder if they are trying to collapse the tower. As he avoids the debris, he notices the sign Nami left before and decides to head after them.\nBack with Robin and Spandam, they have unfortunately arrived at the Bridge of Hesitation, and they now see the gates which are now wide open. Spandam soon starts to gloat and mock Robin, telling her that once he passes through the gates he will be known as the world's hero but when she (Robin) passes, it'll be like hell. Robin then headbutts him in an attempt to escape but stumbles and trips before she can get far. Spandam then proceeds to taunt and kick Robin with him calling her stupid over and over again. Spandam tells Robin that she cannot escape and to give up by calling her an obstinate cow. He reminds her that he is the hero of the world, and he is different than her and better than her. Spandam says while he gets a bright future ahead, Robin is condemned to die without a shred of hope. He tells Robin that she is nothing but a steppingstone to her. He asks \"Have I finally gotten that through your thick skull? Or do I need to keep grinding it in for you?\" and then he laughs evilly. Franky is then seen running through the tunnel when he sees a light. We then see the Buster Call with one of the lesser members saying that their time for arrival is 10 minutes. Franky then arrives in the room where Luffy and Lucci are fighting. While Luffy is holding on to Lucci, Franky tells him that he got him, and tells him to hold him there and he will shoot him. Luffy tells Franky that he would take care of him and to go and to leave Lucci to him. Franky tells Luffy that he needs to get serious and to work as a team on the battle, and Luffy said that this is his battle and he can't lose to him, and he tells Franky to leave and find Robin right now and he is counting on him.\n"
}