{
  "chapter_number": "Episode 78",
  "title": "Nami is Sick? Beyond the Snow that Falls on the Ocean!",
  "short_summary": "Nami is sick, but the crew does not have a doctor to help her. She collapses on deck and the others are worried for her health when Vivi explains how serious her condition is. Meanwhile, Mr. 2 is dispatched to Little Garden to clean up the mess left by Mr. 3 and the others.\n",
  "long_summary": "After killing the Island Eater with Hakoku, the weapons of the two giants break and they try to remember why they were dueling for about 100 years ago until their signal for battle activates. It is revealed they were captains of a crew of giants who battled anyone who opposed them. After they each killed a sea king, a little girl asked which one was bigger. This caused the two to head to Little Garden and compare sizes, and they remained on the island and dueled to decide which was bigger ever since. Back to the Going Merry, Usopp starts talking about how he would like to go to Elbaf someday and Luffy agrees to that, so they dance while singing until they almost fall overboard. Meanwhile Nami starts to feel tired and asks Vivi to watch the Eternal Pose leading to the Arabasta Kingdom for her. Vivi then remember how she must not die if she wants to save her kingdom. Sanji gets out of the kitchen telling Vivi to not push herself too hard, as she has him, he then offers Vivi and Nami some appetizers and asks for their beverage of choice. Luffy, Usopp and Karoo's mouth are watering and Sanji (in a mad way) tell them that theirs are in the kitchen. Zoro is seen in the back of the Merry doing half-ton weights and saying to himself that he is weak, as he could not save everyone of the Tokudai Candle Service Set.\nOn Sandy Island, an alarm sounds to let Mr. 2 Bon Kurei know that his crew is ready to depart. Back to the Merry, Nami's condition gets worse when she suddenly faints after telling Vivi she was going to lay down. After talking with Vivi, Sanji, Karoo, Usopp and Luffy, Nami gets out of the room pretending her condition to be okay. Nami asks Zoro why he did not watch the Pose and advert her of the change in the course. She predicts that an atypical wind will catch in their way if they keep going straight. Zoro orders the crew to change direction and the pirates save themselves of a cyclone. While it's snowing, Nami is in bed and Vivi is taking care of her as Sanji and Karoo freak out. Zoro sees a man standing in the sea and lets Luffy and Usopp know.\n"
}