{
  "chapter_number": "Episode 99",
  "title": "Spirit of the Fakes! Heart of the Rebel Army, Camus!",
  "short_summary": "After hearing that a small village has fake Rebel Army bodyguards that have been keeping peace, Vivi asks Luffy and the others to test if they are worthy of staying. They stand their ground, and are allowed to stay as the Straw Hats retreat.\n",
  "long_summary": "Luffy and his crew say their parting goodbyes to the sand pirates. As they're leaving, Zoro questions the whereabouts of Luffy's brother, Ace. Luffy claims that Ace would eventually show up out of nowhere, and the crew begins their journey to the city of Ido.\nMeanwhile, in Ido, a group of Camu's rebels are having a meal with the mayor, discussing the strength of their troops and telling how the rebel and royal army would soon have to clash. Suddenly, one of Camu's men rushes up to him exclaiming about the arrival of sand pirates. Camu's decision was to run and hide, to the others' surprise. As Camu begins to walk out, the lizard that Ace was accompanying shows up and behind them Ace is sitting at the table eating their food. The men call Ace a \"food thief\", and Ace goes on to beat the living crap out of them. Camu watches, petrified, and bows down to Ace in fear and begs for his help against the sand pirates. Ace agrees to do so, but on a condition.\nWhile riding on the lizard to defeat the sand pirates, he runs into Luffy and his crew, saying how the rebels believed that they were sand pirates. Ace explains to Vivi how there are \"rebels\" in town, but are actually mere hoodlums. Vivi gets upset, and says how there is nothing wrong with villagers wanting to protect their village, even if it means posing as rebels. She brings up the idea of testing them to see if they are strong enough to carry the burden of protecting the village on their shoulders.\nCamu and his men are seen hiding in barrels, questioning whether Ace had beat the sand pirates or not. As Camu begins to leave once again, all the villagers show up outside his door cheering him on for the oncoming fight against the sand pirates. The mayor walks up to them and wishes them the best against the sea pirates. Camu is confused, as he was sure they were sand pirates. The mayor then goes to show him the wanted poster of 30,000,000 on Luffy's head, and he becomes frightened. They begin to secretly devise a plan to outrun the pirates once they leave town, but as they open the gates, the Straw Hat Pirates surround them menacingly [ゴゴゴゴ]. The rebels stand their ground as the Straw Hats begin to attack. Camu and his men decide to stop being cowards and stand thier ground.  Vivi is satisfied with this and signals for the Straw hats to retreat. By the end of the episode, Luffy and his crew deem the \"rebels\" worthy of staying to protect the town.\nThe non-canon characters in this episode, such as Camu's group and the Barbar Pirates, briefly make an appearance in Episode 130 which is largely a canon episode.\n",
  "characters": [
    "Monkey D. Luffy",
    "Sanji",
    "Barbarossa",
    "Nefertari Vivi",
    "Rasa",
    "Zaba",
    "Tony Tony Chopper",
    "Roronoa Zoro",
    "Usopp",
    "Matsuge",
    "Nami",
    "Camus",
    "Ido's Mayor",
    "Portgas D. Ace",
    "Young Koza (flashback)",
    "Chaka (flashback)",
    "Pell (flashback)"
  ],
  "ssum_frequencies": [
    [
      "that",
      2
    ],
    [
      "and",
      2
    ],
    [
      "the",
      2
    ],
    [
      "to",
      2
    ],
    [
      "they",
      2
    ],
    [
      "are",
      2
    ],
    [
      "after",
      1
    ],
    [
      "hearing",
      1
    ],
    [
      "a",
      1
    ],
    [
      "small",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      41
    ],
    [
      "to",
      24
    ],
    [
      "and",
      19
    ],
    [
      "of",
      13
    ],
    [
      "pirates",
      12
    ],
    [
      "ace",
      10
    ],
    [
      "sand",
      8
    ],
    [
      "as",
      8
    ],
    [
      "his",
      7
    ],
    [
      "their",
      7
    ],
    [
      "up",
      6
    ],
    [
      "in",
      6
    ],
    [
      "a",
      6
    ],
    [
      "rebels",
      6
    ],
    [
      "camu",
      6
    ],
    [
      "them",
      6
    ],
    [
      "on",
      6
    ],
    [
      "they",
      6
    ],
    [
      "are",
      5
    ],
    [
      "is",
      5
    ]
  ]
}