{
  "chapter_number": "Episode 110",
  "title": "Merciless Fight to the Death! Luffy vs. Crocodile",
  "short_summary": "After escaping from Rain Dinners, the Straw Hat Pirates and Vivi cross the desert to Alubarna, where the final battle will take place. Crocodile, however, manages to catch Vivi with his hook, but Luffy changes places with her and he begins the first round of their battle.\n",
  "long_summary": "Starting from the previous episode, the Straw Hat Pirates are seen escaping to the East from pursuing Marines. However, Smoker calls them off, claiming that he is tired, and that they won't catch them. Smoker then tells a subordinate to order for backup from surrounding Marine warships straight to Arabasta. \nChopper and Matsuge seen riding a huge crab-creature called a 'Moving Crab' towards the scent of Nami's perfume. Apparently, Matsuge is friends with several animals, including the Moving Crab.\nHowever, as the Straw Hats, Vivi, Matsuge and the Moving Crab head towards Alubarna, Crocodile's hook latches onto Vivi, pulling her away. Luffy, in a split second decision grabs onto Vivi to switch places with her and follows the hook back to Crocodile. Before engaging with the man though, Luffy orders the others to head straight to Alubarna without him, and to get Vivi home.\nFinally, with one last promise to meet in Alubarna, Luffy engages Crocodile and Miss All Sunday. Luffy then addresses how kind Vivi is in her selflessness and entirety to protect her entire kingdom and solve the conflict without bloodshed. Crocodile says how hers is a foolish belief and asks if Luffy agrees with him. He does. However, Luffy claims that as long as Crocodile lives Vivi will suffer and as her friend, Luffy would stop him here. Crocodile claims that this makes Luffy an even bigger fool for becoming intimate with others and as such he will die for it.\nAfter a taunt towards Crocodile, Miss All Sunday laughs and Crocodile asks if he should kill her too, calling her by her real name- Nico Robin. Robin then tells him to do as he wishes even though he has broken his promise to never call her by that name. She then leaves, claiming to go to Alubarna. His patience thinning, Crocodile places down a sand timer with a limit of three minutes saying that he only has that much time to 'play' with Luffy. Luffy claims that it is fine with him and starts his offense with his Gomu Gomu no Pistol attack. Crocodile evades by predictably evaporating into sand. Crocodile lunges forward with his hook, when Luffy narrowly ducks the attack.\nLuffy's next attack to Crocodile's back, Gomu Gomu no Stamp is also thwarted as Crocodile's Suna Suna no Mi's abilities which seem to be impervious to physical attack. This is shown again by a futile Gomu Gomu no Gatling Gun, each attack passing through him, a Gomu Gomu no Bazooka blasting sand everywhere, and an axe kick that does no damage.\nHowever, as Crocodile continues to try and explain to Luffy why he will never win, Luffy cuts him off by clocking his face with a haymaker that although doing no physical damage, shuts Crocodile up and enrages him. Before the three minutes are up, Crocodile decides he is done playing with Luffy even though Luffy says to have been fighting seriously the whole time. He then shows off his first impressive attack - Desert Spada (Desert Sword in italian). It sends a blade of sand towards Luffy that he once again narrowly dodges. Crocodile compliments Luffy on his quick reflexes and claims that had it hit him, he would have certainly died. Crocodile finally explains to Luffy why he will never win. Unlike Luffy, Crocodile trained his Devil Fruit powers to the point of mastering them. He claims that any Devil fruit power can be powerful in a fight as long as someone knows how to use them properly. Crocodile says to Luffy that if he has proper training, his skills can be as formidable as any, but claims that Luffy's not there yet, just like all the other fools who waste time obsessing over their abilities. Crocodile attacks again instantly afterwards with Desert Girasole (Desert Sunflower), creating a large pit of quicksand where Luffy was standing. He escapes however with another bazooka.\nThis is when Crocodile seems to get deadly serious. As Luffy futilely continues to attack him, Crocodile uses Barchan, which completely dehydrates Luffy's right arm. In a comedic fashion, Luffy remembers the water from Yuba, and drinks from it restoring his arm quickly. Luffy then attacks in a quite familiar fashion to the former king of Drum Kingdom Wapol by using Gomu Gomu no Baku Baku to chomp off the top part of Crocodile. Crocodile dodges, but is infuriated by Luffy's attack.\nThe three minutes from the sand timer have run out as well. Crocodile prepares his last attack- Sables (Sandstorm) to finish Luffy. However, it seems as if it was not actually intended for Luffy but for Yuba to the south, for the wind blows from north to south. Luffy, enraged at Crocodile's cruelty asks why. Luffy, for whatever reason thinks talking Crocodile and the sandstorm down will make it go away. Crocodile impales Luffy with his hook right in the middle of his ranting.\n",
  "characters": [
    "Sanji",
    "Roronoa Zoro",
    "Usopp",
    "Nefertari Vivi",
    "Nami",
    "Monkey D. Luffy",
    "Smoker",
    "Hasami",
    "Tony Tony Chopper",
    "Matsuge",
    "Crocodile",
    "Nico Robin",
    "Toto (flashback)",
    "Tashigi"
  ],
  "ssum_frequencies": [
    [
      "the",
      4
    ],
    [
      "and",
      2
    ],
    [
      "vivi",
      2
    ],
    [
      "to",
      2
    ],
    [
      "battle",
      2
    ],
    [
      "with",
      2
    ],
    [
      "after",
      1
    ],
    [
      "escaping",
      1
    ],
    [
      "from",
      1
    ],
    [
      "rain",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      32
    ],
    [
      "luffy",
      29
    ],
    [
      "the",
      25
    ],
    [
      "crocodile",
      25
    ],
    [
      "and",
      19
    ],
    [
      "he",
      16
    ],
    [
      "a",
      16
    ],
    [
      "with",
      16
    ],
    [
      "that",
      15
    ],
    [
      "as",
      15
    ],
    [
      "his",
      14
    ],
    [
      "is",
      10
    ],
    [
      "him",
      10
    ],
    [
      "gomu",
      10
    ],
    [
      "her",
      9
    ],
    [
      "attack",
      9
    ],
    [
      "of",
      8
    ],
    [
      "in",
      8
    ],
    [
      "it",
      8
    ],
    [
      "no",
      8
    ]
  ]
}