{
  "chapter_number": "Episode 150",
  "title": "Dreams Don't Come True!? Bellamy vs. The Saruyama Alliance",
  "short_summary": "While the Straw Hat Pirates are looking for a South Bird, Bellamy and his crew attack Cricket's house and steal the gold artifacts he collected over the years from his salvage work. When the Straw Hat Pirates return and see what happened, Luffy decides to take a side trip back to Mock Town and take the gold back.\n",
  "long_summary": "The Straw Hats are still attempting to capture the South Bird. However, the bird has waged an offensive against them by turning the forest against them. Meanwhile, Bellamy and his crew arrived at Cricket's place in order to take his gold treasures. Sarquiss and the rest of them were easily defeated by the Saruyama Alliance then Bellamy decided to join in the fight. Bellamy easily defeated Cricket, Shoujou, and Masira using his Bane Bane no Mi powers. Their gold was stolen and Bellamy's crew finished it off with more offensive against the Saruyama Alliance because Cricket had said they do not have the right to touch the gold. Bellamy on his way back to his ship went on to say that in the new era they need to understand that dreams do not come true. Cricket then told him that \"a chick who does not have the guts to fight against something he's never seen shouldn't be telling me about pirates.\"\nThe Straw Hats have gathered together after being chased by various animals set up by the South Birds. The bird finally came to meet them and Tony Tony Chopper interpreted the bird saying they would never catch him. As Usopp was about the shoot the bird down, Robin captured the bird with her Hana Hana no Mi. Upon returning to Cricket's house, the Straw Hats found that they have been beaten up. Usopp was mourning how their ship has been damaged. Luffy tried asking Cricket what had happened but Cricket refused to tell him and only apologized saying there was nothing they could do—referring to their easy defeat. At that point, Nami told Luffy that the gold has been stolen. Cricket stated it does not matter the gold is stolen. Usopp chastised him saying Cricket had spent 10 years beating his body through diving so as to attain the gold.\nCricket was persuading them saying that the Saruyama Alliance have a duty and that was to get the Straw Hats to the Sky Island. While talking, Zoro noticed Bellamy's mark on the Going Merry's hull and called Luffy's attention to it. Luffy then resolved to fight them and Zoro asked if he needed a hand and Luffy said no that he would be fine. Nami said that Luffy shouldn't go because they have only 3 hours left to set sail. Cricket tried to stop him by talking but Zoro offered him a katana saying Cricket would need that to stop Luffy. Luffy then told them that he would be back by dawn.\nA drunk customer after relieving himself thought a newspaper had dropped. He picked it up and realized it was a stack of wanted posters. Upon going through the posters he recognized Luffy's and Zoro's faces and laughed when he saw their bounties thinking he was too drunk. He became extremely surprised that their bounties were so high to the point of being higher than Bellamy's bounty.\nLuffy had begun making his way to Mock Town. Meanwhile, Sarquiss was telling of the event that occurred between their crew and the Saruyama Alliance. Soon the drunk man who picked up the wanted posters came into the bar and showed it to all who were in the bar including Bellamy. Bellamy tried to counter the poster saying there are pirates who try to increase their bounties and their opponents become scared and would not fight them. He referred to Luffy and Zoro's event where he beat them up earlier in the day. While the bar customers were trying to justify the situation, Luffy arrived and yelled Bellamy's name requesting his whereabouts.\n"
}