{
  "chapter_number": "Episode 121",
  "title": "Vivi's Voice Goes Unheard! A Hero Descends!",
  "short_summary": "As Koza desperately tries to stop the Rebel Army, both sides begin fighting again due to the intervention of Baroque Works. Vivi is thrown to almost certain death, before Luffy suddenly saves her and challenges Crocodile to another fight.\n",
  "long_summary": "Koza is shot by Baroque Works agents that have infiltrated the Royal Guards and as he collapses, he tries to tell the Rebel Army not to fight. The Royal Guards confront the solider that shot Koza but as Koza once again tries to talk to the Rebel Army, a sandstorm blows through the palace obscuring the battlefield and allowing Baroque Works agents that have infiltrated both sides to fire more shots towards the Rebel Army and Royal Guard, triggering a clash between them.\nVivi and Koza try to stop the fighting, but their voices are drowned out by the fighting occurring in the Palace Square. In the Palace, Chaka succumbs to his wounds and collapses and King Cobra tells Vivi to run away which she refuses, pointing out that Crocodile was the cause of the sandstorm and that she still wanted to stop the bomb that is set to explode in fifteen minutes, to at least save some of the fighters in the Palace Square. \nCrocodile then grabs Vivi by the neck, telling her she was too weak to have those zealous ideals, and she reminds him that as the Princess of the country, she will never yield to him or give up. Crocodile reminds Vivi that the Rebel Army reinforcements are still arriving and will walk into the range of the blast and then hangs her over the cliff by the neck as he lambastes her for her decision not to tell the soldiers about the bomb, pointing out that despite the panic, at least a few thousand would've survived. Crocodile notes that Vivi had been working as a spy in Baroque Work for two years and then drops her off the cliff.\nIn the distance, Luffy arrives flying on Pell to Crocodile's shock. They catch Vivi before she hits the ground, and she tells them about the bomb that is set to explode. At the Palace Square, Luffy and Vivi meet up with Chopper, Sanji and Usopp as well as Zoro who had been carrying Nami. Luffy apologizes for losing to Crocodile and promises not to lose again and tells them to take care of the other matters as he stretches up towards the Palace to fight Crocodile.\nCrocodile attempts to dodge Luffy's hit, only to be punched in the face, making him bleed slightly. Before he could recover, Luffy attacks him again and Crocodile begins to realize that Luffy has uncovered his weakness. Luffy explains that he found his weakness after their first fight when the water he got from Yuba spilled on Crocodile, preventing him from turning to sand. \n"
}