{
  "chapter_number": "Episode 215",
  "title": "The Screaming Speed Serve! Pirate Dodgeball!",
  "short_summary": "With Luffy's victory, he takes Chopper back, but foolishly accepts another challenge by Foxy.\n",
  "long_summary": "Luffy wins the final round of the roller coaster race against Foxy and his crew in the three-coin Davy Back Fight. He then brings Chopper back to the Straw Hat crew. Foxy, declaring that there should be no draws in the Pirate world, asks for a three-coin rematch. Luffy accepts, and Robin and Sanji question his motives for doing so, wondering if he's trying to find a shipwright. Nami and Usopp are angered with Luffy but also terrified, convinced that the Foxy Pirates will take them, until some Foxy crewmates tell them otherwise.\nHit & Dead ball, the first event in the three-coin match, is essentially a game of dodgeball. The goal is to out all of the opposing team's players. Whichever team loses all of their members first loses the entire first round. The game has a long history and thus also has many rules. Nami assumes the rules are made to give Foxy's team an advantage, but realizes everyone must play fair thanks to strict consequences and a change of referees. The Foxy Pirates greatly outnumber the Straw Hats, making it seem as if the Straw hats are at a disadvantage. Two players from Foxy's team as well as Luffy and Chopper step up, preparing for a double jump start. The two opposers attack, but Luffy and Chopper evade them, grab the balls, and aim for Foxy, who is hit in the face. The referee calls it a safe since according to the rule book, face hits don't count. The balls are then passed to Zoro and Sanji, who knock out a total of 18 players. The balls are passed back to Luffy, who disqualifies 10 players, and Chopper, whose ball is stopped by Hamburg.\nBig Pan of the Foxy Pirates has both balls, but ends up disqualifying Usopp and 22 players from his own team. There are few remaining on Foxy's team, and it doesn't seem as if the Straw Hats have much of a disadvantage anymore. Hamburg and Foxy decide to use a secret weapon to win, but then Robin outs Hamburg. A referee tries to declare it a safe, before being corrected and reprimanded. A ball is passed to Sanji, but some women trick him into giving them the ball and letting them get him out. Foxy brings out the secret weapon, \"Dead Hit\" cannon. Robin notes that according to the rule book, Dead Hit is the only weapon allowed.\nPorche and Foxy try to trick Zoro, who in turn cuts the ball with his bare hands to avoid getting hit. He is then disqualified, as cutting the ball is against the rules. The only players left on the field are Luffy, Chopper, and Foxy. Luffy dodges Foxy's next ball, but Chopper notices that it bounces back and shields him. He is assumed to be out until he reveals that it was a face hit, and earns the support of the audience. Although the referee agrees, Chopper went out of bounds and is therefore disqualified. Luffy goes to thank Chopper, and then proceeds with the game. He stretches out to throw his ball at Dead Hit, but while doing so, the ball is taking by Porche. She and the rest of the spectators shuffle the real ball with fake ones, making it impossible to tell which is which. Luffy attempts to catch all the balls thrown at him in case one is real, but Foxy launches his own ball as well. Nami tells Luffy to let it hit his face as his arms are full, but ends up catching it with his mouth and swallowing it. The referee declares that Luffy is now also disqualified. According to the rulebook, swallowing balls is not allowed. The Straw Hats are outraged, but the rule is real. The Foxy Pirates won the first round of the Davy Back Fight.\n"
}