{
  "chapter_number": "Episode 171",
  "title": "Howling Burn Bazooka!! Luffy vs War Demon Wyper",
  "short_summary": "Luffy fights Wyper, but after some time, he falls into some \"underground ruins\". Meanwhile, Enel appears on the Going Merry and after telling them that his true goal was the City of Gold, he takes out both Usopp and Sanji; he then vanishes and leaves Satori's brothers, Hotori and Kotori, to avenge him.\n",
  "long_summary": "Usopp cries over the loss of Sanji, but Nami states that he was checking if his heart was beating on the right and he needed to check the left side. On doing that, Usopp became relieved that Sanji's heart was still beating. At that point, Usopp threatens Enel by lying that he has 8,000 followers and will spare Enel's life if he leaves. Enel, upset at Usopp, takes him out with his Goro Goro no Mi. Enel then told Gan Fall that the Divine Squad members, who he seized six years ago, have been working long and hard till this day without rest. He also told Gan Fall that his need for Sky Island is also complete. Enel stated that the people of Skypiea are ignorant in seeing the Upper Yard as only a land of Vearth. He stated that the Straw Hats, his crew and the Shandia all seek the City of Gold.\nAfter his discussion with Gan Fall, Enel left saying he is also a partaker in the final game and responded to Gan Fall's inquiry about his Divine Squad leaving Enel's forced labor as \"something only God knows\". At that moment, Hotori and Kotori, both of whom are brothers of Satori, appeared with the intention of avenging their brother's death. While still engaged in their battle, Luffy tells Wyper that cannons and rifles will not work on him. Wyper, seeing the statement as being true adds a Flavor Dial and his weapon becomes the Burn Bazooka. Luffy and Wyper battle for some time and eventually throw each other off after both launching a Bazooka-like attack on each other. Wyper thought it would be better not to kill Luffy and save his energy to kill Enel. Just as Luffy answers him, Luffy is swallowed by the Giant Python, leaving Wyper to wonder where Luffy had gone.\nGenbo and the Divine Soldiers battle and he easily overwhelms them. Yama then appears before Genbo. Genbo shoots an iron cannonball at Yama, which he dodges and kicks the iron cannonball back and damages Genbo. Genbo, refusing to be defeated, makes Yama launch the Ten-Fold Axe: Axe Mountain attack on Genbo and defeats him.\nWhile on the Going Merry, Nami and Gan Fall prepare for their battle with Kotori and Hotori. Luffy finds himself in an unidentifiable location. Chopper is still searching the ruins for the rest of the exploration crew where he comes in contact with Gedatsu.\n",
  "characters": [
    "Usopp",
    "Sanji (K.O)",
    "Nami",
    "Gan Fall",
    "Enel",
    "Pierre",
    "Hotori and Kotori",
    "Wyper",
    "Monkey D. Luffy",
    "Nola",
    "Genbo",
    "Yama",
    "Satori (flashback)",
    "Tony Tony Chopper",
    "Gedatsu",
    "Nico Robin (Photo)",
    "Roronoa Zoro (Photo)"
  ],
  "ssum_frequencies": [
    [
      "and",
      4
    ],
    [
      "he",
      3
    ],
    [
      "after",
      2
    ],
    [
      "some",
      2
    ],
    [
      "the",
      2
    ],
    [
      "luffy",
      1
    ],
    [
      "fights",
      1
    ],
    [
      "wyper",
      1
    ],
    [
      "but",
      1
    ],
    [
      "time",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      21
    ],
    [
      "and",
      18
    ],
    [
      "that",
      11
    ],
    [
      "he",
      11
    ],
    [
      "of",
      8
    ],
    [
      "his",
      8
    ],
    [
      "luffy",
      7
    ],
    [
      "on",
      6
    ],
    [
      "to",
      6
    ],
    [
      "enel",
      6
    ],
    [
      "genbo",
      6
    ],
    [
      "with",
      5
    ],
    [
      "gan",
      5
    ],
    [
      "in",
      5
    ],
    [
      "wyper",
      5
    ],
    [
      "usopp",
      4
    ],
    [
      "at",
      4
    ],
    [
      "him",
      4
    ],
    [
      "fall",
      4
    ],
    [
      "for",
      4
    ]
  ]
}