{
  "chapter_number": "Episode 164",
  "title": "Light the Fire of Shandora! Wyper the Warrior",
  "short_summary": "Chopper is saved by a bunch of giant South Birds, who tell him that Gan Fall was actually God. Nami, Zoro, and Nico Robin discover the reason why Upper Yard is a soil island: it was once part of Jaya, and this is the part that Liar Mont Blanc Noland saw. Meanwhile, the Shandia attack Upper Yard.\n",
  "long_summary": "Wyper discusses with the other Shandia warriors about Gan Fall entering Upper Yard, they thought that Gan Fall did not come to fight Enel for his position as God but for another reason. Aisa uses her Mantra abilities unknowingly seeing Satori lose, this frightens her making her scream during the Shandia meeting. Aisa tells Wyper that two voices disappeared, they assumed that Gan Fall and Shura killed each other and think that it is now the best time to attack Enel. Aisa tells Raki that Gan Fall did not defeat one of the priests but another group of people.\nThe kick that Sanji delivered to Satori knocked him out. Usopp tells Luffy and Sanji that they have to run to catch their boat. Usopp uses Usopp AAaaaAAAaaaAA to catch the boat, but the three Straw Hats smash into several trees making them almost unconscious once arriving back on the boat.\nAt the Sacrificial Altar, Chopper failed to save Gan Fall forgetting that he cannot swim. With Chopper and Pierre both being Devil Fruit users and Gan Fall unconscious, it seemed to be the end, but a mysterious bird came and saved them. Meanwhile, Gedatsu, Ohm, and Shura all know that Satori has been defeated, and they also sense that Upper Yard is under attack by the Shandia.\nNami sees something in the distance and cannot believe what she saw, so she aims to go to the seashore. Robin feels the same as Nami and thinks that her life long dream is not so far away. Chopper wakes up to realize that he is still alive along with Gan Fall and Pierre, but a flock of birds appear and scare Chopper. Zoro, Nami and Robin are close to the seashore, but they hear a battle cry and explosion in the distance. Nami runs ahead to see if what she saw was true; Upper Yard was once a part of Jaya and that the building she saw was the other half of Noland's house.\nChopper was amazed to see huge South Birds and was told they saved him. The birds also told him Gan Fall was the former God.\n"
}