{
  "chapter_number": "Episode 245",
  "title": "Come Back, Robin! The Confrontation with CP9",
  "short_summary": "Luffy and the others request that Robin come back to the crew. She refuses and tells them that she cannot accomplish her \"wish\" if she were to stay with them. Robin turns to leave while Luffy tries to get her, but the CP9 hold the pirates back. Robin successfully escapes, and Lucci shows those remaining his \"transformation\".\n",
  "long_summary": "Paulie is still in shock that the people he thought were his friends, Rob Lucci, Kaku, Kalifa, and Blueno, are actually with a secret organization known as CP9.\nLuffy recognizes them from the shipyard and Zoro remembers Kaku as the one who inspected the Going Merry. Nami says that the attack on Iceburg was an inside job but Chopper is still confused. Lucci informs Paulie that they work for the World Government and threatens to attack Iceburg. Paulie, furious, uses Rope Action Pipe Hitch Knives toward Lucci but the CP9 agent uses Soru to dodge the attack and then takes Paulie down using Shigan. Paulie falls to his knees and Lucci explains how he and the other CP9 agents master an art known as Rokushiki that turns the human body into a living weapon. Paulie briefly remembers how he hanged around with Lucci, Blueno, Kalifa, and Kaku in the past and still doesn't understand why they would do this. Lucci attempts to attack Paulie but Luffy intervenes with a kick but Lucci simply blocks it. Luffy then uses Gomu Gomu no Gatling on Lucci but he blocks it using Tekkai suffering no damage. Lucci, finding Luffy to be a pest, uses Soru to get in closer and then uses Shigan on Luffy's neck. Fortunately, Luffy's ability prevents him from suffering a fatal wound but gets send crashing backwards. Luffy then grabs Paulie much to Lucci's surprise. Luffy then says that he made a promise to beat up the guys that tried to kill Iceburg but then turns to Robin and asks why she is doing this. Robin says she did it to make her wish come true and continues saying she'll make any sacrifice. Zoro speaks up saying that also involves blaming her former crew for murder and Iceburg suddenly speaks up saying Robin has no right to do this. Annoyed, Robin uses her ability to pin down Iceburg and says that nobody is going to get in her way.\nLuffy still doesn't want to believe what she is saying with Chopper wondering what happened to her. Lucci walks between them and says that they have an appointment with an important individual saying they're finished with the Straw Hat Pirates. Lucci suddenly asks Kalifa how much time it's left and Kalifa says two minutes. Lucci then informs everyone that the building will be engulfed by fire as fire is the best way to wipe away evidence much to the other's shock. However, Lucci plans on not having the Straw Hats, Paulie, or Iceburg leave alive and the CP9 agents start to close in. Zoro says that it's them against the CP9 agents and that Robin has sided with them but Luffy doesn't want to accept that. One minute remains before the fire goes off and Robin says she'll take her leave. Lucci informs her she did a great job but her former crewmates still ask her to come back. Robin is about to leave through the window and Iceburg tells Luffy not to let her get away. Luffy charges in but Blueno gets in his way. Luffy answers with a kick but Blueno uses Tekkai to block the attack. Luffy is shocked that he hasn't been injured by the attack and Blueno explains that he and the other CP9 agents have trained their bodies to be as hard as an iron wall. Luffy fires a Gomu Gomu no Gatling but Blueno dodges all of the attacks using Kami-e. Luffy notices Robin getting away and stops his attack to chase after her but Blueno once again gets in his way. Luffy uses Gomu Gomu no Pistol but Blueno dodges it using Soru and gets behind Luffy. Luffy attempts to attack him again but Blueno gets away using Geppo. Suddenly, Kalifa and Kaku appear behind Luffy and they both use Rankyaku on him sending him backwards. Zoro tells Nami and Chopper to duck out of the way which they do and Luffy is sent flying into the hallway. Zoro charges in but Kaku blocks the Pirate Hunter's swords with swords on his own. Zoro asks Kaku that he lied about the Going Merry's condition but Kaku said that he was correct at his assessment. The two swordsmen go at it and Luffy charges after Robin on Zoro's orders. However, Kaku uses Shigan several times on Zoro knocking the swordsman down while Luffy is caught by Lucci. Lucci then tells Robin to go and Robin makes her escape by jumping out the window. Lucci tosses Luffy down and the others remark how strong the CP9 agents are. Lucci says that they use their skills to hone for absolute justice and says that it's why they are one of the World Government's most elite fighters. Lucci then starts to transform into a large being completely shocking everybody.\n"
}