{
  "chapter_number": "Episode 12",
  "title": "Battle! The Blackcat Pirate Crew. Battle on the Slope!",
  "short_summary": "The crew prepare for the incoming attack by defending the southern coast, but the enemy pirates instead enter from the north. They arrive just in time to face the attack, and they fight to prevent the Black Cat Pirates from entering the village.\n",
  "long_summary": "The crew prepare for the incoming attack. As the only entrance to the village is a single sloped path at the island's south end, they stand guard at the pathway to prevent the Black Cat Pirates from entering. They cover the slope with slippery oil to prevent them from walking up the path.\nKuro, still disguised as Klahadore, returns to Kaya's mansion, where Kaya is already asleep and Merry tending to his duties. Kuro finds a gift Kaya got for him, a pair of glasses custom-made for him so they would not slip off his nose. Kuro destroys the pair of glasses, revealing his true self to Merry. Revealing a set of long blades attached to his fingers like cat claws, he slices Merry down before heading to Kaya's bedroom to watch her sleep.\nMorning arrives and as planned, the Black Cat Pirates led by Jango dock at the island. However, Usopp forgets that there is a second entrance to the village at the island's north end, through which the Black Cat Pirates decided to use instead. Nami, Luffy and Usopp rush to the north end, whereas Zoro is trapped by the south entrace's slippery slope. As Zoro continues to struggle to climb the slope, Luffy gets lost while attempting to reach the north coast.\nArriving at the north end and using his slingshot, Usopp strikes down many of the advancing Black Cat Pirates. Usopp attempts to bribe the pirates away using the treasures on the crew's ship, but Nami arrives and stops them. Undeterred, the Black Pirates continue their advances onto the island, and Nami and Usopp are unable to stop them. However, Luffy and Zoro arrive just in time to stop them.\nKuro notices his crew is late entering the village. He decides to personally head down to the north coast, vowing to kill his entire crew if his plan were to go wrong.\n",
  "characters": [
    "Usopp",
    "Kaya",
    "Merry",
    "Nami",
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Kuro",
    "Jango",
    "Ninjin",
    "Piiman",
    "Tamanegi"
  ],
  "ssum_frequencies": [
    [
      "the",
      8
    ],
    [
      "attack",
      2
    ],
    [
      "pirates",
      2
    ],
    [
      "from",
      2
    ],
    [
      "they",
      2
    ],
    [
      "to",
      2
    ],
    [
      "crew",
      1
    ],
    [
      "prepare",
      1
    ],
    [
      "for",
      1
    ],
    [
      "incoming",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      28
    ],
    [
      "to",
      22
    ],
    [
      "and",
      8
    ],
    [
      "his",
      8
    ],
    [
      "pirates",
      6
    ],
    [
      "is",
      5
    ],
    [
      "a",
      5
    ],
    [
      "at",
      5
    ],
    [
      "black",
      5
    ],
    [
      "cat",
      5
    ],
    [
      "usopp",
      5
    ],
    [
      "north",
      5
    ],
    [
      "as",
      4
    ],
    [
      "end",
      4
    ],
    [
      "them",
      4
    ],
    [
      "kuro",
      4
    ],
    [
      "of",
      4
    ],
    [
      "crew",
      3
    ],
    [
      "for",
      3
    ],
    [
      "village",
      3
    ]
  ]
}