{
  "chapter_number": "Episode 257",
  "title": "Smash the Wave! Luffy and Zoro, The Strongest Combo!",
  "short_summary": "Luffy and Zoro perform a move that acts similar to a cannon and blasts a hole through the wall of the tidal wave ahead of them, opening up a channel for them to pass through. They miraculously pass through unscathed, and the passengers rejoice. Sanji contacts the rest of the crew and fills them in on his current situation. Usopp separates from them but later, when Sanji and Franky are spotted, a man named Sogeking comes to their rescue.\n",
  "long_summary": "A large wave of Aqua Laguna is about to hit Rocketman and Kokoro asks how everyone else is going to take care of it. Zambai orders the Franky Family to grab cannons and fire at the large wave as it's just water. Suddenly, Nami gets a call from her Baby Den Den Mushi knowing it's Sanji calling. On the Sea Train Puffing Tom, some Marines are looking over their fallen comrades. T Bone can be seen now and asks a Marine how he got an injury on his arm. The Marine says he got bit by a bug earlier and T Bone wraps up the wound using a piece from his cape. T Bone then says that peace and kindness will reign while the Marines are freaked out by his face. Another Marine barges in and tells T Bone that the officials of cars 6 and 7 have been taken out and that the two criminals have escaped. T Bone is shocked to hear this and tells the Marine to help the injured spread the news to the other cars.\nOn top of Puffing Tom, Sanji can be seen talking to Nami. Sanji tells Nami that he has bad news that things have gotten complicated. Nami wants to know what he means but overhears something in the background (as Usopp and Franky are messing around) and Sanji says it's nothing. Back in the Rocketman, Paulie, Peepley Lulu, Tilestone, and the Franky Family are seen firing cannons at the large wave which doesn't have any effect. Zambai suddenly speaks up saying that the Franky Family Special Cannon will do the job. However, even the large cannon fails to put a dent into the Aqua Laguna but still orders the cannons to fire. Kokoro then speaks up saying that the railway will rise up but not enough to go over the wave. Chopper is worried that they are going to die and Kokoro says it's possible. Nami continues to talk with Sanji knowing Robin hasn't been saved yet. Nami is ready to tell Sanji why Robin did what she did before silencing Chopper, Chimney, and Gonbe. The others are worried about dying but still continue to fire cannons. Zoro then speaks to Luffy and Luffy knows what Zoro is thinking ready to fight the wave. Luffy and Zoro step outside and they both face the wave preparing to fight. Luffy then asks Zoro what's \"108 times 2\" and Zoro replies \"216\". Luffy thinks it's too long and he wants to round it to another number. Zoro suggests \"300\" and Luffy agrees. Luffy and Zoro prepare to launch an attack onto Aqua Laguna.\nLuffy and Zoro launch a very powerful team attack (Gomu Gomu no Sanbyaku Pound Cannon) and the attack tears a hole straight through the large wave. Rocketman manages to speed through the hole on the railway and the entire group successfully make it past Aqua Laguna. Everyone is impressed by Luffy and Zoro's feat of strength. Luffy makes it inside with Zoro accidentally landing on him. Nami suddenly calls Luffy over saying Sanji wants to talk. Luffy asks if Sanji has saved Robin yet and Sanji says he is still working on doing that. Sanji then tells Luffy that he was informed by Nami on why Robin surrendered and Luffy tells Sanji to \"give them hell\". Zoro speaks up saying that Sanji will die and tells Sanji to wait until everyone else has caught up but Luffy suddenly stops Zoro saying what would he do in Sanji's cause. Zoro looks away silently (knowing he will do the same) and Luffy tells Sanji to go save Robin. Sanji is surprised that Zoro is worried about him but Zoro angrily tells Sanji that he hope he gets killed. Sanji says he will fight to free Robin and crushes the phone. Franky is upset saying he wanted to speak with Luffy but Sanji just tells him to \"deal with it\". Nami wishes for Sanji's safety while Luffy wants Rocketman to go even faster despite Kokoro saying Rocketman is already at top speed.\nBack on the Puffing Tom, Usopp is talking about how much things have changed since he left the crew. Sanji is upset that while they were fighting among themselves, Robin surrendered to the World Government so that the crew will be safe, including Usopp (even though he left the crew at that time). Franky is crying to hear such a sad story much to Sanji's disdain. Franky thought Robin was evil but now knows that deep down, she is kind. Sanji says he has to save Robin and Franky agrees to help him out. Franky tells Usopp to help out as well but Usopp says he isn't coming. Usopp says that, even though he feels bad for Robin, he isn't a part of the Straw Hat Pirates anymore and shouldn't get involved in saving her. Usopp then walks off with Franky yelling at him to talk it over. Sanji tells Franky to leave him much to Franky's annoyance. In the train cars, T Bone and the Marines are trying to look for the missing criminals. One Marine asks Wanze to help out but the cook angrily tells him to leave while Nero is also informed on the escape. One Marine notices the window is open and looks up to find Sanji and Franky up there. Suddenly, the Marine is shot into the water and Sanji and Franky turn to the shooter wanting to know who he is. The man says he has come to help out and introduces himself as Sogeking (who is really just Usopp in disguise).\n"
}