{
  "chapter_number": "Episode 297",
  "title": "Hunter Sanji Appears? Elegy to the Lying Wolf",
  "short_summary": "Sogeking gets beaten up by Jabra and is saved at the last second by Sanji, who then fights Jabra. While Zoro and Kaku continue their fight, Franky tries to catch up with Robin.\n",
  "long_summary": "Franky manages to get Tony Tony Chopper out of the sea and has completely returned back to normal. Chopper, who is unconscious, gets the water blown out of him by Franky. As he is doing so, he is interrupted by Chimney and Gonbe who lets him know that they know how to get to the Gates of Justice. They head over to the gates, finding Kokoro there. Kokoro informs them that Chopper is okay, but still unconscious After realizing that Nico Robin is still in danger, Franky runs off.\nRoronoa Zoro continues fighting Kaku after being freed from his handcuffs. Usopp and Nami watch without knowing Jabra was with them watching Zoro and Kaku fight. Usopp, offers to fight Jabra, but Jabra declines and drops the key for Usopp to take. Usopp, falling for his tricks tries to pick up the key but is blown away by an attack from Jabra. Nami runs over to the injured Usopp and sees if he is alright. Usopp tries to attack Jabra, and it seems to have hit him, but Jabra appears right behind Usopp, strikes him, and hits him with a barrage-like attack. Nami runs towards them trying to help, but is blown out by Jabra. He threatens to kill Usopp and almost succeeds, but is then kicked away by Sanji, sending him flying towards the wall. Sanji then informs the others that the Gates of Justice were opening.\nThe fight between Rob Lucci and Monkey D. Luffy continues, with Luffy being frustrated he cannot get past Lucci. Luffy is thrown at crates when trying to attack Lucci who but blocks all of his attacks. Luffy confidently stands back up, despite being exhausted. Robin is dragged up the stairs by Spandam by her hair, who wants to get Robin to the Gates of Justice as quickly has possible, before anyone caches up to him. Franky continues running down the hall to the Gates of Justice, hoping that both of the keys he has will free Robin before she gets to the Gates of Justice. Behind them, Chimney follows him painting arrows down the hall. Gonbe, Kokoro, and Chopper follow them with Chopper tied to Kokoro's back. The fight between Zoro and Kaku intensifies with both of them blowing consecutive attacks at each other. Marines, desperately trying to get off Enies Lobby, fill up the Puffing Tom and the rest have to find another way out. The Franky Family gets freed by Paulie, and try to escape. The Marine Battleships depart for Enies Lobby. Sanji gets ready to fight Jabra to get his key. Sanji also encouraged Usopp to get Robin back.\n"
}