{
  "chapter_number": "Episode 180",
  "title": "Battle in the Ancient Ruins! God Enel's Desire!!",
  "short_summary": "Enel counterattacks Gan Fall and lands a finishing hit. He then knocks out Nico Robin as she tries to manipulate him. Zoro impresses Enel with his power but is easily beaten while trying to make him pay for what he did to Robin; it takes Wyper with a secret weapon to take Enel down.\n",
  "long_summary": "Three Skypiean children are shown playing and come by Conis' house when one of the children commented on how nice Conis and Pagaya were. The second child says he heard they were evil because they helped the Blue Sea Dwellers escape and disobeyed God. One of the children comments that his father is in God's army and he had never seen his father before. The others praise him saying his dad is great for serving God. Conis is on her way to warn the Skypieans of the message she received not wanting the enforcers action to go in vain.\nEnel laughs after hearing that he would be the one to disappear instead. Gan Fall inquires of his Enforcers and Enel's intention. Enel replies stating \"ascension\". He then goes on to tell Gan Fall that he is leaving Skypiea and intends to return to where God dwells calling the place Fairy Vearth, a limitless amount of land. Enel further tells them that everything has its rightful place, further stating his intention of killing every Skypiean. Gan Fall becomes angered and tells Enel that \"God\" is only a title given to the Governor of Skypiea. Enel states that was so until present and tells Gan Fall that he did something unpleasant to Gan Fall's enforcers. Enel explains to Gan Fall why his enforcers perished and Gan Fall flies into rage and attacks Enel. He remembers his distress towards coming to a compromise with the Shandia and how Enel came to take over his office. Enel then attacks Gan Fall using the 20,000,000 Volts: Vari.\nEnel upon defeating Gan Fall, invites the remaining five to join him and embark to Fairy Vearth. Robin then asks if they refused, then what happens. Enel replies saying he decided already. Robin tells Enel if he destroys the island, what he seeks would be destroyed as well. However, Enel tells her the Golden Bell is accounted for. By following Robin's deductions, Enel is able to point out that the Shandorian Golden Belfry Bell is located at the top of the Giant Jack. He then shoots a lightening bolt to Robin for trying to manipulate him using her information. Zoro jumps in and catches Robin. Upset, Zoro goes on to attack Enel and Wyper shoots a Burn Bazooka at Enel, which he counters using Kari. He mentions that they were getting fussy just right before they embarked to Fairy Vearth. Zoro, filled with anger asks Enel when he decides to go with and went on to attack him. However, Enel overpowers and defeats Zoro.\nWyper uses the opportunity and grabs onto Enel. He has Seastone bandaged to his left arm and uses it to weaken Enel's strength. Enel asks if Wyper wants Vearth and Wyper responds that what he desired was death; thereby killing Enel and himself. He pays no attention to Enel's reason and goes on to attack Enel using his Reject Dial. Enel falls to the ground, unconscious.\n",
  "characters": [
    "Mochi",
    "Conis",
    "Pagaya (fantasy)",
    "Su  (fantasy)",
    "Moyle (flashback)",
    "Enel",
    "Nico Robin",
    "Roronoa Zoro",
    "Wyper",
    "Gan Fall",
    "Nami",
    "Kamakiri (flashback)",
    "Raki (flashback)",
    "Braham (flashback)",
    "Genbo (flashback)",
    "Pierre (flashback)",
    "Satori (flashback)",
    "Ohm (flashback)",
    "Gedatsu (flashback)",
    "Shura (flashback)",
    "Tony Tony Chopper (K.O)",
    "Monkey D. Luffy (Intro voice only.)"
  ],
  "ssum_frequencies": [
    [
      "to",
      4
    ],
    [
      "enel",
      3
    ],
    [
      "a",
      2
    ],
    [
      "he",
      2
    ],
    [
      "robin",
      2
    ],
    [
      "him",
      2
    ],
    [
      "with",
      2
    ],
    [
      "counterattacks",
      1
    ],
    [
      "gan",
      1
    ],
    [
      "fall",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      25
    ],
    [
      "enel",
      23
    ],
    [
      "and",
      21
    ],
    [
      "the",
      21
    ],
    [
      "he",
      17
    ],
    [
      "that",
      10
    ],
    [
      "his",
      10
    ],
    [
      "gan",
      9
    ],
    [
      "of",
      8
    ],
    [
      "is",
      8
    ],
    [
      "fall",
      8
    ],
    [
      "on",
      6
    ],
    [
      "they",
      5
    ],
    [
      "then",
      5
    ],
    [
      "a",
      5
    ],
    [
      "tells",
      5
    ],
    [
      "god",
      4
    ],
    [
      "him",
      4
    ],
    [
      "enforcers",
      4
    ],
    [
      "vearth",
      4
    ]
  ]
}