{
  "chapter_number": "Episode 233",
  "title": "The Pirate Kidnapping Incident and the Pirate Ship Waits for Death!",
  "short_summary": "Luffy refuses to believe that Galley-La Company cannot repair the Going Merry. The two soon realize that not only is Usopp missing now, but that the two briefcases that were returned to them are empty! Nami decides to head to the Franky House and finds Usopp on the way in a pitiful state. As she heads back to the ship for help, Usopp goes to the Franky House himself.\n",
  "long_summary": "The episode starts off with Sanji and Chopper sailing back to the merry after failing to find Robin. Sanji questions if Robin not returning has something to do with what Aokiji told them about Robin. They agree if she's ok she will eventually turn up at the Going Merry.\nThe episode shifts to Luffy and Nami who learn that the Merry is irreparable. Luffy and Nami refuse to accept it but they are informed that the \"keel\" of the ship has been damaged too bad to be repaired. (The keel is the bottom part of the boat; it holds the boat together and is basically its backbone.) Luffy and Nami ask if they can build an exact replica, but the carpenters say it's impossible because of the differences in wood type and material across islands. They will need an entirely new ship.\nGovernment officials show up to talk to Iceberg while Nami and Luffy hide. While carrying the suitcases Luffy realizes two are lighter. They open them up and see that 200 million beri is gone. Luffy swears to find the money and runs off in an unknown direction. Nami meanwhile asks where the Franky hideout is and heads in that direction.\nOne the way to the Franky hideout, Nami finds Usopp. It appears he has been beaten up and left on the sidewalk. He cries that he is the one responsible for letting the money slip away and is worried about facing the crew after screwing up. Nami tells him the hideout isn't far away and tells him to stay put. She has to return the money to the Merry first before getting Usopp help. The scene cuts to the Franky family celebrating such a big heist. As they celebrate the door blows up, and behind it is Usopp with his sling shot.\n"
}