{
  "chapter_number": "Episode 68",
  "title": "Try Hard, Koby! Diary of Koby-Meppo's Marine Struggles",
  "short_summary": "Luffy suddenly remembers about Koby and the scene goes to Helmeppo and Koby's hardships. The Marines are about to hand over Morgan to Vice Admiral Garp, but he escapes because of the two of them. Instead of being dismissed, Koby and Helmeppo go with Garp and he takes them to the Marine Headquarters in the Grand Line.\n",
  "long_summary": "The Going Merry suddenly stops because the wind ceases to propel its sail. Vivi comments that time is running as they speak. Luffy interrupts Nami to exclaim it is time to fish and Karoo seems to like the idea. Sanji asks if anyone has seen the bait and Luffy responds he ate the stuff in there while pointing at the bucket with his eyes. Sanji points they were bugs while Luffy grabs the last one with only two of his fingers. While he has the bug halfway in his mouth, he says they taste good. Sanji adds that they cannot fish now since he ate the bait. Luffy brings out an object and says they can use it for bait, but Sanji replies that you cannot catch anything with that. Luffy points at Karoo and asks what about him, Sanji answers that it sounds okay. Luffy and Sanji start chasing Karoo around the mast while Nami and Vivi watch. Suddenly, they step on Zoro's forehead while he is asleep. Zoro consequently gets mad. Nami gets angry and Sanji comments that she is lovely when she gets angry. Nami remembers all the big names Luffy has beaten because Vivi thinks it is strange that he has a 30,000,000 bounty. Nami mentions that Luffy defeated Arlong, Pirate Fleet Commodore Don Krieg, and Captain Kuro. Zoro then adds that she forgot someone and Nami speaks the name of Axe-Hand Morgan. Upon mentioning his name, Luffy remembers about Koby and the sail catches wind. Then, Luffy states (after Nami asks) that \"he\" is his friend. The scene goes to a town with 3 Marine ships and Koby commandeering them. Then he starts telling Luffy that he has achieved his dream of becoming a Sub-Lieutenant. Suddenly, a gigantic watery Morgan emerges from the ocean and is about to chop Koby with his axe when another gigantic Luffy stops Morgan's arm. Luffy throws the giant Morgan and the view starts to shine with glitter. Then Koby faints and the scene goes to reality where Koby fells above Helmeppo (who is sleeping below him) and wakes him up.\nHelmeppo gets mad and everybody that was asleep get angry because they were so noisy. Koby is a chore boy along with Helmeppo. A Marine soldier tells them that they enlisted without any qualifications resulting in them being chore boys. Ironically, Koby is still enthusiastic in doing whatever he can while Helmeppo gets mad at Koby for volunteering to more jobs and slacking at doing the chores. They go outside to clean windows and Helmeppo as usual is slacking again remembering his old days when Morgan was still a captain. It is clearly seen in the flashback that Helmeppo greatly depended on Morgan's terror because when he spilled his own cocoa, he scolded the soldiers and made reminded them of his father. He then thought that him being a chore boy was Luffy's fault as he stripped his dad's position. Koby told Helmeppo that blaming someone will not change anything even your fate. He told Helmeppo that that is a sign of being weak also emphasizing his reliance to his dad. When Koby told Helmeppo his dream about being a Marine officer, Helmeppo disbelieved telling him that is impossible but Koby said he will still do it when he saw how Luffy lived his life and risk his life accomplishing it. They fought on the roof about the probability of their dreams and their cooperation and some Marine soldiers gathered around the building. They suddenly fell and landed on crates and a cannon beside the crates turned around and shot its cannonball hitting a building destroying it. As punishment, they will not get any money for 50 years and they went to eat where Rika and her mom's store. They say that they escaped from them. Rika brings out a newspaper telling Luffy escaping from Smoker and from Loguetown and Koby discovers that he has reached the Grand Line.\nIn ship, Marine soldiers are guarding Morgan as he is going to a trial. Helmeppo and Koby are on the ship and upon seeing him, both of them get scared. The captain tells them that their mission is to escort him to give him to Vice Admiral Garp's custody so he will go for a court trial. Helmeppo and Koby are cleaning swords and cannonballs and Helmeppo tells Koby that he respected his father. Helmeppo says he wants to be like his father, but he knows he went too far, abusing his position. Helmeppo starts crying and wonders why he is crying. He asks Koby if his dad will be executed leaving Koby unable to answer. Garp's ship finally arrives and Helmeppo and Koby go out to see him. Garp is wearing his dog hat. When they give Morgan to Garp's custody, Garp briefly falls asleep. The captain shouts at him but he shouts back telling him he can hear him. He says he has not slept for 5 days and that he has reached a new record of doughnuts, having eaten 842 without stopping. Garp falls asleep again but Morgan slashes him and he breaks his chains, getting Helmeppo as a hostage. He says that he does not need a son and that he just wants freedom. Morgan sails with a small boat still holding Helmeppo and the soldiers are prepared to fire a cannon. Koby stands in front of the cannon and stops them from shooting. He tells them his friend is in the boat. He swims in order to reach the small boat and Garp wakes up as if nothing has happened. He yawns stretching his arms. He puts down his hand smashing the cannon and tells them that the commotion wake him up. When someone tells him they thought he was killed, Garp understands that someone (not him) was killed and he must have missed it while sleeping. He asks where the victim is, and upon realization, he looks at his slashed chest and jokingly tells them it was him. Morgan commands Helmeppo to turn dues west and Helmeppo refuses as he cannot take it anymore. Helmeppo says he will arrest Morgan, but Morgan punches him and asks if he knows who he is talking to. He asks what can he do alone and Koby climbs up the ship, letting him know he is not alone. Koby tells Morgan to come along quietly as he will \"arrest\" Morgan too.\nGarp looks at them through binoculars while eating a doughnut. The boys are easily defeated. As they are fighting Morgan, Morgan grabs Koby and gets ready to hit him. As he is about to hit him, he throws the two away instead, as they are not worth killing. Helmeppo says he will let Morgan escape today, but someday, they will cross paths again and he will surely capture him on that day. When they get back to the ship, the Marine soldiers apologize because they had let the criminal escape and it was due to their negligence of not stopping Koby. The captain says they will dismiss the two of them because of their actions. Garp says he has no choice but to tell them to go with him to Marine Headquarters and tells them if they do not like it, they can run away. With that, Koby and Helmeppo sail with Garp and now headed to where Luffy is, the Grand Line.\n"
}