{
  "chapter_number": "Episode 129",
  "title": "Everything Began That Day! Vivi Tells of her Adventures!",
  "short_summary": "Vivi decides to stay behind in Alubarna and the Straw Hats indicate that they still consider Vivi a friend while Bon Kurei helps the Straw Hats escape Hina the Black Cage.\n",
  "long_summary": "Igaram, overcome by his worry of Vivi joining the Straw Hats pirate crew, dreamed that she declared wanting to be the pirate queen. Upon awakening, he went right away to Vivi's room. Vivi was in her room getting dressed for her speech with the help of Terracotta and Terracotta sent him out. Igaram and Chaka are then seen discussing about the battle between the Straw Hats and the marines ongoing at the harbor and lamenting that they unfortunately cannot help the crew.\nThe Marines and the Straw Hats have begun battle and the Marines are attempting to sink the Going Merry, leaving the crew in a pinch. Luffy recognized Jango and questioned why he was a marine with Jango answering that he has his own reasons. Sanji, on the other hand, commented that the man next to Jango appeared familiar. Fullbody commented that Sanji and his crew will meet their doom on that day since he's powered up. Usopp went to the cannon launcher and launched a cannon at Jango which destroyed the ship he was on as well as the ship Fullbody was on. Luffy then praised Usopp's marksmanship, saying it was awesome. Bon Kurei told them to escape after those two ships were destroyed and received word that Hina the Black Cage had arrived. He explained that Black Cage Hina is the Marine Headquarters captain that patrolled that area. Bon Kurei questioned why the Straw Hats would not escape and Nami told him about the promise they made with Luffy adding that it was so they could meet a friend.\nCobra and Igaram visit Vivi and she announced she would like to tell them something very important. With his disguise ability, Bon Kurei fooled the marines into pursuing him, allowing the Straw Hats to escape. Bon Kurei recited his Okama Way poem and prepared to engage the marines in battle. Upon witnessing what was unfolding between Bon Kurei's crew and the marines, the Straw Hats cried and swore never to forget them. A flashback as to how Igaram and Vivi found out the instigator in the country's unrest was visited. Another crew of marine ships attacked the Straw Hats again but were overwhelmed. Vivi began her speech which was secretly about her travel with the Straw Hats. On hearing the speech, Zoro and Sanji told Luffy that they had to leave since it appeared Vivi was not coming. Moreover, they were under attack again by another crew of marine ships. The country's people who came to watch Vivi give her speech realized Igaram's attempt to disguise as Vivi and yelled for him to step down.\nVivi made it to the harbor and found the Straw Hat crew waiting as promised. Vivi told them she came to say good-bye and she would be staying behind. She however, asked, if they ever meet again, would they consider her as part of their family? Luffy was about to give her a verbal answer when Nami shut him up. She told him the Marines have seen Vivi and responding verbally would make them consider her as part of them; thus making her into a criminal. So, to give a silent answer and goodbye, the Straw Hats rose their left arm with the cross mark on it as proof that they consider her one of them. Vivi and Karoo also rose their left arm at the shore, indicating their friendship.\n"
}