{
  "chapter_number": "Episode 162",
  "title": "Chopper's in Danger! Former God vs Priest Shura",
  "short_summary": "Chopper, threatened by priest Shura, blows the whistle for Gan Fall to come, but before he can arrive, Priest Shura assaults Chopper and begins destroying the Going Merry with fire that comes out of his spear. Meanwhile, Zoro, Nami, and Robin continue their exploration of the forest.\n",
  "long_summary": "Gan Fall has brought Pagaya and Conis to his home to protect them since Enel's Mantra cannot reach his home. Gan Fall goes on to indicate that it is a possibility that Luffy and his friends are people known as pirates in the Blue Sea. He tells them that Luffy and his friends are probably outside the law and how is that different from Conis and her father currently. He went on to reiterate that they are also in war with the Shandia and he was working on a peace treaty before Enel took his divine seat. Gan Fall tells of how the war will end when they hear the beautiful music resonate again, which initially lead to the start of the war.\nPierre heard the whistle go off and Gan Fall left right away to Chopper's aid. Shura and Fuza have already begun their attack on the Going Merry. Chopper is easily overwhelmed by Shura and Fuza. Nami continues to fall into perils of being attacked by sky sharks and is continuously saved by Zoro and Robin. Shura continues his attack on Chopper and is upset that Chopper neither wants to die, have his friends hurt, or the ship destroyed, yet Chopper is too weak at fighting. Shura went on to tell Chopper that since some of the people brought for the sacrifice escaped, he has to die in their stead and his death will weigh on them in realizing their mistakes. Just as he was about to kill Chopper, Gan Fall arrived and began battle with Shura.\nLuffy has regained consciousness from the attack by Satori and Satori is about to launch another powerful attack on him.\n",
  "characters": [
    "Conis",
    "Pagaya",
    "Gan Fall",
    "Su",
    "Pierre",
    "McKinley (fantasy)",
    "Shandia (fantasy)",
    "Tony Tony Chopper",
    "Shura",
    "Fuza",
    "Aisa",
    "Nico Robin",
    "Nami",
    "Roronoa Zoro",
    "Sanji",
    "Usopp",
    "Monkey D. Luffy",
    "Satori"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "chopper",
      2
    ],
    [
      "priest",
      2
    ],
    [
      "shura",
      2
    ],
    [
      "and",
      2
    ],
    [
      "of",
      2
    ],
    [
      "threatened",
      1
    ],
    [
      "by",
      1
    ],
    [
      "blows",
      1
    ],
    [
      "whistle",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "and",
      15
    ],
    [
      "the",
      13
    ],
    [
      "to",
      12
    ],
    [
      "his",
      8
    ],
    [
      "on",
      8
    ],
    [
      "that",
      7
    ],
    [
      "is",
      7
    ],
    [
      "fall",
      6
    ],
    [
      "chopper",
      6
    ],
    [
      "gan",
      5
    ],
    [
      "he",
      5
    ],
    [
      "shura",
      5
    ],
    [
      "in",
      4
    ],
    [
      "of",
      4
    ],
    [
      "attack",
      4
    ],
    [
      "by",
      4
    ],
    [
      "has",
      3
    ],
    [
      "them",
      3
    ],
    [
      "luffy",
      3
    ],
    [
      "friends",
      3
    ]
  ]
}