{
  "chapter_number": "Episode 125",
  "title": "Magnificent Wings! My Name is Pell, Guardian Spirit of the Kingdom",
  "short_summary": "Vivi finds the bomb inside of the clock tower, but Mr. 7 and Miss Father's Day of Baroque Works are there to protect it. Vivi defeats the pair, but realizes the bomb cannot be stopped so easily as it has a timer. Pell comes and takes the bomb to the sky and sacrifices his life for his country.\n",
  "long_summary": "Tashigi attacks the men from Baroque Works and tells the marines they should not hesitate and they should immediately know who their enemy is. Mr. 7 and Miss Father's Day speak with joy about firing the bomb because that is their last mission from the boss and believe that they will get a promotion. Luffy continues to fight Crocodile, but the poison from Crocodiles hook has entered a wound on Luffy's shoulder, making his body numb. Crocodile tells Luffy that he should have forgotten about Vivi because he would have avoided such situations he has been in.\nMeanwhile, Nami came up with an idea to stop the bomb with the weapon Usopp created for her. The plan is aiding Vivi up the clock tower, starting by having her sitting on Chopper, who is standing on Usopp's shoulders. Nami then threw her Clima-Tact between his legs using Cyclone Tempo, making him jump high enough for Chopper to jump towards Sanji, who kicks them towards Zoro. While midair and only seven seconds left, Mr. 7 and Miss Father's Day's sees them coming, and shoots at them, but only hits Zoro, who managed to push Chopper and Vivi out of the way and high enough for Chopper to throw Vivi towards the clock tower. With five seconds left, Vivi is able to cut the fuse that will activate the bomb.\nMeanwhile, Crocodile laughs at how pathetic Luffy looks with the poison running through his body. Crocodile tells Nefertari Cobra that he was well-prepared for this big event and the time bomb would do plenty of damage from where it is placed, and it would only delay the bomb for a couple of seconds or so.\nVivi finds out that the canon is also a time bomb, and cries with frustration because she sees that Crocodile is mocking at her. He had told her before that she will not succeed in saving her beloved country no matter what she does. Pell shows up and while Vivi is trying to tell him about the time bomb, he speaks of how the Clock Tower brings back so many memories from Vivi's childhood.\nIn Pell's flashback he tells Vivi that he is a guard that is there to protect his country. He takes the time bomb and flies up towards the sky. As he is flying away, in the background his voice is heard and he says, \"I am, Arabasta's Guardian Deity, The Falcon! And I am sworn to destroy the enemies of the Royal family\". When the sentence is finished, the time bomb blows up.\n"
}