{
  "chapter_number": "Episode 103",
  "title": "At Spiders Cafe - The Enemy Ringleaders Meet at 8 o'clock",
  "short_summary": "Baroque Works plan starts to take effect, and for that, the Number Agents gather to meet Mr. 0. Meanwhile, the crew finds out that the Rebel Army has moved out of Yuba and headed to Katorea, and the rebel leader Koza is determined to fight against the king.\n",
  "long_summary": "Episode 103 starts off with Luffy looking at the piece of paper Ace gave him. He ponders what it is and why Ace gave it to him. The rest of the crew also look at it and also conclude that it is just a piece of paper. Since it is so important to Luffy, Nami sews it on the inside of his hat. Vivi is looking onward and tells the rest of the crew that Yuba is only past the distant rock.\nMeanwhile in Crocodile's lair, he and Miss All Sunday are discussing their plan. Miss All Sunday says that all preparations are in place and they can carry out the plan in two days. Crocodile is pleased and tells her the other agents are coming from Spider Cafe to meet them.\nIn Spider Cafe the agents start gathering. The only one left is Mr. 1. The other agents start getting impatient and just want to leave. Mr. 2 and his men put on a dance show, but all of a sudden Mr. 1 burst through the wall knocking over one of Mr. 2's men. Mr. 2 and Mr. 1 start fighting because Mr. 2 is angry that he knocked over one of his men like that. Miss Doublefinger quickly puts an end to it. She says that they received word to go to Rainbase and meet the boss. They all go into a carriage that starts off.\nLuffy and his group finally make it to Yuba. It is being ravaged by a sandstorm. After it stops, they can see that it has been abandoned. Yuba is not the oasis they were expecting. The only one left is the founder of Yuba, and they find out the rebel army has relocated to Katorea. When Luffy calls Vivi over the old man recognizes her. He runs over to her and she realizes he is Toto from her youth. His son is the rebel army's leader. It is clear that he is very loyal to the crown, and feels terrible that his son is leading the revolution.\nThere is then a flashback of Vivi and his son playing together when they are younger. Toto is tasked with starting a new city called Yuba and so the son and Vivi part ways. Vivi and Toto have a strong connection.\nSince Vivi and Toto know each other, the crew decides to stay in Yuba for the night. Toto shares stories of how great Yuba was before the three years of drought. They all fall asleep, but not before deciding they will set off in the morning.\n"
}