{
  "chapter_number": "Episode 237",
  "title": "The City of Water is Shaking! Iceburg was Targeted!",
  "short_summary": "The Straw Hat Pirates get themselves a hotel room. Nami finds the crew on the roof with urgent news; Iceburg has been shot. Sanji and Tony Tony Chopper find out that \"Aqua Laguna\" is coming. The Galley-La Company frantically search for answers, Nami and Luffy decide to check on his condition - only to be met by closed gates. Franky appears then to exact his revenge - with style.\n",
  "long_summary": "Usopp is alone on the Going Merry, reflecting on how Luffy defeated him and left him behind. Meanwhile, the crowd investigates an incident.\nOn top of a building, Sanji and Chopper were about to start searching the town for Robin, before Nami interrupts and tells Luffy that Iceburg was shot in his own home, with the only clue being an ornate mask at the scene. Kaku and Lulu were speculating on who was responsible, suspecting Corgi of the World Government, while the citizens suspect the Franky Family and the Big Helmet Pirates. Lucci and Kalifa visited Iceburg, who was comatose, in the hospital.\nNami and Luffy ride on a Yagara to investigate the assassination attempt. Nami finds an unconscious Usopp in the streets, reflecting on how Usopp left the crew. Meanwhile, Franky returns from his shopping spree back to Water 7, only to be shocked at how the Franky House was destroyed. The Franky Family members who regained consciousness confirm that the Straw Hat Pirates were responsible, and they were likely headed for Dock No. 1. \nAt the lighthouse, due to strong wind, Kokoro declares that the Aqua Laguna was reaching Water 7, so she headed for the mainland. A citizen explains to Sanji that the Aqua Laguna was an annual high tide that flooded much of the city, so the people of Water 7 evacuate to higher ground.\nWhile Sanji and Chopper continue searching for Robin, Nami and Luffy find that Dock No. 1 was crowded due to the assassination. However, the crowd is chased away after being approached by Franky, leaving only the Straw Hats behind. \n"
}