{
  "chapter_number": "Episode 224",
  "title": "The Memory Thief's Final Counterattack Shows His True Nature!",
  "short_summary": "Luffy returns and battles evenly with Zoro. Meanwhile, the seahorse spreads illusions of the people in their memories to distract them. It steals their complete memories and claims that it has become a Sennenryu. Luffy defeats it and returns all the memories but the townspeople are convinced they are the memory stealers.\n",
  "long_summary": "The villagers celebrate because they regained their memories. The cloaked boy, who fled from the battle, reunites with his mother. He tells the villagers that the memory thief was in the forest. In the forest, Zoro approaches the Straw Hats, prepared to fight them. Sanji battles Zoro, but Luffy launches himself forward, hitting Zoro and Sanji.\nWhen they wake up, Zoro reveals that he regained his memory when the seahorse coughed up his memory. Sanji was mad that Zoro still looked scary after regaining his memory. Zoro then jumps into the lake to chase the seahorse. After Zoro catches it, the seahorse uses his last resort: he sprays a gas into the air that makes the Straw Hats hallucinate people from their past memories (Bell-mere, Hiriluk, Kaya, Kuina, Zeff, Ace, and Shanks), then their past enemies (Arlong, Wapol, Kuro, Krieg, Crocodile, and Enel). The seahorse then steals the Straw Hats' memories, causing it to inflate and be able to float; it becomes a Sennenryu.\nLuffy launches himself into the air and wraps around the seahorse. The seahorse, in pain, releases Luffy's memories. Luffy, who regained his memories for the second time, defeats the seahorse, causing him to release all his remaining memories and fly into the air.\nThe Straw Hats then ask for a reward from the villagers for defeating the seahorse and giving them their memories back. However, the villagers, mistaking them to be the memory thieves, attack the Straw Hats. The Straw Hats were forced to escape empty-handed on the Waver.\nOn the sea, Sanji prepares dinner. Luffy explains that the reason Luffy did not show up at the same time as Zoro was because he was stuck under a boulder.\n"
}