{
  "chapter_number": "Episode 286",
  "title": "Power of the Devil Fruit! Kaku and Jabra Transform",
  "short_summary": "Zoro begins his intense battle with Kaku, while Sogeking fails to retrieve the key from a sleeping Jabra. Kaku reveals his Devil Fruit power and causes the floor to collapse in the process. Meanwhile, Luffy searches high and low in the Tower of Justice, and attempts to cross the whirlpools to the Bridge of Hesitation.\n",
  "long_summary": "The initial confrontations between the Straw Hat Pirates and CP9 continue to develop. Kumadori continues his kabuki showboating before Nami. Deciding she is at a disadvantage, Nami simply asks for the key. Although he offers to show it, he seems to have misplaced it, to Nami's irritation. In the bathhouse room, Sanji opines that the water Kalifa is using to make tea for them isn't warm enough, and offers his expertise as a chef to make it properly.\nMeanwhile, Luffy finally makes it to the point where CP9 was located at their initial confrontation. Naturally, they're not there. He now has to figure out how to get to the Gates of Justice.\nBack at the library, Zoro believes Kaku is the one that actually has the key to Robin's handcuffs. Kaku responds he can feel the beastly difference in Zoro's power since their first battle at Galley-La Company headquarters. While Zoro is fearsome, Kaku says he is CP9's best swordsman, and should not be taken lightly. Zoro initially believes him to be of a two-sword style, until Kaku uses Rankyaku slashes from his legs. Kaku states that Rankyaku enables him to use Four Sword Style. Zoro remembers that his training makes Kaku's entire body a weapon.\nThe first sword exchange between Zoro and Kaku commences, and they clash swords repeatedly. Their first exchange of sword attacks evenly matches Niitoryuu 72-Pound Cannon against Rankyaku Hakurai. Kaku tries to use Soru to get the jump on Zoro, but is defended. A quick retaliatory slash from Zoro barely nicks Kaku's jacket, illiciting a chuckle from him. Zoro says he has no time for jokes. Kaku responds by planting his swords in the ceiling and using Rankyaku Ran to rain a multitude of slashes down at Zoro. After Zoro successfully defends that attack, Kaku decides to unveil his Devil Fruit power, and begins to transform.\nIn the garden room, Sogeking tries to tiptoe toward Jabra, hoping to take advantage of him sleeping to get key #1 before he notices. But the room seems to be aligning against him. First, his nose is stung by a bee. Then, he feels like his heart stops. Finally, he is confronted by a chicken. But instead of crowing, it chirps, illiciting a facefault from the sniper. Jabra wakes up, and punches Sogeking across the room. He recalls his adversary shooting down the World Government flag, complimenting his shooting ability. He then transforms, revealing he ate the Inu Inu no Mi, Model: Wolf, becoming a wolfman. He offers to end the fight quickly by tearing out Sogeking's throat, but the sniper swallows his fear and prepares to fight.\nThey are interrupted when the ceiling collapses above them. Down falls Zoro along with a large giraffe. Kaku, trying to morph into his beastman form, instead became a full giraffe. Jabra laughs at his comrade's new form, as Zoro wonders if Enies Lobby is a zoo. While Jabra and Kaku bicker over the latter's new form, courtesy the Ushi Ushi no Mi, Model: Giraffe, Sogeking hides, determining that Zoro might be able to take them both. Looking around, he finds some unused pairs of seastone handcuffs.\nKaku gives his transformation another try, and finds his giraffeman form. This startles Zoro, who says Kaku looks funny. Jabra can't stop laughing, even though he tries. The scene is briefly paused when Sogeking tries to throw a pair of seastone handcuffs at one of the beastmen, but gets it on one of Zoro's wrists instead. He says he was distracted by Kaku's beastman form. Fed up with the mockery, Kaku spins on an arm, then uses a Rankyaku slash from his neck, which shoots all around, an attack he calls Amanedachi. Those present are barely able to dodge.\nThe attack cuts the Tower of Justice in half, with the top half of the tower sliding off-kilter, exposing the garden room to the sky. Kaku grins at his handiwork, having shut the naysayers up.\n"
}