{
  "chapter_number": "Episode 201",
  "title": "Hot Blood Special Unit Participation!Bridge Offensive and Defensive Battle!",
  "short_summary": "After freeing Usopp and Zoro, Sanji and Luffy try to escape Navarone Island. As the Burning Soul combat unit is deployed, Dr. Kobato leads Nami and Chopper to the docks.\n",
  "long_summary": "After Sanji and Luffy free Usopp and Zoro from the prison cell, Shepherd, who the Marines know as Condoriano, is left behind. Shepherd tries to convince them that he is not Condoriano, but instead an inspector from Marine Headquarters. The guards, however, refuse to believe him and take him away.\nMeanwhile, Luffy's group is running around the base, being chased by Marines. In trying to escape, they end up in what seems like a dead-end at the side of the mountain and meet Vice Admiral Jonathan, who happened to be at the balcony of his office. Luffy tells Jonathan that he has freed his crewmates and declares that they were going to escape the base. This makes Jonathan laugh, asking him if he really thinks he can escape Navarone Island with their treasure, to which Luffy replies that they are pirates and that the Marines can't catch them. Suddenly a huge cannon is fires at Luffy's group, and they run back inside the base. \nInstead of going in hot pursuit of the Straw Hats, Jonathan decides to set a trap for them in Dock 88, where the Going Merry is moored, as he knows this is where they will surely go. He tasks Lieutenant Commander Drake to set up the ambush in Dock 88 and since it will take Drake some time to arrive at said dock, he orders Unit 55 to slow the Straw Hats down to stall for time. He stations them at the bridge which is the only way to get to the ship.\nMeanwhile, in the base clinic, an alarm can be heard. Nami and Chopper overhear a guard informing Dr. Kobato that they were in Code Red due to a jailbreak. Nami is worried since she and Chopper were still separated from the Crew. They deduce that Luffy must have rescued Zoro and Usopp and that they are probably on their way to the Merry. They decide that they have to get out of the clinic to meet up with the rest of the Crew. \nBefore Nami and Chopper can leave, the guard tells Dr. Kobato that one of the pirates have disguised themselves as a doctor. She panics and locks the door to her clinic. She does not realize that the pirates being pertained to are Nami and Chopper and is worried for their safety. However, the two inform her that they are the pirates and that they need her to tell them the location of the dock where their ship is. Dr. Kobato, terrified, screams and then faints which causes the guards to break down the door and rush inside. Improvising, Nami pretends to have also been attacked and lies down next to the doctor, all tied up, while Chopper hides. Nami tells the guards that \"the pirates\" have escaped through the air ducts.\nWhen Dr. Kobato regains consciousness, she tries to scream, but Nami calms her down. Chopper and Nami are about to leave, when Dr. Kobato tells them that even though they are pirates, they were the ones who helped her see what it truly means to be a doctor and that she wants to help them find their ship. Chopper is worried that they might get her in trouble for helping pirates, so she tells them that if they get caught, she will just pretend to be a hostage. Since her father works at the docks, Dr. Kobato is able to determine where their ship might be. \nMeanwhile, Luffy's group arrives at the bridge leading to Dock 88. Seeing that the bridge is unguarded, they gather that it must be a trap. They decide that they don't care and go ahead and cross it. Unit 55 block their path and have them surrounded from all sides. Luffy's group easily defeats them but, in the process, Luffy destroys the bridge, and they all fall into the bay. Even with the damage caused, Jonathan in pleased with the result since it bought them the time they needed to set up the ambush in Dock 88. Luffy's group heads to the dock, straight into the trap, seemingly cornered. Luffy is shot with a Seastone net and is incapacitated. Just then, Nami and Dr. Kobato also arrive pushing a hospital bed, with Chopper hidden in the sheets pretending to be a patient. \n"
}