{
  "chapter_number": "Episode 130",
  "title": "Beware Her Scent! The Seventh One is Nico Robin!",
  "short_summary": "The Marines fail again to catch the Straw Hat Pirates. After escaping from the Marines, Nico Robin (Miss All Sunday) appears from inside of the Straw Hat Pirates' ship. She manages to persuade the crew to let her join because Luffy did not let her die back then. Pell is seen at the end standing over his own grave.\n",
  "long_summary": "Hina explains to Smoker that they sunk Bon Kurei's ship and captured his crew, but the Straw Hats managed to run away. Although, Hina observes that Smoker seems pleased that they managed to escape. King Cobra continues the speech given to the kingdom started by Vivi. Chaka mourns Pell's death at his grave, though he admits that he cannot accept Pell is really gone. Back at Yuba, Toto continues to laugh since hearing the kingdom-wide speech, as he is one of the few people who know the true extent of the Straw Hats' involvement in saving Arabasta. It then cuts to various people and animals who interacted with the Straw Hats through their journey in the desert. Among them are citizens' reactions and plans for the future. Crocodile's casino will probably be shut down as people do not have time to take care of it, neither would they want to. It is then revealed that Pell survived the blast.\nThe Marines continue to attack the Going Merry and it seems to be sinking. Luffy, Zoro, and Sanji decide they've got to fight them when they trip over large metal pipes Usopp kept—which they then decide to throw out. Luffy throws them all off the ship, and they end up striking the Marine ships, disabling them. Using this to their advantage they make a quick escape. After hearing of the escape, Smoker informs Tashigi of the bounties on Luffy and Zoro, informing her of the latter's exploits at Whisky Peak and his victory over Daz Bonez in Arabasta. He assures her they will get their rematch another time as Tashigi vows to defeat Zoro.\nMeanwhile, the Straw Hats bemoan the loss of Vivi except Zoro who says if they miss her so much they may as well have forced her to come along. The others insult him (except Luffy who does not know how to make up a proper insult). Suddenly the door to the captain's cabin opens revealing Nico Robin. Everyone who knows who she is panics. Robin says Luffy did something to her and Sanji immediately gets angry at him. Luffy has no idea what she's talking about, but Robin insists that he put her through \"excruciating treatment\" and that he needs to take responsibility by allowing her to become part of their crew.\nFlashback to the temple collapse, as Luffy lay unconscious. Robin gives King Cobra the antidote to Crocodile's poison, telling him Luffy could survive the collapse due to his rubber body. She admits that she did lie to Crocodile about the Poneglyph and never had any intention of handing over a weapon to him: the Poneglyph's inscriptions actually are about Pluton, but she told Crocodile that they only list the monarchs of Alabasta. As Cobra administers the medicine, she tells him the truth: all she wants to know is the True History through the Rio Poneglyph. But now, she's given up. She's spent 20 years looking for it, and Arabasta was her last good lead. At that point, she believed there were simply too many enemies in the path to achieving her dream. Luffy then wakes and saves Cobra and Robin, even though she tells him to just leave her to die, but he ignores her resolutely: \"Why do I have to listen to you?\"\nBack in the present, Robin says that she now has nowhere else to go and that Luffy's \"crime\" was forcing her to live when she wished to die. Luffy allows her on the crew without another word, shocking the others. He says she is no longer a threat to them. As she allows Luffy and Chopper to play with her powers Usopp attempts to interrogate her but fails rather miserably and ends up terrified of her. However, Nico Robin reveals something about her past: she is an archaeologist since the age of eight, but she also did a lot of other jobs, including killing. Nami is bribed by jewels and gems into accepting her and Sanji was gone from the word go since she's a woman. Meanwhile Usopp, Luffy, and Chopper are having too much fun playing games with her. The only one who stays suspicious is Zoro, but even he is briefly disarmed by her cheerfulness.\nAs things on the Going Merry get back to as close to normal as they ever are, cut back to Arabasta one last time: Pell drops his crutch as he finds himself standing at his own grave.\n",
  "characters": [
    "Hina",
    "Fullbody",
    "Jango",
    "Nefertari Cobra",
    "Chaka",
    "Nefertari Vivi",
    "Karoo",
    "Toto",
    "Koza",
    "Camus",
    "Barbarossa",
    "Rasa",
    "Kung-Fu Dugongs",
    "Hasami",
    "Matsuge",
    "Potsun",
    "Pell",
    "Monkey D. Luffy",
    "Sanji",
    "Nami",
    "Usopp",
    "Tony Tony Chopper",
    "Roronoa Zoro",
    "Smoker",
    "Tashigi",
    "Nico Robin",
    "Crocodile (flashback)"
  ],
  "ssum_frequencies": [
    [
      "the",
      6
    ],
    [
      "to",
      3
    ],
    [
      "marines",
      2
    ],
    [
      "straw",
      2
    ],
    [
      "hat",
      2
    ],
    [
      "pirates",
      2
    ],
    [
      "from",
      2
    ],
    [
      "let",
      2
    ],
    [
      "her",
      2
    ],
    [
      "fail",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      41
    ],
    [
      "to",
      40
    ],
    [
      "and",
      20
    ],
    [
      "her",
      20
    ],
    [
      "she",
      14
    ],
    [
      "of",
      13
    ],
    [
      "that",
      12
    ],
    [
      "they",
      12
    ],
    [
      "luffy",
      12
    ],
    [
      "as",
      11
    ],
    [
      "he",
      10
    ],
    [
      "is",
      10
    ],
    [
      "but",
      8
    ],
    [
      "who",
      7
    ],
    [
      "robin",
      7
    ],
    [
      "his",
      6
    ],
    [
      "at",
      6
    ],
    [
      "a",
      6
    ],
    [
      "him",
      6
    ],
    [
      "in",
      5
    ]
  ]
}