{
  "chapter_number": "Episode 69",
  "title": "Koby-Meppo's Determination! Vice Admiral Garp's Fatherly Pride",
  "short_summary": "Vice Admiral Garp mentors Koby and Helmeppo to become strong marines. He invites Koby and Helmeppo to join in Marine Headquarters. Koby and Helmeppo decide to train for their dream, which is inspired by their friend Luffy. Koby and Helmeppo train harder in order to become stronger. Garp comes to know about Koby being friends with the captain of the Straw Hats. He inquires about their friendship with a pirate. Garp tells them to prove their strength. Koby and Helmeppo fight Garp, but are not able to defeat him. Garp says that he was testing their mental power. He says to Koby and Helmeppo that they are going to be trained under his supervision.\n",
  "long_summary": "The episode starts and Usopp is fantasizing and talking to himself about how everyone in Little Garden will welcome him. Then Zoro (who is at the lowest deck) grabs an apple from a barrel full of them, takes a bite of it and asks Usopp if he is an idiot. Usopp responds to Zoro by yelling that he could hear what Zoro just said while kicking the bottom part of wooden where he is seated. Nami yells at both of them to keep quiet and apologizes to Vivi. Vivi keeps explaining to Nami why there are no islands, but it is easy to hit reefs due to elevated corals (presumably on the Grand Line). While they are speaking the scene goes to Sanji who is cooking, and suddenly, Usopp shows up through the window on the kitchen and smiles (probably due to Sanji's food). Sanji makes the girls know that the desert is ready and when he is serving it Usopp shows in between Nami and Vivi. Sanji, in a mad way, lets Usopp know that his food is \"over there\". Later, Sanji asks the girls where does Luffy is and Nami replies she asked Luffy to draw water for her because she wants to take a shower. She then says Luffy must be at the water-drawing machine. Sanji comments no wonder he has been quiet all that time. Immediately after, a loud noise comes from a room and Luffy having come out of it. Luffy then adds that he was just using the machine when it suddenly broke and Nami punches him in the head. After that, everyone except Usopp is seated around a table and while Nami is reading the newspaper, Luffy sees an image where Koby appears and asks Nami to tell him what does the article says.\nKoby and Helmeppo are amused by the amount of work the marines seem to do in the Marine Headquarters. Then, both of them are hiding in an alley and Helmeppo talks about giving up because the work there seems so hard for him to keep up with. Koby tries to encourage him to persevere because Helmeppo said to his father that he will surpass him no matter what. When he talks about why they should not run away, Vice Admiral Garp shows up behind them. Suddenly, they both are afraid of what Garp will do to them. Koby tries to justify his saying by clarifying him and Helmeppo will do anything that Garp orders, and that they are prepared to die.\nThe scene goes then to the \"Sea food\" restaurant where Rika and Ririka are talking to the marines in charge of Shells Town. Rika lifts up a bank, bring it close to a marine (presumably the one in charge) and starts hitting him in the head with his two fists. She complains about how she would have liked to spent more time with them. She also adds that she was learning to cook in order to prepare them a tasty lunch sometime. You can see her face crying before you can watch two sprouts in flowerpots (presumably as an analogy with how much room for growth Koby and Helmeppo have, since they have joined the Marine HQ).\nThen, the scene goes to Koby and Helmeppo washing the floor as Helmeppo complains about how doing chores will make him a marine. It is also notable that Garp is watching over them, so they wash faster. As when the night has set, you hear Koby and Helmeppo's chat. Helmeppo comments how Vice-Admiral Garp was called \"Garp the Fist\" and was quite feared by everyone. He then talks about how if he wants to become stronger, faster, he has to build his body over the nights. Koby disagrees with this idea, since it is likely to overwork the body because of the need to sleep. Helmeppo does not seem to listen and since he is already going downstairs, Koby joins him too. It looks like they have been training hard for a long time. One day they are talking about Luffy and Garp listens to them. Garp takes them to beach to test their mentality and they pass his test. Garp gives them a special training and they appear to be following it. The scene goes back to the Straw Hat Pirates and everybody is asleep except for Nami. Nami watches Vivi as she sleeps and stores the newspaper in a drawer. Luffy gives the order to set sail to Little Garden while asleep and the boys of the crew agree with him, also while asleep.\n",
  "characters": [
    "Usopp",
    "Karoo",
    "Roronoa Zoro",
    "Nami",
    "Nefertari Vivi",
    "Sanji",
    "Monkey D. Luffy",
    "News Coo",
    "Koby",
    "Helmeppo",
    "Monkey D. Garp",
    "Bogard",
    "Rika",
    "Ririka"
  ],
  "ssum_frequencies": [
    [
      "to",
      9
    ],
    [
      "koby",
      7
    ],
    [
      "and",
      6
    ],
    [
      "helmeppo",
      6
    ],
    [
      "garp",
      5
    ],
    [
      "their",
      5
    ],
    [
      "he",
      4
    ],
    [
      "become",
      2
    ],
    [
      "in",
      2
    ],
    [
      "train",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      39
    ],
    [
      "the",
      38
    ],
    [
      "and",
      30
    ],
    [
      "is",
      17
    ],
    [
      "a",
      14
    ],
    [
      "in",
      12
    ],
    [
      "he",
      12
    ],
    [
      "him",
      11
    ],
    [
      "of",
      11
    ],
    [
      "them",
      11
    ],
    [
      "that",
      11
    ],
    [
      "it",
      10
    ],
    [
      "they",
      10
    ],
    [
      "nami",
      9
    ],
    [
      "koby",
      9
    ],
    [
      "helmeppo",
      9
    ],
    [
      "garp",
      9
    ],
    [
      "are",
      8
    ],
    [
      "luffy",
      8
    ],
    [
      "she",
      8
    ]
  ]
}