{
  "chapter_number": "Episode 67",
  "title": "Deliver Princess Vivi! Luffy Pirates Depart",
  "short_summary": "Luffy's crew manages to become targets of Crocodile, one of the Seven Warlords of the Sea, and decide to escort Princess Vivi to her hometown. They also meet Miss All Sunday, the assistant of Crocodile. While she attempts to offer them an Eternal Pose to an island near the Arabasta Kingdom, Luffy breaks it instead of allowing an enemy to decide their destination.\n",
  "long_summary": "Having defeated Mr. 5 and Miss Valentine, Luffy and Zoro turn back to each other, prepared to resume their own battle. Vivi and Karoo watch helplessly, still shocked that they beat a Baroque Works Officer Agent pair so easily. But before they can strike their first blows at each other, Nami knocks them both silly. While Luffy finally understands why Zoro was fighting Whisky Peak's denizens, Nami presses Vivi on a 1 billion contract to return her to the Arabasta Kingdom. Vivi says it is unlikely she will be able to pay due to the brewing civil strife in her home kingdom. She had learned a few years before that Baroque Works was manipulating the populace of Arabasta for the purpose of usurping her father, the King. She asked Igaram, one of her closest allies, to help her infiltrate the organization and find out who was pulling the strings.\nShe is reluctant to reveal who the leader is since doing so would expose her and put her on his hit list. However, in her growing nervousness, she inadvertently reveals who the leader is: Mr. 0 is Crocodile, one of the Seven Warlords of the Sea.\nAs she utters his name, the Unluckies, Mr. 13 and Miss Friday, stand in silence, perched above them atop a brick wall. After Mr. 13 makes composite sketches of Luffy, Zoro, and Nami, the Unluckies fly off. Nami is enraged by this turn of events, but shakes off out of anger for getting them into this. Vivi repeatedly apologizes sincerely for accidentally telling them, saying it just slipped out, but Nami is still not satisfied. While Zoro and Luffy are excited to potentially be on a Warlord's hit list, Nami laments being in such mortal danger the moment they enter the Grand Line. While they try to figure out what to do, Igaram returns. He has arrived dressed vaguely like Vivi and carrying three dummies, which are supposed to be the present Straw Hats. He will use Vivi's Eternal Pose to get straight to Arabasta, and will act as a decoy. He recommends that Vivi island-hop to Arabasta with the Straw Hats using their Log Pose, making it harder for Baroque Works to trace them. Igaram says that before Crocodile became a World Government-sanctioned privateer, he had a bounty of 80 million, so he is highly dangerous. Luffy eagerly accepts the challenge.\nShortly after Igaram sets sail, his ship explodes in a fireball even bigger than Whisky Peak itself, incinerating the decoys and sending the Eternal Pose into the water. Angered, Luffy runs to the Going Merry to set sail. Nami quickly comforts Vivi, who presumes Igaram to be dead. She promises that her crew can easily handle Baroque Works, and they will get her home. Luffy finds Sanji and Usopp, grabs them, and drags them to the ship. Vivi wonders where Karoo went, but he turns up on the ship already. While they prepare to sail, a woman comments on how foolish the decoy was. Vivi directs them down a river to get to sea, saying that Baroque Works has a total of over 2,000 agents with several bases along the way to Arabasta.\nAs dawn breaks, the Going Merry gets out to open water in a light fog. An unknown voice joins the ship, and they see someone stowing away, the woman from the previous night. She compliments the Going Merry. Vivi instantly recognizes the woman as the Vice President of Baroque works and female partner of Mr. 0 himself: Miss All Sunday. She says she ran into Mr. 8 (Igaram) just a bit ago, implying she was the one that blew up his ship. Luffy just wants to know why she is on their ship and who is she. Luffy then asks if she is bad. Miss All Sunday says she allowed Vivi to follow her and find out who Mr. 0 was, intrigued by a young girl trying to save her kingdom, but calling it ridiculous. Zoro and Nami draw their weapons, while Usopp and Sanji aim weapons at her, Usopp with his slingshot and Sanji with a pistol. Usopp notes it is out-of-character for Sanji to threaten a woman, but Sanji explains he sees her as a threat to Vivi. Miss All Sunday nonchalantly tells them not to point dangerous things at her, and suddenly they get disarmed. They realize she is a Devil Fruit user of some sort. Sanji also, after seeing how beautiful Miss All Sunday looks, predictably falls for her.\nMiss All Sunday says she has no orders, so she has no reason to deal with them right now. She also reveals she has heard of Luffy as she sneaks his straw hat off with her power. She then reveals that Nami's Log Pose is pointing to Little Garden, home to one of the bases of Baroque Works. She tosses Luffy back his hat, and gives Vivi an Eternal Pose that points to Nanimonai Island, an uninhabited island near Arabasta. It will bypass all of their bases and supposedly allow Vivi to get safely home. Although Vivi thinks about it, Luffy crushes the Eternal Pose without a second thought. He tells Miss All Sunday he will not allow an outsider to determine his crew's course. Luffy also says he hates her because she exploded Igaram's ship. She responds by saying she likes Luffy's spirit, and that they should meet again someday if they make it through Baroque Works. She then departs, riding a large sea turtle. Vivi collapses, frustrated by Miss All Sunday's ambiguous nature. The others clue Usopp and Sanji in on what is going on as they continue their journey.\nElsewhere, Miss All Sunday wonders how the Straw Hats will fare when they get to Little Garden. A quick view of an island foreshadows with a jungle, a tiger and an enormous footprint relative to the tiger and the jungle.\n"
}