{
  "chapter_number": "Episode 285",
  "title": "Retrieve the 5 Keys! The Straw Hat Crew vs. CP9",
  "short_summary": "The Straw Hats and Franky make it to the Tower of Justice. However, Fukurou reveals that one of the CP9 members has the key to Robin's handcuffs, but will not say which, so the Straw Hats must fight every member to find the key. Meanwhile, Chimney follows Spandam, Rob Lucci, and Robin down a secret corridor.\n",
  "long_summary": "Rocketman crashes into the front wall of the Tower of Justice. Spandam orders Rob Lucci to accompany him and Robin to the Gates of Justice, and tells the rest of CP9 to destroy the Straw Hat Pirates. He summons Funkfreed, and the elephant morphs into a sword. He tells Robin that the sword was imbued with the power of the Zou Zou no Mi Devil Fruit.\nFranky makes it to the remains of Rocketman and pulls out Kokoro, Chimney and Gonbe. Although he frets over them a moment, they awaken with only nosebleeds for injuries. Luffy then jumps out of the rubble, and orders the rest of his crew to do the same. Sanji remarks that, while Luffy may be a rubber man, the rest of the crew couldn't possibly be okay after an entrance like that. Then he, Chopper, Sogeking, Zoro, and Nami pop out of the ruins as if nothing happened. Franky says the entire crew is weird.\nThe crew prepare to begin the battle, but are stopped by Fukurou. He says Robin is already on her way to the Gates of Justice, and CP9 have been ordered to stop them. He reveals that each of the present CP9 members has a key to Seastone handcuffs. One of the keys will open Robin's handcuffs, but he won't say who has the correct key. Nami explains the effect of Seastone on Devil Fruit users to Franky, and Chopper notes that's why Robin wasn't fighting back.\nLuffy tries to hit Fukurou, but he uses Soru to dodge, then escapes with Geppo. Before he departs, Fukurou says the Straw Hats will have to fight CP9 for the keys, or they will throw the keys into the ocean. Zoro and Sogeking hold back an eager Luffy while Sanji figures out a battle plan. He allows Luffy to go ahead and catch up with Robin. The remaining six will take the other members of CP9 at the Tower of Justice. Chimney and Gonbe run off, and explore a secret passageway. Although briefly frightened by bats, they hear Spandam in the distance. As he gloats about the Straw Hats not even knowing how to get to the Gates of Justice, the child and rabbit decide to shadow him. Luffy is shown running a maze of staircases before Spandam is shown at a mechanical gate to an underwater passage toward the Gates of Justice. \nFranky looks for a kitchen, hoping to recharge on cola before he begins the fight. He reaches the kitchen, but is intercepted by Fukurou. In a dungeon-like hallway, Nami is met by Kumadori, but initially all he does is stomp his staff on the ground in a kabuki display. Sogeking checks the rooms of another hallway, and finds Jabra asleep in a garden room, with key #1 luckily out in the open. Sanji enters a bathhouse room, and is closed in by Kalifa. She offers him tea, and he is quickly smitten by her beauty.\nThe episode ends with Zoro finding Kaku in the library. Kaku notes Zoro has already drawn his swords. Zoro responds that they're thirsty for blood.\n"
}