{
  "chapter_number": "Episode 183",
  "title": "Maxim Rises! The Start of Deathpiea!!",
  "short_summary": "The fight between Enel and Luffy continues with Enel starting a machine that would bring the death of Skypiea: Deathpiea.\n",
  "long_summary": "The episode starts as Nami rehashes what she realized at the end of the previous episode: that because rubber does not conduct electricity, Luffy is immune to Enel's lightning attacks. Enel wakes up and jumps away from Luffy. He does not understand what Luffy is and Luffy tells him that he is a pirate and a rubberman which puzzles Enel even more as the White-White Sea does not have rubber.\nLuffy attacks Enel again but due to his mantra, Enel dodges every shot and starts to fight back with his golden staff and pins Luffy against a wall. He points out that lightning is not the only weapon he can use and once he realizes something does not work, he can adapt his strategy accordingly. Still, Luffy escapes and tells him hitting him won't work either. \nBoth adversaries are frustrated at each other: Luffy because of Enel's mantra and Enel because he still does not understand what rubber is. Upon remembering that Luffy's Devil Fruit was a Paramecia-type, he uses his electric power to turn his golden cane into a spear and attacks Luffy with it. To Nami's dismay, Luffy does confirm out loud that piercing attacks work on him. \nThe fight continues. Luffy tries to use the gatling gun attack in the air but Enel suddenly dematerializes and reappears through the gold of the ship to attack Luffy with the spear. Luffy dodges it but burns his hands holding the spear. As Enel explains that he can use his electric powers to heat the weapon, Luffy counterattacks him into the ground. Enel then grabs Luffy's arms and crashes him into the ground as well.\nGetting up, Enel gives a speech about the new world he is going to start and how Luffy can't stop him and walks away. Using his lightning powers, he turns on Ark Maxim which starts lifting into the air. Aisa and Pierre who had been watching the fight from below are panicked about what to do. Nami is also panicked and tries to figure out what to do. If Enel is killed, the ark will crash into the ground since it runs on his powers but if they let him fly it, Skypiea will be destroyed. Standing up, Luffy throws his straw hat onto her head and tells her as the crewmate of the future Pirate King, she should have more faith. Enel is intrigued by the title and Luffy tells him the Pirate King rules the greatest sea in the world and Enel is appreciative, but the fight has to go on. Maxim starts to fly away but is slightly stuck on the walls of the cave. Aisa is riding Pierre and Pierre seems to suggest they should get on board as well but she tells him that a warrior's duel should never be interrupted and that this is Luffy's fight.\nMeanwhile, the people of Angel Island are all rushing to get out of the island. McKinley is trying to guide them and avoid panic. He notices an old man who is just sitting there teary-eyed. He says he has believed in God for too long and is ready to accept whatever fate God has in store for him. But McKinley gives him a teary-eyed speech about how God does not have the right to take their lives away from them and they have a duty to survive. The old man decides to leave and his grandson is grateful to McKinley. Several villagers approach McKinley to tell him they are going to the Shandia Village to warn them too of the impending disaster.\nEnel tells Luffy and Nami that the ship's \"ultimate function\" - Deathpiea - has been activated and the chimney starts spewing out black clouds into the sky. All around, the islands' people notice the clouds in the sky. Robin who has now gotten up is looking wistfully at Zoro, Chopper and Gan Fall, when Wyper notices the dark clouds. Some Shandia also look at them and say this is the first time it has ever happened in Skypiea and this portends bad news about the warriors that are on Upper Yard. The inhabitants of Angel Island also panic at the sight of the clouds and think this is the beginning of the end.\nEnel explains that Deathpiea uses Enel's electric energy to condense intense air currents and create thunderclouds. Once they spread all over Skypiea, Enel will be able to destroy the whole island with lightning. To illustrate his point, he lifts his arm and a huge lightning bolt comes out of the thunderclouds and destroys several buildings on Angel Island in front of the horrified fleeing inhabitants. McKinley and then Conis on her waver both see this from afar and curse Enel. Enel tells Luffy and Nami that this was simply a \"tease\".\nLuffy is appalled that being God means taking away anything Enel wants to take away. Enel says he will now take Luffy's life. The fight restarts and each combatant is able to dodge the others attacks although Luffy keeps burning his feet and hands with the spear any time he pushes it away.\nAfter Enel could not predict one of Luffy's instinctive dodges of a spear attack and slightly damages the ship, Luffy gets an idea and puts himself in a Gomu Gomu no Daze state. Enel keeps attacking with his spear but Luffy bobs and weaves like a \"grass in the wind\" and does not get hurt. Nami realizes that Luffy's plan was to put himself into an \"unthinking\" mode. He reflexively dodges the attack using the air currents but because he is in a daze, he does so unconsciously and Enel's mantra can't predict what his movements are going to be.\nLuffy snaps himself out of it and points out that in that dazed state, he can't go on the attack. Then Luffy goes Gomu Gomu no Tako (Octopus) and Nami is appalled he is trying out a new silly idea. Luffy's arms and legs turn into tentacles and Luffy turns around and starts to punch like crazy at a wall of Maxim's. Enel is nonplussed and thinks Luffy is trying to destroy the ship. Enel lunges at Luffy but Luffy's hundreds of punching arms ricochet from the wall back onto Enel and Enel is pummeled. Nami realizes that because the hits are coming from the natural ricochet of the punches on the wall and not anything Luffy is thinking, Enel can't see them coming.\nLuffy \"bazooka-es\" into Enel and Enel is weakened and bloodied and starts to panic. As the episode ends, we see Luffy lunging at Enel preparing a Gomu Gomu no Rifle attack and an obviously desperate Enel trying to get up and telling himself he needs to get away.\n",
  "characters": [
    "Monkey D. Luffy",
    "Enel",
    "Aisa",
    "Pierre",
    "Nami",
    "McKinley",
    "Gan Fall (K.O)",
    "Roronoa Zoro (K.O)",
    "Wyper (K.O)",
    "Tony Tony Chopper (K.O)",
    "Nico Robin",
    "Shandia Chief",
    "Conis"
  ],
  "ssum_frequencies": [
    [
      "the",
      2
    ],
    [
      "enel",
      2
    ],
    [
      "fight",
      1
    ],
    [
      "between",
      1
    ],
    [
      "and",
      1
    ],
    [
      "luffy",
      1
    ],
    [
      "continues",
      1
    ],
    [
      "with",
      1
    ],
    [
      "starting",
      1
    ],
    [
      "a",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      67
    ],
    [
      "and",
      56
    ],
    [
      "to",
      37
    ],
    [
      "luffy",
      31
    ],
    [
      "is",
      30
    ],
    [
      "enel",
      30
    ],
    [
      "he",
      23
    ],
    [
      "of",
      19
    ],
    [
      "a",
      18
    ],
    [
      "that",
      17
    ],
    [
      "his",
      16
    ],
    [
      "him",
      13
    ],
    [
      "but",
      11
    ],
    [
      "on",
      11
    ],
    [
      "in",
      11
    ],
    [
      "not",
      10
    ],
    [
      "does",
      9
    ],
    [
      "out",
      9
    ],
    [
      "into",
      9
    ],
    [
      "at",
      8
    ]
  ]
}