{
  "chapter_number": "Episode 95",
  "title": "Ace and Luffy! Warm Memories and Brotherly Bonds",
  "short_summary": "Ace fights Smoker while the Straw Hat Pirates run for their ship. Luffy reunites with his brother Ace, and presents him to his crew. Later, Ace takes down some Baroque Works agents.\n",
  "long_summary": "Ace starts fighting Smoker while the crew is running away to the Going Merry. As they flee, Nami asks Luffy if Ace is really his brother. Luffy confirms this and tells them his name. A bifurcation is in their way and Nami tells everyone to follow her, but Luffy goes the other way, as he was watching his brother fight. The Straw Hats arrive at the ship and carry all the supplies, only to notice that Luffy is missing. Luffy is sitting on the barrel he was carrying in an alley, but he does not know where his crew went. Ace greets him from the top of a house in the alley and then comes down. They start arm wrestling on top of the barrel Luffy was sitting on, but after struggling, the barrel breaks and the water inside it scatters. They both agree that they are equally strong. Ace invites Luffy and his crew to join the Whitebeard Pirates, but Luffy declines.\nOn Smoker's ship, Mr. 11 is left alone, tied to the mast. Some Billions get on the deck and Mr. 11 asks them to untie him. They explain that as Billions, they are candidates to be promoted to Officer Agents. Mr. 11 asks them to untie him again, but they shoot him. The Billions get off the ship and someone informs them that Fire Fist Ace is in the town. One of them then comments that if they take down Ace, they will surely be promoted to Officer Agents.\nLuffy and Ace start searching for Luffy's crew, but as they walk, Billions start to surround them without being noticed. After they are gathered, everyone comes out. Luffy and Ace do not care what they say and keep walking but the Billions start a fight. After Luffy sends the leader flying with Gomu Gomu no Bazooka, one of the Billions tells his comrades not to be scared by that, and everyone keeps chasing them again. Luffy spots his ship and stretches his arms in order to reach for it. He enters the ship ramming towards Sanji and Chopper. Ace reaches the ship in his boat, but then they spot five Billions ships coming towards them. Ace tells Luffy that he can handle them, gets in his boat, and starts propelling it with the help of his flames. He then jumps over a ship and when he lands, he launches a Hiken, destroying the five ships consecutively.\nSmoker is talking to Tashigi and asks what Nefertari Vivi was doing with the Straw Hats. Tashigi proposes that perhaps she was a hostage to a major scheme, but Smoker does not think so. He thinks that is unlikely since she was getting along with the group as if she was one of them. He says that something big is going to occur and that he may know where they are heading after Luffy told him he only wanted to beat Crocodile. Usopp, Luffy, and Chopper in the Going Merry are toasting for Ace joining the Straw Hats, but Ace tells them he is not joining them. After that, he explains that he is in search for Blackbeard after he killed one of his crewmates. He also explains that he is heading to Yuba, and Nami tells him that they are going to the same place. Vivi proceeds to explain the route and after that, they toast for having a fun time together.\n"
}