{
  "chapter_number": "Episode 120",
  "title": "The Battle is Over! Koza Flies the White Flag",
  "short_summary": "Crocodile reveals that he has set up a massive bomb in the city. The Tsumegeri Guards appear, having drunk a forbidden type of water called Hero Water, that makes them stronger, but leaving them with only five minutes to live. Crocodile moves to where the guards cannot reach, resulting in the guards dying, due to the five minutes elapsing caused from the water. Chaka then uses his Devil Fruit power, in order to turn into a jackal and attacks Crocodile, who defeats him. In the next scene, Sanji, Usopp, Chopper, and Matsuge regroup after their battles. Afterwards, Vivi reveals Crocodile's plan to Koza. He attempts to stop the fighting but is shot by a Baroque Works agent hidden in the Royal Army.\n",
  "long_summary": "The Tsumegeri Guards charge into the palace to attempt to save Cobra. Cobra orders them not to attack as they will just be throwing away their lives. The Guards tell their King that they have sworn to protect him even to the death. Acknowledging their reputation, Crocodile offers to spare their lives if they leave and go home, to which they refuse. However, before they can attack, their bodies show signs changes and bruising. Chaka explains that to temporarily increase their power they must have drank Hero Water which grants incredible strength but kills the host and that they are good as dead. They proceed to attack Crocodile, but he turns himself into sand and dodges their attack. Crocodile states that he won't bother to fight them since they're going to die anyway. Shortly thereafter, the Tsumegeri Guards all collapse and die. Crocodile laughs at this which angers Chaka causing him to attack Crocodile. Chaka reveals his Inu Inu no Mi, Model: Jackal devil fruit power. He is, however, unable to land a blow due to Crocodile's powers.\nMeanwhile, after his fight, Zoro collapses due to loss of blood. As he lies barely conscious, he wonders how the others are doing and that they better not be dead. With this, he thinks about Usopp. In another part of the city, Sanji, along with Chopper and Usopp who are being carried by Matsuge, are running towards the palace. Usopp is in tears, remembering that Miss Merry Christmas told them that Luffy is dead. Chopper tearfully tells him that it might not be true while Sanji, with a smile on his face, asks them if they truly believed that. They answer that they believe Luffy is still alive.\nCutting back to Zoro, he is now thinking about Nami and wondering if she managed to escape. Nami is then shown somewhere in Alubarna - North Block, detangling her Clima-Tact's final attack from Miss Doublefinger's body. She then proceeds to go to the palace.\nZoro then wonders if Vivi is okay. Vivi is then shown calling out Chaka's name with Chaka lying down on the ground, bloodied. A figure then approaches Vivi and calls out her name. \nScene cuts to the Palace Square, showing that there are 25 minutes left until the time of the explosion Crocodile has planned. \nThe figure is revealed to be Koza, who is in disbelief on what he is seeing before him. He sees the Tsumegeri Guards dead on the ground, Chaka bloodied and lifeless, Cobra nailed to the palace walls, and that Crocodile, the supposed country's hero, is behind it all. Crocodile is amused at the turn of events where the country is in the midst of war and the leaders of both sides are not on the battlefield but are standing at his feet. \nMiss All Sunday ridicules Koza's confusion and offers to \"help\" him understand. She tells him to relax and open his mind and think of the worst possible scenario. Koza realizes that his father was right about Cobra and that he was wrong to doubt him. Koza demands to know who was responsible for the drought ravaging Arabasta, where Crocodile answers that for the past two years, every single malicious thing Koza attributed to Cobra was in fact perpetuated by him and his company, Baroque Works. Crocodile continues to taunt Koza, but Cobra calls his attention and demands that he listen. Cobra asks him to save as many citizens as he can. Chaka tells him about the bomb in the palace square and to hurry. Crocodile, seeing that Chaka is still alive, proceeds to strike him once more seemingly killing him.\nKoza runs towards the palace square, but Vivi chases him and pulls him to the ground. She implores him to listen and think things through. She explains that if they tell everyone that the palace square will explode, everyone will panic which will add more chaos to the battle and that even if they stop the bomb, it doesn't really stop the fighting and people are still going to die. She tells him that they have to stop the rebellion instead and that he is the only one who can do it. Hearing their plans, Crocodile tries to stop them and attempts to strike Vivi but is blocked by Chaka giving them time to get away. \nVivi reaches the Royal Army and commands them to surrender immediately. Koza then comes out and tells the Royal Army that they no longer need to fight and that they just want to end the conflict. As the rebel army approaches the palace square, they see the Royal Army waving white flags of surrender. They also see their leader, Koza waving a white flag. He tells them to quiet their anger and lower their weapons. He announces that the battle is over. However, he is shot multiple times by what looks like a soldier of the Royal Army but is actually a Baroque Works agent who has infiltrated their ranks. Vivi screams in horror.\n",
  "characters": [
    "Nico Robin",
    "Nefertari Vivi",
    "Chaka",
    "Crocodile",
    "Nefertari Cobra",
    "Tsumegeri Guards",
    "Pandaman",
    "Mr. 1",
    "Roronoa Zoro",
    "Usopp",
    "Matsuge",
    "Sanji",
    "Tony Tony Chopper",
    "Super Spot-Billed Duck Troops (flashback)",
    "Nami",
    "Miss Doublefinger",
    "Karoo (flashback)",
    "Monkey D. Luffy (flashback)",
    "Koza",
    "Toto (flashback)",
    "Farafra"
  ],
  "ssum_frequencies": [
    [
      "the",
      9
    ],
    [
      "to",
      6
    ],
    [
      "in",
      5
    ],
    [
      "a",
      4
    ],
    [
      "crocodile",
      3
    ],
    [
      "guards",
      3
    ],
    [
      "water",
      3
    ],
    [
      "reveals",
      2
    ],
    [
      "that",
      2
    ],
    [
      "he",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      45
    ],
    [
      "to",
      43
    ],
    [
      "and",
      29
    ],
    [
      "that",
      25
    ],
    [
      "is",
      20
    ],
    [
      "they",
      19
    ],
    [
      "him",
      16
    ],
    [
      "he",
      16
    ],
    [
      "their",
      12
    ],
    [
      "crocodile",
      12
    ],
    [
      "palace",
      9
    ],
    [
      "of",
      9
    ],
    [
      "them",
      8
    ],
    [
      "chaka",
      8
    ],
    [
      "are",
      8
    ],
    [
      "his",
      8
    ],
    [
      "in",
      8
    ],
    [
      "koza",
      8
    ],
    [
      "cobra",
      7
    ],
    [
      "but",
      7
    ]
  ]
}