{
  "chapter_number": "Episode 270",
  "title": "Give Robin Back! Luffy vs. Blueno!",
  "short_summary": "For a while, Sogeking talks with Oimo about how he and Kashii came to support the Marines and hears a familiar story. The majority of the episode is a Little Garden flashback. Sodom, the Giant Bull, takes severe damage and urges those riding him, to run before he collapses. Back at the fight between Blueno and Luffy, Luffy throws the first punch to initiate the battle.\n",
  "long_summary": "Sogeking is too far away for the Straw Hat Pirates to go back for, so he will have to find his own way to return to the group. Sogeking is having doubts about whether or not he should run away. Oimo wakes up crying, Sogeking wants to know why Oimo is crying. Oimo and Kashii were in a pirate crew, but their bosses starting having competitions and would not leave (Little Garden) until they find out which one is better, so the crew returned home without the two bosses. After fifty years had passed, Oimo and Kashii went back to get their two bosses, but the World Government captured them with a lie. They promised them to let their bosses free if they worked for Enies Lobby for one hundred years and that they will be free and return home to Elbaf. Sogeking tells Oimo the true story, that Dorry and Brogy, have been fighting on Little Garden for one hundred years now, and their competition still continues. Both Sodom and Gomorrah are raging through the Marines, but then Sodom gets hit by the cannon in the heart. Sodom collapses and the Marines find no one riding him. The Straw Hats were able to board Gomorrah before Sodom collapsed and continue moving forward.\nLuffy wants Robin back and Blueno explains that Luffy is committing quite a criminal offense against the world. Luffy starts the fight where he breaks through Blueno's Tekkai, sees through his Soru and is able to hit him. Luffy expresses how he does not care about the World Government and that he just wants to get Robin back.\n"
}