{
  "chapter_number": "Episode 142",
  "title": "Frantic Struggle! Wetton's Plans and the Rainbow Tower!",
  "short_summary": "Luffy accidentally propels himself and Rapanui Pasqua to the end of the mist. Nami appears in the ship graveyard with a rowboat full of treasure and a string connected to the real world, which are both stolen by Wetton's subordinate. The Mayor uses the Rainbow Tower to make a bridge to the Rainbow Mist.\n",
  "long_summary": "The episode starts in the Marine wreckage with Ian sleeping in his cell when Akibi fell and Pukau telling him that they need to get the things they’re holding to “them”. Ian wakes up and discovered that someone was coming to bring them back to Ruluka . Ian, surprised, suddenly told them to wait and cried infront of Akibi telling him to let him out. Gullible enough, Akibi agreed and Ian thanked him followed by an evil laugh. Meanwhile, Luffy again propelled himself to the sky followed by Rapanui pushing Henzo still not convinced that he was the real Henzo even if the others told him it was a mistake and that Henzo would never be Wetton’s dog. Rapanui reminded them of Wetton’s burning of their village and asked Henzo if he forgot those memories in just 50 years. Usopp attempted to convince him by telling him he didn’t know what happened to those 50 years and how Henzo suffered in order to save them. He told them that he endured those many backstabs that he experienced but still researched on the Rainbow Mist.\nHenzo puts it aside and told Rapanui to punch him and forget about all the pride because he has been living under Wetton’s command. Rapanui couldn’t punch him and instead cried wondering how 50 years could have passed so suddenly, Usopp told them they are comrades as to reuniting the Pumpkin Pirates. When they were about to shake hands, Luffy suddenly appeared from a portal and grabbed Rapanui and went inside another portal. Nico Robin told them they will be fine because everything in the Rainbow Mist is in a loop but quickly disagreed because it took too long. Henzo told them they should find them and the scene went into a different dimension in which Luffy and Rapanui went. On the other side, a Sea King continues to threaten Nami and Sanji told Wetton they should help her before she gets eaten but Wetton didn’t care. Lake recognized they couldn’t get to Ape’s Concert either because of the Sea King. Flip told her she should use the safety device Henzo invented which is a lifeline but she was too scared at that moment as she was going to be eaten. A Marine Major knocked it out with a coin and then fades away. Nami tied the end of the line to her Clima Tact and she threw the cross portion to Chopper and went into the Mist telling him to pull the line if a signal is given. Wetton said to let her go and the guards shouted he will now change clothes. He changed into his Flame Suit in about just a second. The guards prepared for the suit’s requirements but the weakness is obvious because of the shaking in raising the flamethrower of the suit. On the other side, Luffy and Rapanui are running not knowing where to go and Rapanui sat because Luffy was just running because of his instinct. He said he didn’t complete his reuniting with Henzo. He was worried that he might be like his Pop when he grows up, he was a Marine Officer and he left him years ago only to discover that his father died. Luffy still wanted to get back so he started walking telling Rapanui they wouldn’t find the others without moving. They couldn’t find them so Henzo thought they might have come to the Mist’s end. Robin was wondering a bit because a shipwreck she estimated was about 200 years old and a rocket debris floating saying she didn’t see that recently, she concluded that the Rainbow Mist’s time is actually distorted. Nami arrived with some treasures on her rowboat and asked where Luffy was. Usopp and Zoro told her they were gone with Nami surprised. Ian came out with Akibi as hostage but Nami didn’t want to save him because she didn’t know who he was. This led to Isoka threatening her with a knife and Ian with the two of them went in the rowboat. Isoka aggravated Ian but Akibi got kicked in the waters. Robin held Ian tight with her devil fruit powers and Isoka went to rescue Akibi but Robin got weak because of Kairouseki. Ian escaped and Usopp can’t concentrate on shooting him. Meanwhile, Chopper and Sanji are in trouble of being burnt from Wetton forcing Chopper to eat a Rumble Ball but still failed because of Lake. Sanji got caught on a net and got burnt too. When they saw the signal, they did see a rowboat coming back as Sanji was about to kick Wetton when Lake electrocuted him. Ian saw Ruluka Island and was amazed but mistook Lake to be Wetton. Ian was surprised again for discovering that Wetton had already entered third generation and Wetton secretly whispered what was in the Mist. In the Mist, Nami is appreciating the treasures but considered them useless if they can’t get out. Henzo knew they would come back because Wetton wants to get all the treasures of Ape’s Concert. Usopp told Nami she was a navigator so she should do something. Rapanui and Luffy are already tired of walking when Rapanui fell and remembered how they worked hard on getting out the Mist. Ironically, Rapanui wanted to go back to Ruluka even if he told them they would own Ape’s Concert as their paradise. \nRapanui saw a Marine ship and someone waving looks like his father but the sight turned to a light which they ran to. On the other side, the Rainbow Tower was knocked down and the water that splashed came to Luffy and Rapanui too. The tower then went straight to the Mist horizontally. The sea inside the Mist got rough and then Henzo saw the Rainbow tower. Rapanui and Luffy got back to Ruluka and Rapanui concluded that they are invading Ape’s Concert. The entrance of the tower in the Mist opened and the guards arrived from the other side by the tower’s tunnel-like conveyor belt. Wetton told the guards to get all Ape’s Concert’s treasures laughing evilly ending the episode.\n",
  "characters": [
    "Ian",
    "Rongo",
    "Pukau",
    "Monkey D. Luffy",
    "Henzo",
    "Rapanui Pasqua",
    "Akibi",
    "Isoka",
    "Usopp",
    "Nico Robin",
    "Roronoa Zoro",
    "Wetton",
    "Lake",
    "Flip",
    "Tony Tony Chopper",
    "Sanji",
    "Nami"
  ],
  "ssum_frequencies": [
    [
      "the",
      7
    ],
    [
      "to",
      4
    ],
    [
      "a",
      3
    ],
    [
      "and",
      2
    ],
    [
      "of",
      2
    ],
    [
      "mist",
      2
    ],
    [
      "rainbow",
      2
    ],
    [
      "luffy",
      1
    ],
    [
      "accidentally",
      1
    ],
    [
      "propels",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      56
    ],
    [
      "and",
      41
    ],
    [
      "to",
      39
    ],
    [
      "a",
      21
    ],
    [
      "they",
      19
    ],
    [
      "he",
      19
    ],
    [
      "was",
      18
    ],
    [
      "rapanui",
      16
    ],
    [
      "in",
      15
    ],
    [
      "of",
      15
    ],
    [
      "him",
      14
    ],
    [
      "that",
      14
    ],
    [
      "them",
      13
    ],
    [
      "told",
      13
    ],
    [
      "henzo",
      12
    ],
    [
      "but",
      12
    ],
    [
      "because",
      12
    ],
    [
      "ian",
      11
    ],
    [
      "she",
      11
    ],
    [
      "luffy",
      10
    ]
  ]
}