{
  "chapter_number": "Episode 228",
  "title": "Rubber and Ice One-On-One Fight! Luffy vs. Aokiji!",
  "short_summary": "Luffy insists on fighting Aokiji alone and risks it all so the crew can save the frozen Robin. Ultimately they survive the encounter with the Admiral, and eventually continue on their journey to Water 7.\n",
  "long_summary": "Aokiji tries to crush the frozen Robin underfoot, but Luffy slides her out of the way to Usopp and Chopper. Luffy urges them to return her to the ship to thaw her, determined to fight the Admiral himself. Once there, Chopper and Usopp run the shower over her to slowly thaw her, but Chopper is uncertain if he'll be able to resuscitate her once thawed. Nami arrives shortly after with Zoro and Sanji. The latter two thaw their frozen limbs in the sea before returning to the battle to help Luffy, while Nami assists Chopper and Usopp in thawing and reviving Robin.\nAokiji tells Luffy that the world is better off if Robin is not saved, but Luffy refuses to leave his crew behind. Luffy kicks him in the air and attempts Gomu Gomu no Storm, but Aokiji breaks himself apart and reconstitutes around Luffy, freezing him with Ice Time and placing his frozen body on the ground. Aokiji contemplates the fight, and thinks Luffy challenged him one-on-one to save his crew, perhaps even not concerned about winning. As Zoro and Sanji approach, Aokiji leaves Luffy's frozen body and departs, saying he owes the pirate for defeating Crocodile. Although he briefly mentions a message from Smoker (but only that it was \"something stupid\"), Luffy can't hear him anyway. Before he bikes across the sea, he notes that the Straw Hat Pirates will be heading to Water 7 next, getting them close to World Government headquarters.\nSome time later, Chopper comes up from the sick bay and tells the crew tearfully that Robin and Luffy's hearts have resumed beating. Sanji goes to prepare a meal for them, while Chopper tells the others to let them recover for a bit. Usopp collapses, confiding in Zoro that he's unsure how long he can take the growing power of the enemies they are facing. They remain at the deserted island for four days while they recover before setting sail again.\nA week after their encounter with Aokiji, Sanji lets the crew sample a dish of potato paille while Luffy jokes about having been frozen. Robin finally appears, having taken a bit longer to recover than Luffy, and asks for some coffee. Luffy soon finds Yokozuna, that frog that the shipwreck survivors from the previous island told them about that was able to swim with a crawl stroke instead of a normal frog swimming motion. He insists on following it, manually changing course and paddling the Going Merry to Nami's chagrin, hoping to catch and eat the frog. Suddenly, they find themselves near a lighthouse, and by what looks like a railroad crossbuck, with the lights and bells going off. As a train whistle sounds, something approaches them very fast, causing Nami to order full reverse in a panic.\n"
}