{
  "chapter_number": "Episode 195",
  "title": "Now Heading Towards the Blue Sea!!Memories of an Interwoven Finale",
  "short_summary": "The Straw Hat Pirates are heading to Cloud End with the help of Pagaya and Conis. As they descend the free fall, Conis calls an Octopus Balloon to have them safely land in the Blue Sea. The Golden Bell rings as the Straw Hat Pirates are going down to the sea, meaning that they are welcome in Skypiea any time, and that the Skypieans are deeply thankful for what they did. When the ship finally rests on the sea, problems appear, as the ship has landed in a Marine base.\n",
  "long_summary": "The Straw Hats (minus Nami who is already at the ship) are seen running away from what they thought was a huge cannon. The Sky People are disappointed that they were not able to give them their gift and that they were not able to express their gratitude, although Aisa says that she was able to thank them before they left. \nMeanwhile in Upper Yard, Wyper declares that while their ancient duty as Shandorians has already been fulfilled, the fire of Shandora will never die. The Shandorian Chief asks Gan Fall to reprise his role as their leader. He initially declines this request since he still has to fulfill his duty as Sky Knight, but the Chief argues that their land no longer has any use for that role. He continues to say that what they need, instead, is someone who is kind and just who can govern their land, and that duty is best suited for him. Gan Fall suggests that the Shandorian Chief lead the Sky People since Shandora originally belonged to the Shandorians. The Chief says that that means nothing now, and that Vearth should be shared among all the peoples in Sky Island, and that he is the best person who can lead them. All of the Sky People then cry out for him to be their leader, which he then accepts.\nThe Straw Hats are sailing across the White-White Sea towards Cloud End, preparing to leave Sky Island. They are escorted by Pagaya, Conis and Su on their waver. They reach Cloud End and start descending the Milky Road which will lead them to the Blue Sea. As they freefall back to the Blue Sea, Conis summons an Octopus Balloon to soften their landing. It grabs onto the Going Merry and stops their freefall. It is then that the Sky People ring the Golden Bell so that their departing heroes know how much they are appreciated and are welcome back anytime. \nBack on Jaya, Cricket tells the Saruyama Alliance that he is calling off the search for the City of Gold since they have confirmed that it has been in the sky the whole time. He thanks them for believing in his dream and that he has decided to leave the island. The Masira and Shoujou ask if he's leaving the alliance, to which he answers them with a question of which dream were they going to pursue next, implying that he wasn't leaving them.\nOn the Going Merry, Luffy, Sanji, Usopp and Chopper discuss what they were going to do with the treasure they found in Shandora. Nami tells them they can't buy everything they want because they'll end up broke and that they have to ensure to land safely first. Robin calls Nami's attention and asks her where they are headed. Nami realizes that they have been blown off-course by an air current, and that because of the Octopus, they are unable to use the sails to control the ship. \nThe descent taking longer than expected, the crew grows bored and Luffy decides to hop on top of the Octopus and jump around its head like a trampoline. Sanji notices that the Octopus is shrinking so he tries to stop Luffy from playing. Unfortunately, the Octopus loses air, and they start to freefall towards the sea. To stop them from falling, Usopp goes to the bottom of their ship and attaches breathe dials to help the ship float. The ship slows down momentarily, however, the Octopus loses all of its air, and the ship comes crashing down and lands onto the sea. Surprisingly, the ship survives the fall. After they land, they hear sirens and see spotlights trained on the Merry. \n",
  "characters": [
    "Tony Tony Chopper",
    "Usopp",
    "Sanji",
    "Nico Robin",
    "Roronoa Zoro",
    "Monkey D. Luffy",
    "Nami",
    "Conis",
    "Su",
    "Shandia Chief",
    "Gan Fall",
    "Pierre",
    "Aisa",
    "Raki",
    "Kamakiri",
    "Braham",
    "Genbo",
    "Wyper",
    "Kalgara (statue)",
    "Pandaman",
    "McKinley",
    "Pagaya",
    "Nola",
    "Shoujou",
    "Masira",
    "Mont Blanc Cricket",
    "Mont Blanc Noland (picture)"
  ],
  "ssum_frequencies": [
    [
      "the",
      11
    ],
    [
      "are",
      4
    ],
    [
      "to",
      3
    ],
    [
      "as",
      3
    ],
    [
      "they",
      3
    ],
    [
      "in",
      3
    ],
    [
      "sea",
      3
    ],
    [
      "straw",
      2
    ],
    [
      "hat",
      2
    ],
    [
      "pirates",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      49
    ],
    [
      "to",
      26
    ],
    [
      "that",
      23
    ],
    [
      "they",
      22
    ],
    [
      "and",
      22
    ],
    [
      "their",
      12
    ],
    [
      "he",
      11
    ],
    [
      "them",
      9
    ],
    [
      "is",
      8
    ],
    [
      "are",
      8
    ],
    [
      "sky",
      8
    ],
    [
      "of",
      8
    ],
    [
      "ship",
      7
    ],
    [
      "octopus",
      6
    ],
    [
      "in",
      5
    ],
    [
      "has",
      5
    ],
    [
      "for",
      5
    ],
    [
      "sea",
      5
    ],
    [
      "on",
      5
    ],
    [
      "who",
      4
    ]
  ]
}