{
  "chapter_number": "Episode 20",
  "title": "The Famous Cook! Sanji of the Floating Restaurant",
  "short_summary": "The crew meets Johnny and Yosaku, Zoro's former bounty hunter companions, and they set sail for the Baratie restaurant in search of a cook. Meanwhile, Sanji, the restaurant's sous chef, beats an arrogant Marine lieutenant Fullbody during a heated argument.\n",
  "long_summary": "Johnny explains that after his bounty hunting partner, Yosaku, had fallen ill from an unknown disease, they had stopped at a rock so Yosaku could rest. However, the rock was targeted by Luffy's cannon, which he assumed to be a deliberate attack.\nThe crew take an ill Yosaku onboard and Nami diagnoses him with scurvy, a disease caused by a vitamin C deficiency. After treating his illness by feeding him lime juice, they bring him inside to rest. The crew decide they need a crew member specializing in cooking to tend to their dietary needs. They decide to stop at the Baratie, a ship and ocean-going restaurant.\nHowever, they arrive at the same time as Marine lieutenant Fullbody, who enters the restaurant for a date but orders his men to destroy the crew's ship. Luffy deflects their cannonball with his rubber body, but this causes the cannonball to strike the Baratie's rooftop, blasting a large hole in the roof and injuring the head chef, Zeff. As Luffy had no money to pay for repairs, Zeff forces him to work as a chore boy for an entire year to make up for the incident, and he refuses to negotiate with Luffy.\nMeanwhile, Fullbody gets into an argument with the restaurant's sous chef, Sanji, after the former attempts to place a fly in his soup. After the argument escalates, Fullbody destroys the table, spilling the soup on the ground. For wasting the food he made, Sanji beats Fullbody with his legs, prompting the other members of the crew to enter the restaurant to investigate the loud sounds.\n",
  "characters": [
    "Moodie",
    "Fullbody",
    "Roronoa Zoro",
    "Johnny",
    "Monkey D. Luffy",
    "Usopp",
    "Nami",
    "Yosaku",
    "Batchee",
    "Zeff",
    "Sanji",
    "Motzel"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "and",
      2
    ],
    [
      "a",
      2
    ],
    [
      "crew",
      1
    ],
    [
      "meets",
      1
    ],
    [
      "johnny",
      1
    ],
    [
      "yosaku",
      1
    ],
    [
      "zoros",
      1
    ],
    [
      "former",
      1
    ],
    [
      "bounty",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      23
    ],
    [
      "to",
      14
    ],
    [
      "a",
      10
    ],
    [
      "his",
      6
    ],
    [
      "they",
      5
    ],
    [
      "with",
      5
    ],
    [
      "for",
      5
    ],
    [
      "after",
      4
    ],
    [
      "an",
      4
    ],
    [
      "crew",
      4
    ],
    [
      "and",
      4
    ],
    [
      "him",
      4
    ],
    [
      "fullbody",
      4
    ],
    [
      "yosaku",
      3
    ],
    [
      "had",
      3
    ],
    [
      "at",
      3
    ],
    [
      "by",
      3
    ],
    [
      "he",
      3
    ],
    [
      "in",
      3
    ],
    [
      "restaurant",
      3
    ]
  ]
}