{
  "chapter_number": "Episode 290",
  "title": "Uncontrollable! Chopper's Forbidden Rumble",
  "short_summary": "Chopper continues his fight with Kumadori, and reveals his Monster Point after taking too many rumble balls. \n",
  "long_summary": "After a recap of the previous episode, we see Zoro attempting to fight with Sogeking hanging onto one of his katana. Both Kaku and Jabra are not threatened by this in the least. When Zoro tries to attack them, Sogeking keeps twitching, and Zoro misses with each of his attacks, which results in Sogeking getting beaten. Zoro says they have no other choice besides using Janken to see who has to have their hand cut off and go find Chopper, while Sogeking yells out for Chopper to hurry.\nMeanwhile, Chopper and Kumadori are facing each other in the kitchen. Kumadori has just eaten a lot of food and broke out of the refrigerator, and is now very fat. Chopper sighs, commenting that he takes bad care of his body. Kumadori says to him there’s no need to worry, repeatedly, much to the annoyance of Chopper. Kumadori then proceeds to use Seimei Kikan (Life Feedback) to change to weight of his body, first losing much weight (using Shouka, meaning digest) then gaining some weight (using Kyushu, meaning 'absorb'), returning to his normal weight size using Moto Douri. Chopper is simply amazed by this, and asks if he could do it again. He does so, going back to fat, then through the process again. Chopper, even more amazed, asks him to do it again. He does it once more, but is a bit exhausted afterward.\nChopper wants to know how he did it. Kumadori gladly explains that after 1,000 years of training at sea and on mountains, breathing the wind and drinking the pure water, he passed the training of Sennin (Master). Enduring it all gave him the ability of Seimei Kikan. He then goes on to say that all humans, from the hair on their heads to the bottom of their toes, can concentrate their sense and stretch them to their limit, having complete control over their body. Chopper claims he read something about this in a book once, and also adds that this would be the reason why his hair acts like an octopus. Kumadori, deeply offended, shouts at him, telling Chopper to call him a lion.\nKumadori then proceeds to attack Chopper with Seimei Kikan Kamishibari (Life Feedback Hair Strangle), and then his hair moves erratically, attempting to grab Chopper. After a while of chasing, Kumadori uses Soru (to shave) to move above Chopper and attacks him with Shigan Cue (Cue Finger Gun), using his staff instead of his finger. Luckily, Chopper moves out of the way in time, but is surprised, as the staff wasn’t even sharp. Chopper tries to fight back with his Heavy Point form, but Kumadori uses Tekkai (iron mass) to nullify the attack. Chopper realizes he can’t defeat Kumadori unless he uses his other forms. But, since his Rumble Ball limit is six hours, and he already took a Rumble Ball, taking one now would do severe damage to his body. Also, after taking a second Rumble Ball, the transformations get messed up and out of control; and after taking a third one, he loses consciousness and fighting would be out of the question.\nThen, Kumadori lights the end of his staff on fire, and attacks with Shishi Kebab. Throwing his staff around, he quickly lights the entire kitchen on fire. Chopper, seeing no other opinion, uses the Rumble Ball, thinking the risks are high, but there’s still a chance.\nChopper then turns around at attempts to attack with Horn Point, but changes into Guard Point instead. Kumadori knocks him away with his flaming staff. After bouncing around for a moment, Chopper tries to transform into Jumping Point, but changes into Heavy Point instead. Kumadori knocks Chopper all the way back through a wall. Chopper, while lying on the ground, realizes he can’t control the transformations, but if he can just get Arm Point to come out, he could hit Kumadori with his ultimate attack. The room is on fire (Kumadori had just blow out the fire that was on his staff), and Chopper can’t afford to waste any more time on a guy that doesn’t even have a key. He had to find the number 2 key, so he can unlock Zoro and Sogeking’s handcuffs, and free them. Then he remembers, he’s here to fight for his friends, to rescue Robin. Kumadori then uses Seimei Kikan to turn his hair into many pointing hands. Chopper, not backing down, charges right at Kumadori as Kumadori attacks with Shishi Shigan (Lion Finger Gun), and proceeds to beat up Chopper.\nChopper, now full of small holes from Kumadori's Shigan attack, falls over, while Kumadori says he will not show mercy, as a lion would not permit it. Chopper's body hurts, not just from the attack, but also from the effects of the Rumble Ball. Since he has seven transformations, the odds of turning into Arm Point are one out of seven. If he can just get it, he can hit Kumadori with his strongest attack, hopefully ending the battle. With that notion, Chopper charges in, trying to change into Arm Point, but each time he fails (first time changing to Brain Point, then to Walk Point, then to Jumping Point). All this time, Kumadori keeps attacking with Shishi Kebab, hitting him almost every time. Then suddenly, Chopper changes into Arm Point without even realizing it. Without a second to spare, Chopper quickly attacks with Kokutei Roseo Michieri (Carving Hoof Sakura (Cherry Blossom) Snow-Storm). Kumadori uses Tekkai Gou (Strong Iron Mass), but Chopper attacks, breaks through it and does massive damage.\nChopper had no more energy left, and fell down. Kumadori at first falls to his knees, commenting on the beautiful sakura blizzard. But then, he suddenly gets up in a fit of rage, and attacks Chopper with “the lightning of the lion”. After knocking Chopper through a wall, he attacks him with Rankyaku Renge (Storm Leg Lotus Blossom). Just then, Chopper has a flashback of when he was living with Dr. Kureha on Drum Island.\nIn the flashback, Chopper was resting in bed, while Dr. Kureha asks Chopper what he had done. Chopper couldn’t remember anything, but Dr. Kureha said that wasn’t good enough. She told Chopper he had burned down an entire town (though no one died), and the entire island is in an uproar about what had happened while Chopper was asleep. Now, Dr. Kureha said she doesn’t mind Chopper experimenting, like his father (referring to Dr. Hiriluk), but Chopper had to take careful consideration before carrying one out. She then goes on to tell Chopper that a doctor always has a person’s life in their hands. A small mistake can turn into something you can’t take back. And if he doesn’t have the brain to take in such consideration, then he might as well quit being a doctor right then and there. Chopper, in tears, said he was sorry, and he would never do it again. Dr. Kureha just told him to hurry up and get better.\nBack in the present, Chopper is getting more and more beat up by Kumadori. Kumadori then grabs Chopper with his hair then began to take careful aim for the final blow. Just as Kumadori used Yana Gin Jou (Pure Oak Ferment), Chopper changes into his Brain Point form and, because he is desperate to try and save his friends, took a Rumble Ball for a third time. He mentally apologizes to his friends, knowing this will make him lose control over himself.\nAs he began to transform, a flashback occurs, explaining what had happened to Chopper back then. Chopper says he took three Rumble Balls and lost consciousness. Dr. Kureha says one could call it the rampage of the Devil Fruit, a terrible power that destroys allies, enemies, and also his own body. It was almost as though he was an actual Monster. Chopper slowly morphs into a form much more threatening than any other he has ever demonstrated. Kumadori looks on in complete terror as the reindeer grows into a humongous goliath towering over his flames. His eyes are glowing a bright, primal blue, and there is no sign of Chopper's intellect in control- only the wild wrath of a beast about to begin a terrible rampage. Monster Chopper roars loudly.\n"
}