{
  "chapter_number": "Episode 60",
  "title": "Those Who Soar in the Open Skies! Revival of the 1000 Year Legend",
  "short_summary": "With his last breath, Ryu calls all his fellow dragons, and the Lost Island re-surfaced. Meanwhile, Luffy takes out Nelson and his gang.\n",
  "long_summary": "Luffy tries to encourage Ryu to live after he has been taken down by the cannons. While doing that, Marines, ordered by Nelson, throw a harpoon; to their surprise, Luffy manages to grab it and send it back to the Marine ship, breaking some parts. Moments later, Ryu decisively positions himself to release a loud call to other sennenryus. Just later, it looks like Luffy can understand Ryu, and agrees that he will be giving Ryu's message to Apis. After that, Luffy sends his Gum-Gum Rocket, grabbing the neck of a Millennial Dragon passing by. He then proceeds to release his Battle-Axe aimed to Nelson's big ship. Luffy's leg is able to break down the ship into two halfs and all marines retreat running, scared by Luffy's powers.\nThe ocean nearby Warship Island, as long with Warship Island itself begin to tremble by what everyone believes is an earthquake. After that, water begins to go down and with it, an island resurfaces. To everyone astonishment, Nami figures out that sennenryus are not called by that name because of their life span, but because they are migratory creatures that come to the nest every thousand years. That nest is Lost Island, named like that because of the huge time that passes before the island is available. Sennenryus start to land and you see some of their ancestors fossilized, covered in corals. That is the so-called Dragonite that Nelson and Eric was searching for.\nAlmost finally, Ryu is laying on the ground with his head submerged on water. Apis screams because she does not want to lose him. Luffy tells Apis that Ryu died making his dream come true, but Apis responds screaming that Ryu was a liar, that he promised her once he could get to the nest, he will get better. Luffy comments to Apis that sennenryus are reborn in the nest. Just seconds later, a baby sennenryu hatches from an egg, the baby (presumably Ryu) screeches something to Apis, which she agrees. Lastly, Eric appears all soaked and Nelson is happy to see him, he proposes Eric deal, but Eric is too furious and slashes him with his Devil Fruit power. The Straw Hat Pirates look back to see what just had happened and they see Eric combing his distinctively ice cream like hair.\n"
}