{
  "chapter_number": "Episode 91",
  "title": "Farewell, Drum Island! I'm Going Out to Sea!",
  "short_summary": "Chopper joins the Straw Hats as they continue their journey to Arabasta. They get him caught up on some of the things they have faced on their journey thus far. In the meantime, Mr. 2 Bon Kurei decides to head for Arabasta after failing to locate Mr. 3 on Little Garden.\n",
  "long_summary": "As they sail away from Drum Island, the Straw Hats gaze with wonder at the sakura effect over the island. Usopp wonders why Chopper looks so distant, sitting on a railing as if lost in thought. The others are not worrying about that. Sanji says his first trip as a \"man\" is a rite of passage. His thoughts are on Hiriluk and Kureha. It does not take long before the horseplay begins, with Luffy entertaining the others with his \"nose chopsticks\" trick. Soon, the boys try to get Chopper in on the fun, with Usopp offering him a drink, Sanji inviting him to sing with them, and Luffy offering him the nose chopsticks. He crawls away, still feeling a bit overwhelmed by the attention. Nami gets Chopper's attention, and tells him that his new friends can get a little out of hand occasionally. Chopper starts to warm up to the thought of actually belonging to a group of friends.\nVivi is doting over Karoo, who she found frozen in a river. Zoro jokes by saying that he probably fell. Chopper asks Karoo about it himself, and finds out that he jumped in after Zoro, thinking he was in trouble. After hearing this, Nami hits Zoro. Chopper reveals he can talk to animals at this point. Nami is amazed at this skill in addition to his medical skills. The others ask what she means by medical skills, and find out he was trained by Kureha to be a doctor. Luffy just thought they were getting a cool talking reindeer with seven transformations. Sanji just thought Chopper was emergency food.\nAt this point, Chopper remembers his medical bag, thinking he left it at Drum Island. Nami then holds up his medical bag, telling him it was inside the sleigh. Chopper does not remember packing it, and realizes that Kureha must have put it in there, anticipating his departure. Nami gets annoyed as the boys resume their revelry. She then finds Chopper trying out the nose chopsticks. As things get crazy, Usopp proposes a toast for their new crewmate. Chopper then says that he has never had this much fun before.\nBack on Drum Island, Kureha and Dalton continue to talk. Kureha says the real miracle of Hiriluk's cherry blossoms was sending Chopper out on his own. Dalton begins talking about his plans now that Wapol is gone. He had wanted to leave to atone for his past working along Wapol, but he has since determined that he can atone better by helping to reform the kingdom. Kureha thinks he has what it takes to lead the new country.\nDalton then remembers an incident 10 years before, involving Wapol at a Levely. He remembers being impressed of Vivi's father and the king of Arabasta, Nefertari Cobra. The subject is \"Revolutionist\" Dragon and Wapol is highly disinterested in the proceedings. King Cobra calls him out for his dismissive attitude and Wapol gets mad. Afterward, Wapol gets his revenge by hitting Cobra's daughter and pretending it was some sort of accident. She got up, smiled, and forgave Wapol for the accident in public. Not long after, Dalton caught sight of her crying with Igaram over the pain. He greatly respected the child for the dignity she carried herself with.\nThe Isshi-20 who were previously commissioned by Wapol pledge their allegiance to Dalton, begging him to allow them to help the country. Someone runs up and hands Dalton Luffy's wanted poster. He says that a week before, a young man entered Robelle. He noted that, oddly, it did not snow that day. The young man was looking for Blackbeard, but missed him. He then presented the man a wanted poster, saying he was looking for a guy wearing a straw hat. He was asked that, if Luffy showed up, to tell him to look for Ace in Arabasta in the next ten days. The man is then run off when it is found he skipped out on a bill at a nearby restaurant. Recognizing the name on the wanted poster, Kureha mentions that the Will of D. is still alive, revealing that the previous Pirate King's name was actually Gol D. Roger.\nThe next day, Chopper is sitting by the bow of the Going Merry with Luffy, wondering at the vastness of the ocean. Suddenly, a giant bird flies over, and Luffy calls out to it. The bird starts to fly toward the boat head-on and swoops just above the bow, grabbing Luffy. Chopper freaks out, thinking Luffy has been eaten. Zoro tells Chopper to calm down, saying that he should not worry about Luffy unless he actually calls for help. Sure enough, Luffy grabs the giant bird's beak and uses Gomu Gomu no Propeller to bring it down. While the other guys are mad that he interrupted a card game, he presents the bird as fresh meat for Sanji to deal with. Chopper thinks the adventure was incredible. Nami then comes back, telling the guys they will be at Arabasta soon.\nThe Straw Hats get Chopper caught up on their current mission: returning Vivi to Arabasta so they can prevent a coup by Crocodile, one of the Seven Warlords of the Sea. Crocodile is abusing his authority as a World Government privateer with his Baroque Works crime syndicate to undermine the kingdom. Vivi describes the group's structure, with the five Officer Agent pairs under Crocodile, the eight Frontier Agent groups below them, and the Billions and Millions subordinates throughout, a total force of around 2,000 men. The crew reasons that, if Crocodile's goal is indeed to seize control of Arabasta, then he must be mustering the full strength of Baroque Works to the area to assist in his coup. Luffy seems eager just to beat up Crocodile.\nMr. 2 Bon Kurei has arrived at Little Garden and is punishing his navigator. They had been tasked with assassinating Mr. 3, but somehow missed him. They head to Arabasta to resume their mission. Meanwhile, back at Baroque Works' headquarters, Crocodile and his Baroque Works assistant, Miss All Sunday, discuss the growing threat of pirate attacks on Arabasta.\n",
  "characters": [
    "Monkey D. Luffy",
    "Usopp",
    "Tony Tony Chopper",
    "Roronoa Zoro",
    "Nefertari Vivi",
    "Sanji",
    "Nami",
    "Karoo",
    "Kureha",
    "Dalton",
    "Wapol (flashback)",
    "Kuromarimo (flashback)",
    "Chess (flashback)",
    "Nefertari Cobra (flashback)",
    "Chaka (flashback)",
    "Pell (flashback)",
    "Thalassa Lucas (flashback)",
    "Dragon (picture, flashback)",
    "Igaram (flashback)",
    "Isshi-20",
    "Ace (flashback)",
    "Gol D. Roger (flashback)",
    "Crocodile",
    "Mr. 1 (portrait and shadowed)",
    "Miss Doublefinger (portrait and shadowed)",
    "Mr. 2 Bon Kurei",
    "Mr. 3 (portrait and flashback)",
    "Miss Goldenweek (portrait and flashback)",
    "Mr. 4 (portrait and shadowed)",
    "Miss Merry Christmas (portrait and shadowed)",
    "Mr. 5 (portrait and flashback)",
    "Miss Valentine (portrait and flashback)",
    "Miss Monday (portrait)",
    "Mr. 9 (portrait)",
    "Mr. 11 (portrait)",
    "Mr. 13 (portrait and flashback)",
    "Miss Friday (portrait and flashback)",
    "Akumai",
    "Miss All Sunday"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "they",
      3
    ],
    [
      "to",
      3
    ],
    [
      "on",
      3
    ],
    [
      "their",
      2
    ],
    [
      "journey",
      2
    ],
    [
      "arabasta",
      2
    ],
    [
      "mr",
      2
    ],
    [
      "chopper",
      1
    ],
    [
      "joins",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      60
    ],
    [
      "to",
      31
    ],
    [
      "he",
      25
    ],
    [
      "a",
      24
    ],
    [
      "and",
      20
    ],
    [
      "his",
      18
    ],
    [
      "of",
      18
    ],
    [
      "that",
      17
    ],
    [
      "chopper",
      16
    ],
    [
      "with",
      13
    ],
    [
      "is",
      13
    ],
    [
      "in",
      12
    ],
    [
      "it",
      12
    ],
    [
      "at",
      11
    ],
    [
      "luffy",
      11
    ],
    [
      "was",
      11
    ],
    [
      "him",
      10
    ],
    [
      "for",
      10
    ],
    [
      "on",
      9
    ],
    [
      "by",
      9
    ]
  ]
}