{
  "chapter_number": "Episode 160",
  "title": "Survival Rate: 10%! Priest Satori with the Power of Mantra!",
  "short_summary": "Luffy, Sanji, and Usopp chose to enter the Ordeal of Balls gate and there they encountered the Priest Satori.\n",
  "long_summary": "Zoro, Nami and Robin continued exploring the forest when Robin brought to their attention that there is soil in their current location. They found it weird that soil is located on Sky Island which is supposed to be all cloud like. Robin went on to comment that there is a great deal of investigation worth doing on the Sky Island. The 4 Priests awaited the rest of the Straw Hats while they chose which Ordeal they have to go through. Luffy told them to go through the Ordeal of Balls and Usopp stated that the Ordeal of Balls feels less violent. He then went through the cons of each of the ordeals and settled to go by Luffy's instinct. They then agreed to choose Ordeal of Balls.\nThere, they encountered Satori, one of the four priests, and he easily overwhelmed them using his Mantra (ability to predict the opponent's move) and Impact (an attack that attacks the body inside out). Luffy told Sanji and Usopp to hurry and secure the dial ship which was almost out of sight caused by the initial attack of Satori on them. Luffy told them he was going to defeat Satori. Luffy tried his attacks, but Satori was able to see through them. Satori attacked Luffy with multiple Impact attacks and Luffy's head got stuck in a tree. Satori then went on to say Luffy was a tough one.\n",
  "characters": [
    "Roronoa Zoro",
    "Nami",
    "Nico Robin",
    "Gedatsu",
    "Shura",
    "Satori",
    "Ohm",
    "Usopp",
    "Monkey D. Luffy",
    "Sanji",
    "Tony Tony Chopper"
  ],
  "ssum_frequencies": [
    [
      "and",
      2
    ],
    [
      "the",
      2
    ],
    [
      "luffy",
      1
    ],
    [
      "sanji",
      1
    ],
    [
      "usopp",
      1
    ],
    [
      "chose",
      1
    ],
    [
      "to",
      1
    ],
    [
      "enter",
      1
    ],
    [
      "ordeal",
      1
    ],
    [
      "of",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      14
    ],
    [
      "to",
      12
    ],
    [
      "of",
      10
    ],
    [
      "and",
      8
    ],
    [
      "luffy",
      6
    ],
    [
      "satori",
      6
    ],
    [
      "that",
      5
    ],
    [
      "they",
      5
    ],
    [
      "on",
      5
    ],
    [
      "them",
      5
    ],
    [
      "is",
      4
    ],
    [
      "ordeal",
      4
    ],
    [
      "through",
      4
    ],
    [
      "was",
      4
    ],
    [
      "robin",
      3
    ],
    [
      "there",
      3
    ],
    [
      "which",
      3
    ],
    [
      "went",
      3
    ],
    [
      "a",
      3
    ],
    [
      "go",
      3
    ]
  ]
}