{
  "chapter_number": "Episode 177",
  "title": "Ultimate Test of the Ordeal of Iron! The White-Barbed Death Match!!",
  "short_summary": "Ohm makes matters worse, creating a barbed wire cage around the area. Raki is knocked out by Enel, and Nami, Aisa, and Gan Fall find out that the Python was rampaging so much because of Luffy who is inside the python too.\n",
  "long_summary": "Due to the distraction caused by Aisa and Nami getting swallowed by Nola, Ohm attacks Zoro and Wyper. Ohm counts the total number of people left and came to a total of ten men and two animals. The Shandia at the Upper Ruins become upset at Ohm and try to attack him but were defeated by Holy and killed by the piercing of the Iron Cloud. At Ohm's command, Holy ran around and created a dome-like cage in the form of barbed wires. This trapped in all the fighters, hence, called a death match. Zoro and Wyper regained consciousness and Zoro had the intent of getting rid of the python since Nami and Gan Fall have been trapped in it; likewise, Wyper worries about Aisa. Raki is on her way to notify Wyper regarding Enel and recollects the events that led to the uprising of the Shandia. Upon finding Wyper in the Upper ruins, Raki goes on right away to inform him of Kamakiri's warnings only for Enel to appear behind her.\nWyper yells at Raki to run and not attack Enel but she fires shots at him anyways, which were ineffective. Enel then attacks and defeats Raki with his Goro Goro no Mi abilities. Enel tells Wyper that he will attack his opponents, indiscriminate of gender.\nInside the stomach of the snake, Nami, Aisa, and Gan Fall are trapped and have to devise a way to escape. While discussing how they might escape, Luffy finds them. Luffy, comically crying, asks Nami how she got into the mysterious \"cave\" and Nami explained that they were swallowed by a snake. Luffy sympathized with her and she comically pulls on his nose saying they are all in the same situation. Aisa asked who the \"idiot\" was and Nami told her Luffy is their captain. She indicated that Luffy must be slow not to realize he has been swallowed. Nami went on to comment that the snake has been acting weird and in pain. Luffy asked why the snake would act that way, and they realized that Luffy has been the culprit behind the snake's behavior. Nami comically hits Luffy causing more pain for the snake, which responded by rampaging and making them fall further into its belly.\nWyper continues to attack Nola and Zoro decides to fight Ohm before going to rescue Nami and Gan Fall.\n",
  "characters": [
    "Ohm",
    "Holy",
    "Nola",
    "Roronoa Zoro",
    "Wyper",
    "Mayushika",
    "Warashi",
    "Yotsubane",
    "Tony Tony Chopper (flashback)",
    "Raki",
    "Kamakiri (flashback)",
    "Braham (flashback)",
    "Genbo (flashback)",
    "Enel",
    "Nami",
    "Pierre",
    "Aisa",
    "Gan Fall",
    "Monkey D. Luffy"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "is",
      2
    ],
    [
      "out",
      2
    ],
    [
      "and",
      2
    ],
    [
      "python",
      2
    ],
    [
      "ohm",
      1
    ],
    [
      "makes",
      1
    ],
    [
      "matters",
      1
    ],
    [
      "worse",
      1
    ],
    [
      "creating",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      24
    ],
    [
      "and",
      23
    ],
    [
      "to",
      15
    ],
    [
      "of",
      10
    ],
    [
      "nami",
      9
    ],
    [
      "wyper",
      8
    ],
    [
      "luffy",
      8
    ],
    [
      "that",
      7
    ],
    [
      "by",
      6
    ],
    [
      "in",
      6
    ],
    [
      "a",
      5
    ],
    [
      "at",
      5
    ],
    [
      "enel",
      5
    ],
    [
      "snake",
      5
    ],
    [
      "aisa",
      4
    ],
    [
      "ohm",
      4
    ],
    [
      "zoro",
      4
    ],
    [
      "attack",
      4
    ],
    [
      "fall",
      4
    ],
    [
      "been",
      4
    ]
  ]
}