{
  "chapter_number": "Episode 241",
  "title": "Catch Robin! The Determination of the Straw Hat Pirates",
  "short_summary": "Chopper reunites with the others without Sanji and they discuss what happened. Luffy decides that in order to know the full truth, they must catch Robin. Usopp attempts to repair the ship enough to withstand the Aqua Laguna, while Franky intends to capture Usopp to make Luffy come out of hiding. The Straw Hat Pirates make their way to the Galley-La Company.\n",
  "long_summary": "Back downtown of Water 7, Sanji and Chopper are still reeling over what just happened with Robin. Chopper says that he has lost her scent and Sanji tells him to meet up with Luffy and the others and explain what had happened with Robin. Sanji then says that he has a plan and will meet up with Chopper and the others later.\nIn town, Zoro, Luffy, and Nami can be seen running from a group of angry shipwrights. Nami yells at Zoro for leading the angry mob down their way but Zoro responds saying that the whole town would've found them anyway. Luffy, Nami, and Zoro head down an alleyway and manages to hide from the shipwrights. The shipwrights begin looking around in the area trying to find the Straw Hat Pirates and it is seen that Luffy is hiding the others under the bridge. The shipwrights decide to split up and they all leave. Luffy struggles to hang on and is scared into the water by Chopper who has found them due to their scent. At the Timber and Hardware store, Usopp can be seen begging for the man to sell him lumber and equipment. However, the man doesn't want to sell him anything due to him already closing the shop and Aqua Laguna coming. Usopp continues to beg and even holds out a little some of money and the man eventually gives in. Usopp struggles to take the items back to the Going Merry and the man, feeling sorry, gives Usopp some rice balls to keep his strength up. Usopp gladly takes the rice balls and leaves back for the Going Merry. Usopp looks out at the sea noticing the waves starting to rise and begins to fix up the Going Merry.\nAt Blueno's Bar, Franky can be seen causing a scene. Kokoro, Chimney, Gonbe, Blueno, and Mozu and Kiwi all want to know why Franky is so upset. Franky says that he is still angry about what Luffy did to him and how the Galley-La Company stopped him and he storms out of the bar. Back in town on the rooftops, Luffy and the others are resting just after escaping the angry mob. Luffy asks Chopper where Sanji is and Chopper decides to tell everyone what Sanji wanted to tell them. Luffy is shocked to hear this and Zoro comments on how Robin was their enemy before she joined their crew. Zoro says that it's the only way to find out the truth about Robin and they shouldn't run away. After hearing more from Chopper, Zoro says that the attempted murder on Iceburg was just a warm up and wonders all of the attention it caused. Nami sums up that Robin plans on murdering Iceburg tonight and Zoro says that Robin told Chopper what she is planning so that the rest of the crew will be blamed for the murder as well. Nami yells at Zoro for already saying that Robin is an enemy but Zoro says he is just bringing up the possibilities and says if she is his friend, he has to be ready to forgive but if she is his enemy, he has to be ready to fight. Zoro then says that the best chance to settle this is at night and Luffy and the others agree to go. Nami then remembers hearing that Robin was seen walking with a masked man and wonders if he is the reason why Robin is doing what he is doing. Luffy then says that the goal is to find Robin and capture her as it's the only what they will know the truth. However, Zoro says that capturing Robin won't be easy as the World Government has been trying for over twenty years but the others still agree to do this.\nBack in town, Paulie can be seen who is upset that it's late already and wonders where Luffy ran off to. A shipwright informs Paulie that the town will be flooded anytime soon and Paulie informs everyone that he will head into the main office while the other shipwrights head back inside. In another area, Franky is yelling out wanting to know where Luffy is. However, he gets no answer but soon runs into Zambai and the rest of the Franky Family. Zambai wonders if Franky had taken down the Straw Hat Pirates but Franky says that he got away due to the interference of Galley-La. Zambai then says that he saw the \"weak one with the pointy nose\" fixing up the ship (Usopp) and Franky gets an idea. Franky says that he will capture Usopp and use him as bait to draw out Luffy for a fight. Franky then tells the rest of the Franky Family to get the word out that he has captured Usopp and tell him to meet up in the warehouse under the bridge.\nIn a shelter, the citizens of Water 7 are preparing for Aqua Laguna's arrival while others are still worried about the Straw Hats not being captured yet. The people think that the Straw Hats have over a hundred members trying to go after Iceburg but, just outside the Galley-La Company, a whole mob of shipwrights can be seen guarding the main entrance. Inside, Paulie, along with Kaku, Peepley Lulu, Tilestone, and Rob Lucci and Hattori can be seen guarding the door leading to Iceburg's room. Tilestone annoys Lucci and Hattori with his loud voice while Peepley Lulu and Kaku know that Luffy and the other Straw Hats are still in the city. Paulie heard about Luffy breaking in earlier and, inside Iceburg's room, Iceburg and Kalifa are talking about Robin. Kalifa is disturbed about Iceburg having Robin's wanted poster up on the wall but Iceburg responds saying she is a \"demon\". Back outside, Luffy and the others position themselves in a tree and watch over the Galley-La Company. Nami and Zoro say to head inside after Robin and the masked man have done so first while the shipwrights are preparing themselves. Meanwhile, Robin and the masked man had just arrived at the scene ready to put their plan into motion.\n"
}