{
  "chapter_number": "Episode 35",
  "title": "The Hidden Past! Female Fighter Bell-mère!",
  "short_summary": "Nojiko tells the crew about Nami's childhood. Nojiko and Nami were raised by a loving adoptive mother, Bell-mère, but her village was invaded by the Arlong Pirates.\n",
  "long_summary": "Chew, Kuroobi and Hatchan investigate reports of a flying ship, finding the ship's wreckage in the paddy field. They confront Luffy, watching him taking a walk in the area.\nMeanwhile, Nojiko tells the other members of the crew about Nami's past. Both were raised in the outskirts of Cocoyasi Village by their adoptive mother, Bell-mère, who farmed mikan to survive. Being a low-income family, Nami often stole books from a local bookstore to support her passion in cartography, Bell-mère fed Nojiko and Nami while eating only mikans herself, and Nami received only hand-me-down clothing from Nojiko. Angry by the lack of money her family had, she ran away from her home and sought shelter at Genzo's office.\nGenzo explained to Nami how she was adopted. He explained that Bell-mère travelled overseas as a Marine, where she met Nojiko and infant Nami. She decided to take the two back to Cocoyasi Village, adopt them, and raise them as her own children. At that moment, Nojiko arrived, reunited with Nami, and the two travelled back to Bell-mère's house for dinner.\nHowever, Cocoyasi Village then faced an invasion from the Arlong Pirates. Arlong declared the entire island, including the village, his own domain, and all citizens would have to pay a monthly tribute to him in exchange for their lives. They eventually discovered smoke coming from the outskirts, leading them to Bell-mère's house. Nojiko and Nami feared Bell-mère would be unable to pay the tribute, rushing to their home to warn her.\n",
  "characters": [
    "Hatchan",
    "Kuroobi",
    "Chew",
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nojiko",
    "Usopp",
    "Sanji",
    "Nami",
    "Genzo (flashback)",
    "Bell-mère (flashback)",
    "Nako (flashback)",
    "Arlong (flashback)",
    "Hatchan (flashback)",
    "Kuroobi (flashback)",
    "Chew (flashback)",
    "Pisaro (flashback)"
  ],
  "ssum_frequencies": [
    [
      "nojiko",
      2
    ],
    [
      "the",
      2
    ],
    [
      "by",
      2
    ],
    [
      "tells",
      1
    ],
    [
      "crew",
      1
    ],
    [
      "about",
      1
    ],
    [
      "namis",
      1
    ],
    [
      "childhood",
      1
    ],
    [
      "and",
      1
    ],
    [
      "nami",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      14
    ],
    [
      "to",
      12
    ],
    [
      "and",
      9
    ],
    [
      "nami",
      7
    ],
    [
      "a",
      6
    ],
    [
      "nojiko",
      6
    ],
    [
      "in",
      5
    ],
    [
      "from",
      5
    ],
    [
      "her",
      5
    ],
    [
      "of",
      4
    ],
    [
      "village",
      4
    ],
    [
      "bellmère",
      4
    ],
    [
      "she",
      4
    ],
    [
      "cocoyasi",
      3
    ],
    [
      "their",
      3
    ],
    [
      "them",
      3
    ],
    [
      "they",
      2
    ],
    [
      "him",
      2
    ],
    [
      "outskirts",
      2
    ],
    [
      "by",
      2
    ]
  ]
}