{
  "chapter_number": "Episode 85",
  "title": "Dream of the Outcasts! The Quack Doctor Hiriluk",
  "short_summary": "Doctorine continues to tell how Chopper lived his life and how the quack doctor, Hiriluk, took care of him.\n",
  "long_summary": "Chopper is in a laboratory when Monkey D. Luffy enters the room startling Chopper which causes him to throw the laboratory glassware. Chopper is able to catch every single piece of glassware while the materials are falling. Luffy starts tickling Chopper because he wants to see if Chopper releases the materials. The captain then asks Chopper to become his friend and join his crew, but Chopper refuses and runs away. Sanji enters the room where Nami is resting and brings a meal for Nami with him. When Kureha enters, Sanji calls her madam and she kicks him. Meanwhile, Luffy is chasing after Chopper around Kureha, but when she hears the term nakama, she proceeds to tell a story about the only friend Chopper had, Hiriluk.\nYears ago, Hiriluk escaped from Wapol's soldiers during the Doctor Hunt. He coughed and spat blood into his hand. Inside a house, a man was sick and his wife tried to convince him to beg Wapol for the Isshi-20. Hiriluk then appeared through an explosion of smoke and tried to treat the citizen, but he refused. Hiriluk insisted and injected him with a drug obtained by a frog's essence, and the man turned green and started to croak and hop away. The soldiers arrived at the house and Hiriluk escaped through a broken window. On his way, he encountered Kureha and they had a chat until the soldiers spotted them. The quack then ran into Chopper, who was badly injured by gun shots. He tried to tend to Chopper's injuries, but the moment he brought out his tranquilizer gun, Chopper hit him. Chopper trie dto leave but Hiriluk grabbed his attention after he got naked, trying to prove to him that he would not do him any harm.\nChopper woke up in Hiriluk's place and started to feel hungry. He then grabbed some bread and in the second bite, he started to cry. After three days, Chopper talked for the first time. Hiriluk asked why he did not talk before, and Chopper explained he did not want to talk because it was not ordinary for a reindeer to talk, so he might get scared. The quack and Chopper visited the village periodically, always getting kicked out. The reindeer and the doctor got into a fight and after finishing, Chopper said it was his first time fighting with someone. Hiriluk then gifted Chopper a hat and began to tell a story about a sick man, a miracle, and cherry blossoms.\nOne day, Hiriluk kicked Chopper out of his place, shooting at him after he was outside. The doctor asked Kureha how many days of life he had left, and she told him that he had only ten days left. Hiriluk left Kureha's place and claimed that he would show Chopper that anything was possible.\n"
}