{
  "chapter_number": "Episode 11",
  "title": "Revealing the Conspiracy! The Pirate Caretaker, Captain Kuro!",
  "short_summary": "Zoro and Nami rescue Luffy and learn about Kuro's malicious intentions. Meanwhile, Usopp attempts to alert the townspeople about the incoming threat, but the people do not believe him. The crew decide to work with Usopp to battle the Black Cat Pirates themselves.\n",
  "long_summary": "Nami and Zoro head to the cliff to look for Luffy. They discover Luffy at the base of the cliff, and they head to the bottom of the cliff to wake him up unharmed. Luffy reveals to them Klahadore's malicious intents.\nUsopp runs to the village to alert others about the incoming attack, but the townspeople refuse to believe him, contrasting him to Klahadore whom they trust more. The townspeople chase Usopp out of the town. Usopp then goes to Kaya's mansion to warn her about the danger, but she also does not believe him, believing it to be an unusually cruel joke.\nUsopp attempts to escort Kaya out of the building, but is faced against the mansion guards. Although Usopp fights the guards, Kaya refuses to leave, hitting Usopp across the face. One of Kaya's butlers, Merry, shoots Usopp in the arm, and the townspeople continue to pursue him.\nMeanwhile, Kuro meets with his crew at their ship stationed at the island. He orders them to destroy the entire village the next day.\nThe crew, Usopp and the children meet at the outskirts of the village. The children express their disappointment in Usopp for lying as they leave. The crew agree to fight alongside Usopp to defend Syrup Village from the Black Cat Pirates.\n",
  "characters": [
    "Jango",
    "Kuro",
    "Usopp",
    "Monkey D. Luffy",
    "Nami",
    "Roronoa Zoro",
    "Kaya",
    "Ninjin",
    "Tamanegi",
    "Piiman",
    "Merry"
  ],
  "ssum_frequencies": [
    [
      "the",
      5
    ],
    [
      "to",
      3
    ],
    [
      "and",
      2
    ],
    [
      "about",
      2
    ],
    [
      "usopp",
      2
    ],
    [
      "zoro",
      1
    ],
    [
      "nami",
      1
    ],
    [
      "rescue",
      1
    ],
    [
      "luffy",
      1
    ],
    [
      "learn",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      27
    ],
    [
      "to",
      18
    ],
    [
      "usopp",
      10
    ],
    [
      "of",
      6
    ],
    [
      "him",
      5
    ],
    [
      "and",
      4
    ],
    [
      "they",
      4
    ],
    [
      "at",
      4
    ],
    [
      "village",
      4
    ],
    [
      "cliff",
      3
    ],
    [
      "luffy",
      3
    ],
    [
      "but",
      3
    ],
    [
      "townspeople",
      3
    ],
    [
      "crew",
      3
    ],
    [
      "head",
      2
    ],
    [
      "for",
      2
    ],
    [
      "them",
      2
    ],
    [
      "about",
      2
    ],
    [
      "believe",
      2
    ],
    [
      "out",
      2
    ]
  ]
}