{
  "chapter_number": "Episode 92",
  "title": "The Hero of Arabasta and the Ballerina on Deck",
  "short_summary": "The crew meets Mr. 2 Bon Kurei after accidentally catching him while fishing. While waiting for his ship to come retrieve him, the Officer Agent (unaware he's in the company of enemies) shows off his Devil Fruit powers. As the Going Merry approaches the coast of Arabasta, Zoro devises a plan to counteract Mr. 2's disguising ability.\n",
  "long_summary": "Puppu's ship is docked in the coast of Nanohana and his Jolly Roger is waving. His pirates are looting the place while causing a fuss. Pell, Chaka and some men are riding horses, heading to Nanohana. Suddenly, Crocodile appears on top of a building and a woman spots him. He catches the attention of everyone in the place and a lot of people start to call out his name, including Puppu, who recognizes him as one of the Shichibukai. Crocodile says he just came to get the head of Puppu, but the pirates tell him to not underestimate them. Puppu tells him that he sold himself to authority and that he is the World Government's dog. As he gets down from the building, Crocodile says that anyone who does not wish to die should lay on the ground. When Crocodile lands on the ground, Puppu and his crew stab him, however, they are unable withdraw their swords. Crocodile raises his arm, and an upside-down twister starts to form. After the twister dissipates, the pirates are seen dead, covered in sand and dehydrated. The soldiers arrive when Crocodile is already leaving.\nIn the Alubarna Palace, Chaka is presenting the information of the Puppu pirates' invasion to Nefertari Cobra.\nMeanwhile, the Going Merry goes through water vapor caused by an underwater volcano. The Straw Hats fish out and save Mr. 2 from drowning whilst inside the fog. While waiting for his ship, Mr. 2 demonstrates his Mane Mane no Mi devil fruit ability of being able to clone anyone whose face he touches with his right hand. He is able to clone everyone except for Sanji who was in the kitchen searching the storage area for something to cook for his hungry crewmates. Luffy, Usopp, and Chopper are fascinated with his power obtained through the devil fruit he ate. During this demonstration, Vivi notices that Mr. 2 has cloned her father, Cobra. Sometime later, the ship of Mr. 2 arrives to rescue him, and everyone is surprised to learn that he is actually an officer agent of Baroque Works. Since Mr. 2 was able to clone them, they wrap bandages around their arms so they cannot confuse any of them if Mr. 2 decides to disguise as one of them.\n",
  "characters": [
    "Puppu",
    "Crocodile",
    "Pell",
    "Chaka",
    "Nefertari Cobra",
    "Nami",
    "Nefertari Vivi",
    "Sanji",
    "Monkey D. Luffy",
    "Karoo",
    "Tony Tony Chopper",
    "Usopp",
    "Roronoa Zoro",
    "Mr. 2 Bon Kurei",
    "Akumai"
  ],
  "ssum_frequencies": [
    [
      "the",
      5
    ],
    [
      "mr",
      2
    ],
    [
      "him",
      2
    ],
    [
      "while",
      2
    ],
    [
      "his",
      2
    ],
    [
      "to",
      2
    ],
    [
      "of",
      2
    ],
    [
      "crew",
      1
    ],
    [
      "meets",
      1
    ],
    [
      "2",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      24
    ],
    [
      "to",
      15
    ],
    [
      "of",
      12
    ],
    [
      "and",
      11
    ],
    [
      "his",
      10
    ],
    [
      "he",
      9
    ],
    [
      "is",
      8
    ],
    [
      "crocodile",
      6
    ],
    [
      "him",
      6
    ],
    [
      "mr",
      6
    ],
    [
      "2",
      6
    ],
    [
      "in",
      5
    ],
    [
      "are",
      5
    ],
    [
      "puppu",
      5
    ],
    [
      "that",
      5
    ],
    [
      "pirates",
      4
    ],
    [
      "a",
      4
    ],
    [
      "them",
      4
    ],
    [
      "for",
      4
    ],
    [
      "ship",
      3
    ]
  ]
}