{
  "chapter_number": "Episode 271",
  "title": "Don't Stop! Raise the Signal Fire of a Counterattack!",
  "short_summary": "Kokoro contacts the Straw Hats via Nami's baby Den Den Mushi. The Franky Family decides to lower the courthouse inner bridge so the Straw Hats can go straight to the courthouse and join Luffy. After Gomorrah collapsed, Sogeking arrives with the giants as back up. Shortly after, Gomorrah stands again and tells those riding him to hold on, as he plans to take them to the courthouse. Inside the Tower of Justice, Spandam gives Kaku and Kalifa a Devil Fruit each, which they both decide to consume. Meanwhile, Luffy and Blueno continue fighting on the rooftop of the courthouse.\n",
  "long_summary": "Chimney and Gonbe are seen observing something through monoculars on top of Rocketman and calling out to Kokoro, who is drinking next to them. On the road towards the courthouse the Franky Family and the Straw Hat Pirates ride on Gomorrah's back through the Marine forces. Zambai orders Gomorrah to get off the central road, where the Marines are ready to ambush them, to avoid getting injured. Sodom is seen lying hurt on the ground behind them. Kokoro contacts the Straw Hats through Nami's baby Den Den Mushi. She tells them an important information she forgot to mention earlier; how to enter the Tower of Justice from the courthouse, which are not connected via an obvious path. The way is to move the levers that exist on the top floor of the two towers that lie on both sides of the courthouse. This action will lower a bridge that connects the two buildings. Kokoro has been aware of this information since she came to fix the system once with Tom, when he was still alive. The Den Den Mushi is passed on to Chimney who tells Nami that she saw Luffy on the rooftop of the courthouse. Before they hang up, Kokoro asks Nami to keep an eye to the Den Den Mushi in case something more comes up. Zambai then sets up a plan to move as fast as possible. The Franky family will split into two groups they will head to the courthouse towers in order to lower the bridge, while the Straw-Hats will head straight to the courthouse rooftop to join with Luffy. Everyone agrees with his plan. Unfortunately, shortly afterwards Gomorrah gets knocked down by Just Eleven Jurymen, allowing the Marines to catch up with them.\nMeanwhile, the two gatekeeper giants, Kashii and Oimo, who were previously defeated at the front gate of Enies Lobby from the combined forces of the three Galley-La foremen and the Franky Family, have now recovered and are able to catch up with the Galley-La Company. Both giants, aware of the deceit from the World Government, are now ready to get revenge which is unexpected by the Marine forces on site and the Galley-La foremen. The former seems very glad about the appearance of the giants, while the latter are completely discouraged and expecting their end. However, the tables turn when the giants reveal their purpose and Sogeking appears on Kashii's shoulders. The giants easily knock out several Marines.\nThe next scene begins with Franky and Robin, who are prisoners in the Tower of Justice. Franky tells Robin how lucky she is to have friends like the Straw-Hats who put so much effort for her rescue and followed her to as dangerous a place as Enies Lobby. He also tries to convince himself that he is not unhappy with the absence of his own friends, whose arrival has not reached him yet. A flashback starts which shows Spandam offering Kaku and Kalifa Devil Fruits with unknown powers. At first, both CP9 members seemed unwilling to consume the Devil fruits. Jabra was terrified at the sudden appearance of the Devil Fruits and ran away from them. He claimed that each Devil Fruit has a devil in it, and if a Devil Fruit user approaches the two devils of the Fruits will start fighting and the user will explode. However, Blueno explains that this is a misconception. The truth is that a person will only explode if they consume two Devil Fruits, as research from Grand Line scientists has revealed. He also showed his contempt at the misinformation a prestigious intelligence agent like Jabra spreads. Jabra accepted the fact, and overcame his fear, getting closer the Devil Fruits. The flashback ends with Spandam greedily thinking about the increased power the CP9 will achieve after his agents consume the Devil Fruits. At the present moment, the CP9 agents are gathered in Lucci's room, with Blueno only missing. Jabra tries to convince Kaku and Kalifa against eating the Devil Fruits. Kumadori and Fukurou interpreted his stance as jealousy towards any CP9 member who might overcome him in power. However, Jabra discards any such claims and explains his arguments, which are the amount of money Kaku, and Kalifa could gain by selling the Devil Fruits, the possible problems they could face from the Devil Fruits's powers and the fruits' bad taste. Both Kaku and Kalifa resolve to eat the Devil Fruits after all. Apart from their bad taste, they are not affected in any other way for the moment. Lucci appears very satisfied that they ate the Devil Fruits and urges them to understand their new powers and use them against the upcoming confrontation with the Straw-Hats, which Blueno has already started.\nThe fight between Luffy and Blueno continues, where Blueno understands that Luffy is tougher than he initially thought and tries even harder, taking into account the rubber-like nature of Luffy's body. Blueno uses his ability of making doors out of thin air, to immobilize both of Luffy's feet, thus revealing to him his Devil Fruit power. He explains that he ate the Doa Doa no Mi and splits Luffy's face in three parts, making the one which contains the eyes rotate. At that moment, it is revealed to the Straw-Hats that Luffy has begun a fight with one of the CP9 members. With everyone ready to get off from Gomorrah's back and rush towards Luffy, Chopper shouts against it. Gomorrah communicated to him that he is still capable of moving forward. At the same time, the King Bull gets up from being injured and is on the move again.\n"
}