{
  "chapter_number": "Episode 90",
  "title": "Hiriluk's Cherry Blossoms! Miracle of the Drum Rockies",
  "short_summary": "After Luffy finally convinces Chopper to join his crew, Chopper announces his intentions to join their crew to Kureha, who does not take it too well. After Chopper escapes from the Drum Castle, she decides to give the Straw Hats a beautiful farewell gift.\n",
  "long_summary": "Hiriluk swore that he would somehow make cherry blossoms bloom in Drum Kingdom, a miracle he was certain would save the nation. Kureha was skeptical, but Hiriluk was certain the vision would save his people, just as he was convinced they had saved him.\nIn the present, Chopper is sitting atop Drum Castle following the end of the Luffy's fight with Wapol, contemplating his time with Doctor, and thinking of his Jolly Roger. He also remembers how Hiriluk told him once that he should go out to sea someday, so he can see how small his problems really are. He is soon found by Luffy, who resumes chasing Chopper to make him part of the crew.\nDr. Kureha rounds up the wounded, including Dalton, Sanji and Nami, and returns them to a room. She deals roughly with Sanji's back, which he reinjured in the battle. She then asks Dalton for the key to the castle's armory. Dalton says that Wapol would have had the key, and it likely went flying along with him. Nami speaks up, eager to negotiate terms of payment. She asks Kureha to waive the medical fees for the crew and discharge her and Sanji immediately. Kureha demands all the treasure and supplies on the Going Merry as payment and that they remain for two more days to fully heal. Nami then reveals the key to the armory, which she swiped from Wapol during their encounter. Kureha takes the key and agrees to waive payment. Although she says they have to remain in the castle, she tells Nami she has a coat in her room and that there are no guards present. She also says Sanji's treatment is complete, permitting her to leave with him if she so chooses.\nChopper finally returns to the roof, thinking he gave Luffy the slip. He thinks it is best not to join the pirates. He then hears Luffy call out to him from below. Zoro and Usopp are convinced that Chopper does not want to go, but Chopper actually does. Chopper finally jumps down and confronts Luffy as Nami and Vivi drag Sanji out from the castle. Chopper tries to explain that he can never be on Luffy's crew because he is a reindeer, blue-nosed, and a monster, even though he really wants to be a pirate. As he invites Luffy to return some time, Luffy cries out for Chopper to shut up and come with him anyway. Chopper is moved to tears, finally having friends who do not care that he is different. The others smile, except Sanji, who is still unconscious, and Zoro, who says that yelling \"shut up\" is not the way to make friends.\nThe Straw Hats give Chopper some time to say goodbye to Kureha while Usopp and Luffy get the Drum Ropeway ready. Kureha is in the armory, supervising the soldiers moving the cannons outside. She returns to the room, finding only Dalton is there, who confirms that the others have left. Chopper finds her there, and tells her that he is leaving to become the doctor of the Straw Hat Pirates. She berates him, accusing him of having no gratitude for her training. Chopper says he is every bit a man as a reindeer, but Kureha starts to throw her ornamental arms at him, saying he will only leave if he passes through her. Chopper runs away, with Kureha chasing him through the castle.\nAs they run, Nami wonders about the commotion growing in the castle. Chopper goes to Walk Point and hitches into Kureha's sleigh. Kureha yells to him as he pulls out of the castle that he is following a crazy fantasy just like Hiriluk. Chopper thinks she is wrong because Hiriluk completed his research before he died. He calls out to the Straw Hats to get into the sleigh, arriving right when Usopp finishes preparing the ropeway. The nearby villagers look into the sky finding an apparent flying reindeer. In reality, Chopper is running down the ropeway with Kureha's sleigh and the Straw Hats towing Luffy behind. Chopper contemplates happier times during his medical training as he runs away. Sanji comes to as they get to ground and run for the shoreline. Kureha watches from the top of the ropeway, and Dalton joins her. She says that her pet simply ran away and that she simply does not like long goodbyes. She tells Dalton to join her by the assembled cannons, so she can give Chopper and the Straw Hats a proper send-off.\nChopper wonders if Hiriluk really completed his research, or if he was just lying to make Chopper feel better at the end of his life. A flashback shows Hiriluk explaining his research to Kureha. The people outside the Drum Castle fire the cannons, leaving the villagers to wonder if the battle is resuming. Chopper stops and watches as something incredible happens. Hiriluk explained that the dust he created would color the snow, turning it into a pink color. Fired above the mountain, it makes the mountain look like a gigantic sakura tree, with the snow looking like falling petals. Kureha still does not understand what Hiriluk was thinking. Upon seeing the fruition of his father figure's work, Chopper bursts into tears. The people in the kingdom are moved as well and Kureha bids Chopper one last farewell.\n"
}