{
  "chapter_number": "Episode 65",
  "title": "Exploding Santoryu! Zoro vs. Baroque Works!",
  "short_summary": "Zoro finally defeats the Millions and the agents and Nami wakes up and went to find treasure that led her outside. But Mr. 5 and Miss Valentine arrive to arrest Mr. 8 and Miss Wednesday as they are important members of Arabasta kingdom and they knew the Boss' secret.\n",
  "long_summary": "The Billions of the Baroque Works confused on why Zoro disappeared, they started to look for him when suddenly Zoro was right in the middle of the crowd looking up at the roof he was from. The people around him started shooting but they ended up shooting each other as Zoro once again disappeared. Mr. 8 commanded them to kill him because he is just one swordsman. Suddenly, Zoro was back-to-back with Mr. 8 and Zoro slides his sword through Mr. 8's hair. Zoro asked Mr. 8 if adding only one grave is enough. The Billions found Zoro on Mr. 8's back and as they were to shoot him, Mr. 8 shot them with his trumpet fearing he would be shot, too.\nIt is revealed where Zoro is disappearing to as he is seen hiding on a wall. Mr. 9 was convinced that they have to deal with him themselves. Meanwhile, in the bar, Nami is awake and was really not drunk. She discovered that the \"welcoming town\" is a nest of bounty hunters. Outside, as Zoro attempts to test Yubashiri and Sandai Kitetsu, his 2 new swords, a Billion on the roof of the building Zoro was hiding found him and shot him. Zoro dodged the shot and went inside the house but many Billions was outside and started shooting him. He flipped a table and went behind it like a shield. He started using Yubashiri and cut the people on the door. He appreciated its lightness. He went up a ladder to a roof of another building and found a Billion with a bazooka who shot him immediately the instant he went up. But Zoro dodged it quickly.\nMiss Monday, on another roof behind Zoro, threw a barrel of wine at him and Zoro turned around and cut it in 4 pieces. He said that the wine was wasted as the 4 cut parts of the barrel hit the Billions behind him. Another Billion attempted to hammer him behind but his other sword, Sandai Kitetsu, rashly responded without Zoro commanding it. Zoro is now convinced on why it is cursed. A child tried to attack him and lost but his \"mother\" went to him praying to God for divine protection when suddenly they put up a cross and smoke went out of its center. The nun and the child had easily lost as Zoro was behind them already, but he used the back of his sword. The Billions went inside the bar and stepped on Usopp and Luffy. Usopp woke up but slept again and asleep Sanji held his arm when they were spread as he mistook it as a lady's arm. Nami is searching for treasure but she only found little.\nZoro is at the very top of a building and the Billions thought they cornered him but as a Billion climbed up a ladder, he flipped the ladder and jumped to another roof and did Hawk Wave to the Billions there. Billions started jumping to him but he walked away and warned the Billions that he cut a hole on the roof and the Billions did fell down. Zoro nearly got hit by a ladder because of Miss Monday. Miss Monday threw the ladder and wore her brass knuckles. She put Zoro down the ground and did Kairiki Meriken (\"Superhuman Strength Fist\") punching Zoro on the head. The roof cracked and the agents told it was \"The End\". As they were about to walk away, Miss Monday screamed and Zoro is seen holding her head with only one hand effortlessly. Mr. 8 said that the Marines made a mistake on the wanted posters and they thought that Zoro was the captain worth 30,000,000. Mr. 9 tells Zoro that the lower the number of codename, the stronger the member. With the three of them given a single digit codename, he told him that the Billions he took out was not close to their strength.\nMr. 8 tried to shoot him with shotgun trumpet and Mr. 9 went up while Miss Wednesday called for Karoo. Karoo let out his hand thinking that Miss Wednesday wants to handshake but Miss Wednesday told her to \"come here\". Miss Wednesday told him to run but he sat instead. Mr. 9 is on the roof higher than Zoro's position and did Nekketsu Nine Konjou Bat (\"Hot Blooded 9 Guts Bat\") flipping over while going down and brought out 2 black baseball bats. But with one sword, Zoro can easily hae the advantage. Zoro taunted Mr. 9 and he attempted to jump back to prepare but instead fell down because it was the edge of the roof already. Zoro asked if there is anyone better and Miss Wednesday, behind Zoro, answered that would be her while calling Zoro Mr. Bushido (a warrior code of honor). She did Miwaku no Kousui Dance (\"Alluring Perfume Dance\"). Zoro knelt down because the perfume was very stinky and Miss Wednesday brought out her Kujakki Slasher (\"Peacock Slasher\"). Miss Wednesday commanded Karoo to run but he went straight past Zoro and fell to the ground. Mr. 8 tried to shoot him but he dodged at the same time went through a hole and went out the building. Mr. 9 woke up and did Kattobase Shikomi Bat (\"Home-Run Training Bat\") and one of his bats extended and tied up Zoro's arm. Miss Wednesday told Zoro not to move or Luffy will be killed as Luffy is held still sleeping and Miss Wednesday is holding a knife. Cannons started to pluck out of Mr. 8's hair and shot Zoro. Zoro dragged Mr. 9 and got shot instead and dragged him to Miss Wednesday and Karoo.\nHe jumped at Luffy's very fat stomach and went up to the roof where Mr. 8 stands slashing through him. Luffy woke up wondering why he is outside but went asleep again. As the Unluckies was going to attack some escaping Billions, Mr. 5 and Miss Valentine stopped them and instead attacked the Billions bombing them. Mr. 8 and the others were found by Mr. 5 and Miss Valentine and insulted on how pathetic they were. Mr. 9 thanked them thinking they were here to back them up but their real mission was to eliminate the agents who are important members of a certain kingdom because they know the Boss' \"secret\". Mr. 9 told them that he was not really a king and his crown was just his style but they were referring to Miss Wednesday who is the currently missing Princess of Arabasta Kingdom. Mr. 8, now revealed to be the Captain of Royal Guard of Arabasta named Igaram, shot them with his cannons. Mr. 5 and Miss Valentine was unharmed and told Igaram and Princess Nefertari Vivi (Miss Wednesday) that they are under arrest.\n"
}