{
  "chapter_number": "Episode 196",
  "title": "Emergency Official Announcement! Notorious Pirate Ship Infiltration!",
  "short_summary": "The Marines are convinced the Going Merry is a ghost ship after it crashes inside their fortress from above. The crew members are scattered around the premises.\n",
  "long_summary": "To open Marines are heard singing 'I don't know but I've been told' while patrolling on a bridge. One of them says that he has heard a rumor about how other marines think that their base has gotten soft because they haven't seen action. Another vehemently argued that that is not true.\nMeanwhile a damaged marine warship was being fixed at a dock where workers were complaining that the ship would take a week to fix while another states that they had 3 days. In the background Mekao is seen drinking, muttering that in the old days people used to treat their ships with respect. He then gasped and dropped his bottle as he saw the Going Merry falling from the sky and shouted for everyone to look.\nThe ship is shown falling and Marines sounded the alarm saying that they are under attack from the sky. The Marines then get to their stations and then see the Going Merry and associate it with the Straw Hat Pirates.\nA lower ranking marine then goes and tells Lt. Commander Drake that pirates have invaded. He asks where Comm. Jonathan is, to which he replies he doesn't know.\nJonathan was then shown fishing Usopps's sniper goggles out of the water as he stared at the Going Merry while the Marines tell the Straw hats that resistance is futile and they can't escape.\nIn the kitchen, two cooks were talking about the commotion outside and get slapped with a ladle by the head chef Jessica who yelled at them for wasting time that they could be spent on preparing food for the soldiers at the base.\nJonathan was then shown walking into his office where Drake was waiting for him. Drake asked where he had been as Jonathan threw his fishing rod and hat into Drake's arms saying he didn't catch anything. Drake begins to tell him if he is absent all the time it causes problems, but was stopped by Jonathan. A marine comes to report that all the eyewitnesses claim they saw a ghost and that the ship must be a ghost ship. Drake berated the marine to report something of significance and to only come back with something useful.\nThe Marines started investigating the ship and Jonathan noticed odd things for a 'ghost ship' such as the tea being set out and the books being well kept. Then a marine informs him of treasure that they had found on board. A south bird makes its eerie noise to which Jonathan tells people to calm down as it is just a silly looking bird, to which the bird attacks him and flies away. He told his men to keep up the good work and to continue investigating the 'ghost ship'.\nJonathan, walking with other higher ranked marines, begins to connect the dots about the coffee flavor and color being similar to Jaya coffee, the gold on the ship and the legend of a gold city on Jaya, along with the South Bird saying that its not a ghost ship and that the other men were 'too green' to deal with the situation so he kept up the ghost ship idea. Drake offered to start a searching party which Jonathan immediately shuts down and says to begin searching at first light and warned them to check everyone as they could camouflage themselves to look like marines.\nChopper is shown hiding behind a tree wondering where everyone is. Zoro surfaces in the water and dodges an oncoming ship, while Nami is shown hiding her waver in a field of tall grass. Sanji, hiding in a tree, hopes that Nami and Robin are okay when a patrolling marine shoots at him, claiming he saw a light. As they walk away Sanji got mad saying he can't even smoke in peace to himself. Luffy is seen trying to pick a passage that will lead him to meat wishing he had Chopper with him to smell it for him. Usopp and Robin are shown together as Usopp finds his googles. Robin uses her Devil Fruit to spy on the marines who are talking about the ship being a ghost ship and how the gold must be cursed. \nJonathan, reclining in his office, is seen thinking about who is on board and what jobs they have. \nChopper, to get away from Marines, throws trash out a window to distract them. Nami is wondering where they landed and Robin tells Usopp the main priority is to find out how to escape. Luffy is then shown literally shadowing a marine while Sanji thinks about how stupid he is being and how he never takes things seriously.\nTo end Jonathan is shown wondering why the Straw Hats are at the base and that he will just have to wait and see.\n"
}