{
  "chapter_number": "Episode 240",
  "title": "An Eternal Farewell? Nico Robin, The Woman Who Bears Darkness",
  "short_summary": "In a bar, Franky was talking with Kokoro about her theory on who shot Iceburg. The rumors she spoke of seemed to have some truth as we saw Robin meet with someone from an organization called CP9. While the Straw Hat Pirates crew hid from angry residents, Sanji and Chopper discovered Robin and she told them what they feared: she was responsible, and she wants to part ways with the crew.\n",
  "long_summary": "In his room and still holding a gun to Luffy, Iceburg demands Luffy to bring Robin to him. However, Luffy says that is impossible as he doesn't even know where Robin is himself. Suddenly, a gun shot is fired off and the other shipwrights of Water 7 rush over to Iceburg's room. As the shipwrights enter, it is revealed that Iceburg indeed fired the shot but Luffy had already gotten away. Iceburg then tells the shipwrights to arrest all of the Straw Hat Pirates losing all hope for a direct answer. The shipwrights began to run out as Luffy watches from outside with Nami questioning him about his conversation with Iceburg. Luffy confirms Iceburg's story that Robin shot him but Nami is confused at this. However, Luffy refuses to believe that Robin would try and kill somebody.\nAt the Steam Train station, Chimney and Gonbe depart from the train with Kokoro following behind. The three begin to walk around and Kokoro starts to talk with a nearby conductor wanting to know what is going on. The conductor informs her that everyone of Water 7 is looking for the Straw Hat Pirates as they were believed that they attempted to murder Iceburg. Kokoro is shocked to hear this while Chimney looks at the newspaper recognizing the Straw Hats. Back at Dock One, Luffy is seen jumping from a high building while holding Nami. He quickly stretches his arm out to grab onto something and lands on top of another building. Nami attacks Luffy for doing that but Luffy reminds her that they couldn't take the elevator due to the shipwrights looking for them. Nami then notices how the climate is changing and the wind is picking up knowing a typhoon is coming. She then concludes that Water 7's weakness is flooding but agrees to head back to the Inn for now.\nAt Blueno's Bar, Blueno can be seen polishing a glass and Franky, with Mozu and Kiwi, suddenly barge in. Blueno welcomes Franky and Franky needs him to fill up his bottles. Blueno then asks if Franky has money but Franky thinks he has already spent it all. Mozu and Kiwi reveal that they still have a lot of money left over and this disappoints Franky wanting to spend all the money in one day. Franky then treats all the other people in the bar to free drinks and sits down wanting to know where his bottles of cola are. Kokoro then starts to talk to Franky and the cyborg is surprised to see her. Franky expresses his anger about Luffy ruining his days but Blueno appears with Franky's bottles. Franky then stuffs the bottles into his chest and regains his energy. Franky asks Kokoro why she's there and Kokoro says that Aqua Laguna is coming. Kokoro reminds Franky to prepare his house but Franky responds by saying he doesn't have a house anymore. Kokoro then brings up Iceburg being shot and Franky knows about this saying Galley-La and the other citizens are looking for the pirates that did that. Kokoro then says that the pirates didn't try to murder Iceburg but an organization called CP9 are the culprits. Kokoro continues saying that CP9 never really show themselves and Franky wants to know if she has any proof of this. Kokoro then says it's just rumors which angers Franky. However, Kokoro continues saying that they are good at eliminating people without anyone else noticing. At a secret location, a man can be heard talking to Robin who compliments on her attempted assassination of Iceburg. The man then tells Robin that all the citizens of Water 7 are after her but then says that they will infiltrate Iceburg's home at night. The man also says that Iceburg is the last of Tom's Workers that is still alive and that he has something he wants.\nBack out in the main area of Water 7, an announcement is being broadcast telling everyone to prepare for Aqua Laguna. More people can be seen boarding up their homes and tying down their boats with another man saying that the pirates will show up soon. Shipwrights are looking for more of the Straw Hat pirates and Zoro can be seen hiding in an alleyway. Zoro is confused to why the shipwrights are chasing after him and a newspaper suddenly flies onto his face. Zoro reads the paper and is shocked to read that he is a culprit in the attempted assassination of Iceburg. The shipwrights overhear Zoro and begin to surround him. Back at the Inn, the shipwrights are questioning the manager with him saying that the Straw Hats were staying at his inn but suspect that they may come back due to them leaving their luggage behind. At the Going Merry, the shipwrights begin searching around. One of the shipwrights questions another about the ship being theirs and the other shipwright confirms it due to their flag. However, another shipwright inspects the ship and says that it's too badly damaged to sail anymore. Usopp can be seen hiding behind a large rock preparing to fire. The shipwrights conclude that the Straw Hat Pirates abandoned the ship and they leave. Usopp is left to wonder who those people were and wonders if anything is going wrong in the city.\nBack in town, Luffy and Nami can be seen sneaking around in the alleyways. Nami then worries about the others but says that Sanji and Chopper are safe due to the people not knowing their faces. Sanji can be seen watching over the Sea Train departures with Chopper close by. Chopper wonders if Robin got on a Sea Train and Sanji hopes she hasn't due to the size of the city. Sanji then asks a nearby person if he has seen Robin. The man simply replies that he would've turned her in due to her being an assassin. Sanji and Chopper then start to worry for the others especially with Aqua Laguna coming soon. Suddenly, Chopper begins to pick up a scent and starts to follow it. Chopper begins to run faster with Sanji trying to keep up. Eventually, both Chopper and Sanji spot Robin on the other side of the water and wonders where she has been. Sanji hopes that Robin will come back and tries to find another way to get to her side but she tells him not to. Robin then says that she won't be coming back to the Straw Hat Pirates and Sanji thinks it's because of the newspaper and says that he doesn't believe it. However, Robin confirms that she did try to kill Iceburg and explains that she has a darkness inside her. She warns Sanji and Chopper that the darkness will be the end of them. She says that the situation will get worse and thanks them for all the kindness they have shown her and turns around to leave. Sanji and Chopper are in shock as they watch Robin walk away. Sanji jumps into the water to go after her while Chopper calls out to her name.\n"
}