{
  "chapter_number": "Episode 184",
  "title": "Luffy's Fall! God's Judgment and Nami's Desire!!",
  "short_summary": "Enel does another trick by creating a ball of gold from the ship and attaches it to Luffy's arm. Luffy falls from the ark with the ball stuck on his hand. Nami starts fighting Enel while Sanji and Usopp try to rescue her.\n",
  "long_summary": "As the episode begins, Luffy finishes his Gomu Gomu no Rifle attack on Enel and punches him into one of the golden walls of Ark Maxim.\nAt that moment, Ark Maxim gets unstuck and starts rising in the air. Aisa and Pierre who are flying to the side watch and panic about what to do. A bleeding Enel gets back up and gives a big speech about how once he beats Luffy, he will be able to have his own world where he is feared and worshiped again and nothing is impossible because he is God.\nThe people of Angel Island are still fleeing and some of them notice in disbelief of the Ark flying in the sky. They notice the black clouds are coming out of it and surmise God must be on board. On some clouds further away, the Shandia are gathered and notice the Angel Islanders boarding so many boats and wonder what is going on. A boat approaches and an Angel Islander on it warns the Shandia that the land is on the brink of destruction and they should board their own ships immediately as well to flee to the Blue Sea.\nRobin has started to move Chopper and Zoro's bodies and sees the Ark in the sky. She immediately guesses this is Enel's doing. Enel tells Luffy that the Angels will soon perish and nothing can stop him. Luffy lounges at Enel but Enel uses his electricity to melt some of the gold wall and traps Luffy's hand in the extremely hot golden ball that was formed. Enel tells Luffy that he will not bother continue fighting him and rolls the balls off the flying ship. Thanks to his stretchy arm and the side wall of the ship, Luffy resists but the ball in which Luffy's hand is encased is pulling him down like an anchor. Enel tells Luffy that now that Luffy is restrained Enel is supreme again. Angrily, Luffy tells him that down on the Blue Sea, there are plenty of other people with similar abilities that can beat him too. A furious Enel uses his spear to destroy the shipwall Luffy was using to resist being pulled down and Luffy starts to fall into a massive hole below. Luffy curses Enel and screams at him to actually fight.\nAisa and Pierre see this and starts flying near Luffy to help him. Enel notices them and realizes they are the two extra voices he could feel. He then proceeds to launch a \"God's Judgment\" thunderbolt at the three. Nami screams in despair. Conis on her waver sees the Ark and guesses that this is what the Enforcers were being forced to build. She flashbacks to Nami showing her the meeting point of the Straw-Hat Pirates on the Northeast coast of the island and decides to go there and reach the Going Merry to guide them down to the Blue Sea once they all gather back there - as only she can tell them how to escape Skypiea.\nSanji is speaking in his sleep and is having a beautiful dream where he is in paradise with Nami. In his sleep, he starts to cuddle with Usopp and wakes up horrified and disappointed as he wanted to stay in the dream with Nami. Now up, he wonders where Nami is and bolts onto the deck. He sees the ark in the air and is surprised and some kind of \"special ability\" allows him to see from afar that Nami is on board. He does not understand what is going on. Sanji wakes Usopp up and tells him to get ready to rescue Nami. Usopp is confused but remembers God's appearance on the boat. Sanji feels guilty about being unable to prevent Nami being kidnapped by God. Sanji shows Usopp the Ark and both are confused. What is going on? Where is everyone? All Sanji knows is that Nami was on the Ark and she wasn't wearing her T-shirt. Sanji and a reluctant Usopp run into the forest to try and board the Ark before it gets away too far from them. Sanji wants to use Usopp AAaaaAAAaaaAA, the belt with a rope and a hook that Usopp used earlier in the Lost Forest.\nEnel retells Nami his plans to destroy Skypiea and ascend to Fairy Vearth using Ark Maxim. He also tells himself he needs to get the Golden Bell that Robin had mentioned to him earlier first. Nami looks upset and Enel asks her about the future she desires now that she has survived that long. She tells him that there is plenty that she wants to have and wants to do but if she follows Enel, she will be alone. Without her friends, then there is nothing that she actually wants. Enel assumes that must include her life as well.\nConis is now on the Going Merry and asks Su what is going on and why Sanji and Usopp are gone. Su tells her of their plan to jump in the Ark to save Nami and Conis thinks that this is too dangerous because of the injuries they sustained.\nSanji is on a high rock as the Ark is flying over them and despite Usopp's bout of \"can't-go-to-high-places\" disease, they launch the Usopp AAaaaAAAaaaAA and Sanji kicks it toward the Ark. Enel lectures Nami about her foolish decision to forgo her only chance to survive and tells her the only place she can go upon leaving the ship is the afterlife. Sanji is climbing the rope that is now hooked onto the lower decks of the Ark while Usopp - who is wearing the belt at the other end of the rope - is dangling in the air and screaming below. Sanji says that if God Enel harms Nami, Sanji will have to turn into the Devil of the Blue Sea.\nNami is facing Enel and is pumping herself up. She tells herself she will put everything she has to survive this and, thinking of the rest of the crew, she wants to be able to sail the sea with them one more time. As the episode ends, we see Enel standing up while Nami looks at him with a determined look on her face... and holding the Clima-Tact behind her back.\n",
  "characters": [
    "Monkey D. Luffy",
    "Enel",
    "Nami",
    "Pierre",
    "Aisa",
    "Shandia Chief",
    "Nico Robin",
    "Tony Tony Chopper (K.O)",
    "Roronoa Zoro (K.O)",
    "Conis",
    "Pagaya (flashback)",
    "Sanji",
    "Usopp",
    "Su"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "enel",
      2
    ],
    [
      "ball",
      2
    ],
    [
      "from",
      2
    ],
    [
      "and",
      2
    ],
    [
      "to",
      2
    ],
    [
      "does",
      1
    ],
    [
      "another",
      1
    ],
    [
      "trick",
      1
    ],
    [
      "by",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      72
    ],
    [
      "and",
      53
    ],
    [
      "to",
      42
    ],
    [
      "is",
      36
    ],
    [
      "that",
      23
    ],
    [
      "of",
      21
    ],
    [
      "enel",
      19
    ],
    [
      "on",
      18
    ],
    [
      "she",
      16
    ],
    [
      "nami",
      16
    ],
    [
      "in",
      15
    ],
    [
      "he",
      15
    ],
    [
      "ark",
      14
    ],
    [
      "luffy",
      13
    ],
    [
      "him",
      13
    ],
    [
      "sanji",
      13
    ],
    [
      "a",
      12
    ],
    [
      "her",
      12
    ],
    [
      "tells",
      10
    ],
    [
      "usopp",
      10
    ]
  ]
}