{
  "chapter_number": "Episode 3",
  "title": "Morgan vs. Luffy! Who's This Mysterious Beautiful Young Girl?",
  "short_summary": "Luffy and Zoro battle and defeat Morgan, Helmeppo and the Marines. Koby parts ways with Luffy to join the Marines, and Zoro joins Luffy's crew as a permanent crew member.\n",
  "long_summary": "Luffy returns the katana to Zoro, who uses them to free himself and repel the Marines' attacks. He agrees to join Luffy's crew should he survive. Despite being clearly overpowered by Luffy's Devil Fruit power and Zoro's Three Sword Style, Morgan orders his men to attack them.\nMorgan himself joins the battle, with his right hand being replaced by an axe blade. Despite Luffy overpowering Morgan, Helmeppo holds Koby hostage, threatening to shoot him. Meanwhile, as Luffy is distracted, Morgan attempts to attack him from behind. Luffy punches Helmeppo in the face and Zoro cuts Morgan down, preventing him from harming Luffy. The Marines, who were aware of Morgan's numerous abuses of power, decide not to continue the battle, instead dishonorably discharging and arresting their own captain.\nLuffy, Zoro and Koby go to a restaurant to celebrate their victory. Koby explains how the world is divided. The world is divided into west and east by a continent called the Red Line, and the Grand Line is a linear sea perpendicular to the Red Line. Legendary pirate Gold Roger claimed he had hidden his treasure at the very end of the Grand Line.\nRipper, the Marine who had succeeded Morgan as the new base commander, confronts Luffy. He agrees to accept Koby into the Marines upon his request. However, due to Luffy and Zoro's statuses as pirates, he orders them both to leave the town, only promising not to inform headquarters as a gesture of gratitude. Luffy and Zoro agree, and they both continue their travels.\nMeanwhile, a girl searches the Marine base for a map of the Grand Line. She discovers that the map had been stolen by another pirate, Buggy. She sets sail to confront Buggy and retrieve his map.\n"
}