{
  "chapter_number": "Episode 133",
  "title": "Inherited Recipe! Sanji the Curry Iron Chef",
  "short_summary": "The Going Merry runs into several Marine Ships in some fog, and the Straw Hat Pirates meet a trainee Marine chef named Tajio. Sanji helps him out of a bit of cooking trouble.\n",
  "long_summary": "Luffy sits at the head of the Going Merry while Usopp uses his goggles on top of the ship trying to see through the fog. A ship appears in front of them and he realizes it belongs to the Marines, causing him to become uneasy. More of them start popping up and Nami suggests that the Marines are probably having a hard time seeing through the fog as well, with Robin agreeing and saying that there is probably nothing to worry about. Sanji then spots a child standing on one of the Marine ships and the child gets startled by seeing the pirate's flag, to which he passes out and falls overboard. Sanji begins to jump to save the child but Robin insists that she should save him using her devil fruit powers to reach the boy and bring him to safety. The boy, startled by seeing the strangers, says that they are probably planning on attacking the Marines. Luffy declines the accusation and Sanji brings some soup out for the boy. The boy accepts after a moment of observation and happily enjoys it, then he introduces himself as Taijo, one of the probationary cooks for the Marines.\nPrior to falling off of the boat, Taijo explains that recently he was carrying a pot full of soup when he tripped over a broom and spilled it. He apologized to the Chef who told him to make another one if he truly meant it. Taijo agreed but he wasn't able to make it very good and Nami asks him if he has any experience. He answers her by saying that it has only been six months since he started as a probationary cook. Sanji says that it is long enough for him to have learned something. Taijo disagrees and reveals that this entire time he has only been washing dishes and peeling some items, he's never made actual food yet. He then adds that the soup wasn't being prepared for any ordinary lunch, but a special lunch consisting of all Marine Captains. Sanji tells him to just apologize again, but Taijo reveals that if he doesn't make a new soup he will be kicked off of the ship. Luffy asks why he can't just cook on land and Nami asks if this particular ship means anything. The boy smiles and asks if any of them have heard of the All Blue, which interests Sanji as the boy explains what he knows about it to them.\nAfter Nami says that he should head back to his ship, Sanji offers to help him out, then he asks Luffy to lend them a hand in returning to the ship. Luffy stretches his arms as Nami questions Sanji about helping and he explains that he just wants to check out the Gally on the Marine Ship. They hold onto Luffy and like a sling shot he shoots them towards the ship; but when he decides to join them Sanji angrily asks for an explanation. Luffy responds by asking Sanji how he planned on returning to the ship without him. Taijo then shows Sanji where the Gally is and Sanji takes note of how expensive everything looks. Suddenly, hearing a noise nearby, Taijo approaches the pantry to find Luffy making himself comfortable with the various items and when Sanji asks him what he was doing, he lies and claims that he was exploring. Before he can leave Sanji forces him to empty his pockets. He then begins to tell Taijo about his time when he was younger, back when he had the same job as him. His chef told him that he will never learn anything by doing the chores all the time and this makes Taijo realize that the Chef didn't teach him not because he didn't want to, but because he wanted him to learn through observation. Taijo recalls that the Chef was making curry and he starts to remember the steps to make it.\nMeanwhile, Luffy admires the huge ship's mast, touching it until he hears two Marines approaching. To avoid detection he pulls himself to the very top and hangs from it until they pass.\nTaijo is able to slowly remember everything the Chef did to prepare the curry and he slowly makes some, having Sanji try it. Sanji gives critique and reminds him that cooking cannot be rushed, which makes Taijo remember the Chef explaining the process to him with fine detail. He tries to use this to improve the curry, but Sanji spots another mistake, and he assists him with some advice.\nIt's then Luffy gets spotted by a Marine that is on lookout.\nWith a little more help, Taijo prepares the curry perfectly and he thanks Sanji as they spot Luffy currently being chased. He stretches out his arms and prepares to leave as Sanji tells Taijo that he thinks the Great All Blue is out there too, then he holds onto Luffy allowing them to escape before the Marines can arrive. Taijo smiles as the Marines approach to ask if he saw anyone suspicious. He claims he didn't and suggests that the fog might have been playing tricks on their eyes.\nLuffy and Sanji are back with the Crew and Nami gets mad that Luffy got caught by the Marines as this could have gotten them into trouble. Usopp angrily chews him out for damaging the Going Merry and reminds him that they need to be more careful with it.\n\n"
}