{
  "chapter_number": "Episode 262",
  "title": "Robin Struggles! Sogeking's Clever Scheme!!",
  "short_summary": "After hiding under Robin's cloak for a few episodes, Sogeking finally shows himself. They stumble into the room with the CP9 and meet with Sanji and Franky. Sogeking produces a smokescreen. The four head into another car, detach it, and escape. It is not long before Blueno pulls their car back, though. Franky knocks down the wall so they can escape but ends up on the enemy car. Blueno opens a door back in the Straw Hat Pirates' car.\n",
  "long_summary": "Sanji and Franky have just defeated their opponents and enter train car 2 where the CP9 agents are. Kalifa comments on how loud it has gotten and Blueno and Kaku say how they underestimated the intruders. Franky warns Sanji that CP9 uses some \"weird moves\" and Rob Lucci walks toward Nero kicking an unconscious Wanze away. Lucci wants to know who the man is and Kaku says that according to Corgi, he's the newest member of CP9: Nero. However, Kaku says that Nero only knows four of the six powers and Nero gets up saying how he is going to take down Franky. Lucci speaks up and Nero recognizes him. Nero apologizes for not introducing himself but decides to kill Franky. Lucci says that Franky must be kept alive and that Nero has let his emotions get the better of him. Lucci says that he'll give Nero three seconds to try and escape but Nero nervously says he doesn't know what's happening.\nLucci reaches \"3\" and Nero attempts to run away using Soru but Lucci quickly catches up to Nero and stabs him in the back using Shigan. Lucci says that in order to be a member of CP9, one must master all of the six powers and sends Nero crashing out the window and into the water. Lucci then tells Kalifa in their report, Nero was too weak to be a member. Sanji is surprised at what just happened and Franky says that he can't tell what side is evil. In train car 1, Corgi continues sniffing at Robin. Robin comments on how Corgi has bad matters but Corgi says he's just doing his job. Corgi notices a pair of legs and tells the pirate to come out. Sogeking comes out and pulls his weapon at Corgi's face. Sogeking introduces himself and Corgi says that he won't get away with that. Corgi attempts to run away calling for Lucci's help but gets shot down by Sogeking. Lucci knows that Sanji is there to save Robin but says it's a mistake. Lucci then says that some people were born better off dead and also says that a sleeping devil exists. Lucci asks Sanji that even if that person is an eight-year-old child, that person should be put to death. Sanji tells Lucci to get to the point and Lucci says that was the story of Robin he just told. Lucci says that the only good Robin can do is to die, as her life is an entire curse. Lucci says that she should've died twenty years ago but her dying soon is good enough. Sanji angrily kicks at Lucci who easily blocks it and Sanji doesn't want to hear anymore. Lucci adds that the World Government will likely spend several years interrogating and tormenting Robin to extract and erase all her secrets.  Sanji says that he will not let that happen but, suddenly, Robin with Sogeking enter into train car 2. Sanji is excited to see Robin again and says he'll beat up CP9 and they can escape together. However, Robin uses her powers to send Sogeking flying and Sanji asks why she did that. Robin stares on with a blank expression after saying to Sanji that her words mean nothing to him.\nSanji, Franky, and Sogeking are shocked at Robin's reaction and Lucci starts laughing evilly. Sogeking suddenly tells Franky to detach the train cars telling Franky and Sanji to run. Sogeking tosses down a smoke bomb that actually stuns CP9. Taking advantage of the distraction, Sogeking grabs Robin and runs toward the previous train car. Sanji and Franky compliment on Sogeking's plan and Sogeking makes it onto the train car with Robin. On board the Rocketman, Luffy can be heard saying to \"turn back.\" Everyone inside is confused on why Luffy wants to turn back and wants him to explain himself. Luffy said he wasn't talking about them and was talking to the large frog that hop on the train tracks. Kokoro recognizes Yokozuna and wonders why he is out there. Luffy continues telling Yokozuna to move out of the way but Yokozuna stands his ground and prepares to knock away Rocketman.\nBack on the Puffing Tom, Sogeking happily says how they got Robin back. However, Franky doesn't like to run away and Sanji says how the smokescreen was so stupid, it caught CP9 by surprise. Sogeking says that the plan to not fight CP9 worked but Sanji and Franky say it was too easy. Suddenly, the train car is caught by Kalifa's thorny whip and Blueno pulls them in. Lucci reminds Blueno not to kill any of the Straw Hat Pirates as it was in the agreement. Sanji tells Sogeking to protect Robin and Sanji delivers a swift kick to Blueno. However, Blueno uses Tekkai to block it. Sanji then spins on the ground and delivers a powerful kick (Concassé) that stuns Blueno. Kaku comments on how strong the kick was and warns Blueno that even though Sanji doesn't have a bounty, he is one of the Straw Hat Pirates' main fighters. Suddenly, Robin knocks out Sogeking using Ocho Fleur Clutch telling him to leave her alone. Sanji looks away and Kaku, taking advantage of the distraction, fiercely kicks Sanji away. Franky, annoyed but touched at Sanji's actions, uses his strength to push away the train cars leaving himself with CP9. Kaku comments on how that was uncalled for and Lucci asks why Franky would help the Straw Hats out. Franky says he couldn't take it anymore saying that Sanji and Sogeking wouldn't leave without Robin. Franky yells out to Sanji and Sogeking that he has a plan but tells them to find a way to get back to Luffy and the others. Robin says she is not trying to run away but Sanji doesn't understand why she would continue to listen to CP9. Sanji says he knows why she did what she did and, even if it's a Buster Call, they will fight. Suddenly, Blueno appears behind Sanji using his Doa Doa no Mi powers and tells Sanji that if there is a Buster Call, they will be obliterated.\n"
}