{
  "chapter_number": "Episode 61",
  "title": "Angry Finale! Cross the Red Line!",
  "short_summary": "After leaving Warship Island, the Going Merry was headed towards the Grand Line, and the crew returned to the great adventure.\n",
  "long_summary": "After Eric attacks Nelson and got the Straw Hats attention, he proposes the Straw Hat Crew to avoid picking up a fight and join him in his dream of obtaining Dragonite and consequently, eternal life. Eric proposes splitting the Dragonite in two parts, but Nami points out that nothing useful can be obtained by destroying the fossilized Sennenryu. He agrees to that extent but adds that there is more than enough Dragonite in the alive Sennenryu. Apis refuses and runs directly to him, in that moment he creates an attack directed to her, so Usopp quickly reacts and charges to Apis, saving her from the attack. Zoro partially unsheathes his Wado Ichimonji but Luffy says that he will be taking care of him, just as he promised Ryu just before his death.\nLuffy starts the battle with his Gomu Gomu no Pistol but is dodged by Eric and counterattacked. Eric makes a lot of damage to Luffy and claims that that \"rubber man\" cannot beat him. After that, Eric starts making a lot of attacks and asks how will Luffy evade them, to which Luffy responds that he will not evade them and runs towards the attacks. After being cut in different places from the attacks of Eric, he manages to grab him by his arms and hit him with his Gomu Gomu no Kane, breaking Eric's distinctive eyeglasses and bringing up some blood. After the Bell technique, Luffy uses Gomu Gomu no Bazooka and blows away Eric.\nThe Straw Hats are ready to depart and villager are there, including Apis and his grandfather. Luffy asks Apis if she wants to come with them, to which she replies that she would like to but she will stay in the village to protect the Dragon's Nest. Usopp responds that the next time the Sennenryu return would be in 1000 years. She replies that surely she will not be able to see the next generation of Sennenryu but surely the kids of their kids will. The Straw Hats set sail and say goodbye. Then Usopp asks the rest of the crew if Apis will be fine and Sanji, Luffy and Zoro say she is gonna be okay.\nThe crew seem to be in the direction of the Grand Line but the map that Nami is seeing seems strange to her. They discuss the possibilities and Zoro does not believe that the map is accurate. Nami gets the idea that a current might be what lets someone pass through the mountain by Usopp's phrase and they go along with it. Nami spots what might be the entrance for the mountain and Luffy orders Sanji and Usopp to set the rudder in the direction of what might be the entrance. The controller for the rudder breaks because of the strong current, Luffy jumps out of the ship and uses Gomu Gomu no Fusen so the caravel will not crash against the arcs that are along the entrance in the mountain. The caravel passes and almost at the final of the current, Eric shows up and the pirates point out that any false move and Eric will tear the ship apart. Nami warns him there is Dragonite besides him, he falls into the trap and she kicks his leg, throwing him to the current. The pirates then celebrate and think of their wishes (except Luffy) as they enter the Grand Line.\n"
}