{
  "chapter_number": "Episode 8",
  "title": "Who Will Win?Showdown Between the True Powers of the Devil Fruit!",
  "short_summary": "Buggy reveals how Shanks foiled his plans of stealing from their crew and making a fortune. The group defeat Buggy, expelling him from the island, before departing the island themselves toward their next destination.\n",
  "long_summary": "Buggy reveals his relationship with Shanks, as they were both apprentices working for a pirate crew. While the pirates were looting a ship, Buggy found a valuable treasure map and kept it for himself. He later learns from Shanks that the pirates have also looted a Devil Fruit from the ship. Buggy planned to steal the fruit, escape the crew and sell both the fruit and the map.\nBuggy ate a fake Devil Fruit in front of the pirates while he kept the real one for himself. However, just before he was able to leave with the fruit, he was caught by Shanks, causing him to accidentally eat the fruit. Buggy also lost the treasure map as the wind blew the map overboard. Buggy, who permanently lost the ability to swim, was unable to recover the map, foiling his plans of defecting from the pirates and starting his own crew. He would need to wait another ten years to accrue the wealth needed to start his own crew.\nIn the present day, Buggy spots Nami attempting to leave with his treasure. Using Bara Bara Festival, Buggy splits himself up into several pieces and attempts to seize his stolen treasure. However, Luffy comes to her aid, striking him down. Buggy attempts to reassemble himself, but Nami restrains many of his body parts with a rope, leaving Buggy much smaller. Luffy then strikes the weakened Buggy with Gomu Gomu no Bazooka, sending him flying into the air and out of the town.\nNami gives Luffy the map of the Grand Line while she keeps the rest of Buggy's treasures. She agrees to temporarily sail with the crew as an opportunity to acquire Bellies. Meanwhile, the citizens of Orange Town, who had evacuated to the outskirts due to Buggy's invasion, grow increasingly concerned for their mayor's safety and decide to return to the town. However, as the group were the only pirates left in the town, they are incorrectly blamed for the destruction of the town. Luffy flees from the angry citizens.\nChouchou, aware of the crew's true intentions, stops the mob, allowing them to head to the pier to escape. Back in the town, Boodle wakes up and finds that the Buggy Pirates have been successfully repelled from the town. He goes to the pier to thank the group as they depart. To Nami's horror, Luffy leaves her treasures behind so the citizens could fund repairs for the town.\nOn a distant island, a mysterious man stands and awaits visitors to his land.\n",
  "characters": [
    "Roronoa Zoro",
    "Cabaji",
    "Monkey D. Luffy",
    "Nami",
    "Buggy",
    "Boodle",
    "Mohji",
    "Shanks (flashback)",
    "Silvers Rayleigh (flashback)",
    "Poro",
    "Chouchou",
    "Tightrope Walking Funan Bros",
    "Usopp"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "buggy",
      2
    ],
    [
      "from",
      2
    ],
    [
      "their",
      2
    ],
    [
      "island",
      2
    ],
    [
      "reveals",
      1
    ],
    [
      "how",
      1
    ],
    [
      "shanks",
      1
    ],
    [
      "foiled",
      1
    ],
    [
      "his",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      45
    ],
    [
      "to",
      25
    ],
    [
      "buggy",
      12
    ],
    [
      "and",
      9
    ],
    [
      "of",
      9
    ],
    [
      "his",
      8
    ],
    [
      "a",
      8
    ],
    [
      "town",
      8
    ],
    [
      "with",
      6
    ],
    [
      "for",
      6
    ],
    [
      "pirates",
      6
    ],
    [
      "map",
      6
    ],
    [
      "he",
      6
    ],
    [
      "fruit",
      6
    ],
    [
      "as",
      5
    ],
    [
      "crew",
      5
    ],
    [
      "from",
      5
    ],
    [
      "luffy",
      5
    ],
    [
      "treasure",
      4
    ],
    [
      "himself",
      4
    ]
  ]
}