{
  "chapter_number": "Episode 79",
  "title": "Ambush! The Bliking and Wapol the Blik",
  "short_summary": "While looking for a doctor, the crew meet Wapol, who threatens them and results into Luffy sending him flying. The crew then arrives to Drum Island, only to find out they are not welcome.\n",
  "long_summary": "Vivi is watching over Nami with the presence of Sanji and Karoo. Zoro sights a man standing on the water and lets know Luffy and Usopp. The Bliking emerges from the water and the Bliking Pirates board the Going Merry, surrounding Luffy, Zoro, Usopp, and then Sanji when he comes out. Wapol is seen eating a meat stick (but instead of a stick, he uses a sword). He also eats the sword and the crew is surprised. A member of the Bliking Pirates reveals Wapol ate the Baku Baku no Mi so he can eat everything. Luffy gets mad about the fact that Wapol starts eating his ship and starts to fight. The crew backs him up (except for Usopp) and the pirates retreat after Luffy sends his captain flying with a Gomu Gomu no Rocket. As the Bliking Pirates retreat, someone keeps yelling at them to remember them.\nA flashback of a Marine ship several days ago is seen. A subordinate informs Captain Smoker about a signal being intercepted. Smoker calls Tashigi and they listen to parts of the conversation between Mr. 0 and Sanji. Smoker and Tashigi discuss and plan to go to Arabasta.\nIn the Merry, Luffy tries to cheer Nami up, but fails. The crew drops anchor for the night, as they cannot navigate without Nami's instructions during the night. Everybody is asleep in the room where Nami is when she suddenly wakes up and sees almost everyone and smiles, she then lays down again. At the same time, Sanji is on the top of the ship, making guard. In the morning, Usopp starts hammering and Sanji wakes up. Vivi explains that the climate may be cold because an island is nearby. She then proceeds to explain the Island Climatic Types. Sanji spots an island and notifies the crew. When they finally arrive to Drum Island, the people of the town is threatening them. Dalton orders the crew to raise their anchor and leave the island, but a villager shoots to Sanji and misses. Sanji is going to fight back but Vivi interposes and she gets shot.\n",
  "characters": [
    "Nami",
    "Nefertari Vivi",
    "Sanji",
    "Monkey D. Luffy",
    "Usopp",
    "Roronoa Zoro",
    "Chess",
    "Wapol",
    "Karoo",
    "Kuromarimo",
    "Smoker",
    "Tashigi",
    "Mr. 11",
    "Dalton"
  ],
  "ssum_frequencies": [
    [
      "the",
      2
    ],
    [
      "crew",
      2
    ],
    [
      "to",
      2
    ],
    [
      "while",
      1
    ],
    [
      "looking",
      1
    ],
    [
      "for",
      1
    ],
    [
      "a",
      1
    ],
    [
      "doctor",
      1
    ],
    [
      "meet",
      1
    ],
    [
      "wapol",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      31
    ],
    [
      "and",
      19
    ],
    [
      "a",
      11
    ],
    [
      "to",
      11
    ],
    [
      "is",
      10
    ],
    [
      "sanji",
      8
    ],
    [
      "of",
      7
    ],
    [
      "luffy",
      5
    ],
    [
      "crew",
      5
    ],
    [
      "island",
      5
    ],
    [
      "usopp",
      4
    ],
    [
      "bliking",
      4
    ],
    [
      "pirates",
      4
    ],
    [
      "he",
      4
    ],
    [
      "but",
      4
    ],
    [
      "up",
      4
    ],
    [
      "she",
      4
    ],
    [
      "vivi",
      3
    ],
    [
      "nami",
      3
    ],
    [
      "then",
      3
    ]
  ]
}