{
  "chapter_number": "Episode 189",
  "title": "Eternal Friendship!The Bell of Oath Echoes Throughout the Giant Ocean!!",
  "short_summary": "The cause of the hatred is discovered and explained; Noland has cut down a grove of special trees on the island which the villagers say house every ancestor and are sacred enough to protect with their lives. Meanwhile, Kalgara vows to meet Mont Blanc Noland again.\n",
  "long_summary": "The flashback of Mont Blanc Noland continues.\nNoland's crew is sitting down around a campfire discussing the recent events and how upset Noland is at the villagers suddenly turning their back on him. They mention they are leaving tomorrow and that the bell still has not been rung.\nNoland is nearby remembering Kalgara's words of anger to him when they met in Shandora earlier. Mousse is also shown looking pensively at the night sky from her bedroom window.\nThe Doctor of Noland's crew is drinking alone while his comrades are sleeping and bemoans the situation when a cloaked Mousse appears behind him and startles him.\nKalgara is looking at a grove of cut-down trees and curses Noland. He angrily rants about what Noland has done.\nMousse explains to the Doctor that those trees were sacred to them as they believe the souls brought back by the Golden Bell reside in those trees and watch over the Shandia. The Doctor sadly acknowledges the crew chopped them down and Mousse tells him the only reason the villagers did not attack them is out of regard for their earlier help with the Tree Fever. Mousse says even if they did not know about the significance of the trees, the villagers will never forgive them but she wanted them to at least know why they were angry. \nThe next day on Noland's boat, the Doctor reports to Noland what Mousse said and Noland is appalled and feels guilty. He understands the villagers because the bell now has lost its purpose because of them. Noland then tells the crew they are leaving the treasure behind and the crew is appalled.\nAt the village someone mentions Noland and his crew leaving and some villagers look grumpily conflicted. Mousse runs into town and starts rumbling out of breath to her father Kalgara. She asks what they would do if they knew one tree was infected and was going to poison the rest of the island and starts to cry. Mousse begs her father to go talk to the crew before they leave and tells him he will regret it later if he does not go say goodbye to the best friend he ever had. Mousse flashbacks to the rest of her earlier conversation with the Doctor who explains that the grove in question was already dead and infected with Tree Fever. As the plague infects both people and plants, the crew had to chop them down to prevent those trees from infecting the rest of the island and killing the villagers again.\nSeto and the villagers are stunned to hear they did it to protect them. Kalgara rushes to the beach to beg Noland for forgiveness.\nAt the beach, the pile of treasure has been left behind. Some of Noland's crew are upset. Noland addresses them and tells them it is time to go back home to the Kingdom of Lvneel. Full of regrets and guilt, Kalgara is still running to reach the beach.\nAs the boat sets sail, the Golden Bell starts ringing again. Noland hears it and is shocked. We see Seto and the other villagers are all crying and ringing the bell hoping Noland and his crew will hear it before they go. Then Kalgara burst onto the beach and screams Noland's name. He remembers moments of their friendship and cries. He screams at Noland to come back again. He says he will wait for Noland's return and keep ringing the bell so that Noland's crew can find their way back even in a bad storm.  Noland is also in tears and swear he will come back and they shall meet again.\nBack at the Kingdom of Lvneel, the narrator tells about Mont Blanc Noland and his tales that no one knows whether they are true. They show him returning from his trip and telling the King about Shandora.\nFive years later, the King says Mary Geoise has approved Noland's return trip to Shandora but instead of his usual crew, the King himself and his army will accompany Noland there. Noland seems pleased.\nBack on Jaya Island, a grown-up Seto accompanies Kalgara to their daily ring of the bell. They greet Nola, the now slightly grown python who is Kashigami's grandson and who now lives in the ruins. Seto wonders when Noland will be back but Kalgara is patient and says he will come back some time but he understands his family is in the North Seas. Kalgara trust that if they keep ringing the bell, Noland will be back.\nHowever at that moment the Southbirds starts screaming and the sky becomes very dark. Kalgara and Seto rush back to the village to protect it. The ground starts breaking and we see Mont Blanc Cricket's now-house being torn in the middle by the island break. Rocks are flying and we see the Knock Up Stream bursting out of the middle of the island.\nNoland followed by the King and his army is now on the island looking at the half-house in despair wondering where the rest of the island has gone. The King attacks Noland and accuses him of deceiving him about the gold. Noland worries about Kalgara and wants to hear the Fire of Shandora to know his friend is OK.\nNoland's execution back at Lvneel is about to begin. A crowd has gathered and Noland retells them the story of Jaya Island and the City of Gold. One of the King's advisers invite a member of Noland's crew to hear what he has to say. That man appears and tells the crowd and the King this is all a lie. The crowd is shocked and thinks Noland is a horrible man. Some actual members of Noland's crew step forward from the crowd and scream the man is an impostor and try to tell people of Kalgara but they are restrained. Noland is about to be executed and the crowd heckles him and calls him a liar while his men cry.\nThe Shandia part of Jaya is shown being burst into the sky by the Knock Up Stream and impaling itself on Giant Jack. As the Golden Bell flies in the sky, it rings and the people on Angel Island hear it in awe. A man who is the then-God of Skypiea telling his enforcers this is the birth of a Holy Land and that he should live on this Vearth.\nBack in the Shandia village, everybody is in shock. There are many injured. God appears in the village with his enforcers and Kalgara and some of his men attack them to protect the land. \nAs he is about to be put to death, Noland wonder where Kalgara is. As he is about to attack God, Kalgara worries about what Noland will think when he comes back to Jaya and does not find his friend there. He reiterates his hope that they can meet again.\nBack to Wyper's flashback, the Village Chief tells young Wyper that Kalgara kept thinking of Noland all through that battle and hoped that if he could just ring the Golden Bell once more, he could let his friend know he is alive and thinking of him. Unfortunately, he never got to do it. Some time later, a ship from the Blue Sea went up to Skypiea and told the Shandia what had happened to Noland. Kalgara continued to be a great warrior in the sky but always regretted never being able to tell his feelings to his friend. Young Wyper wonders if ringing the bell now would still reach Noland and let him know of Kalgara's friendship. Maybe, says the Chief ...\nBack to the present, Aisa is tugging at Wyper to leave as the island is being destroyed. Wyper finally speaks and curses Enel.\nEnel looks at the destruction and is enjoying it. \nMcKinley is yelling at people to hurry the evacuation but the lightning is striking some boats as well. Some White Berets inform McKinley there are casualties and McKinley orders everyone to the boats. They will get care there. As McKinley worries about Conis, a huge lightning bolt strikes Angel Island.\nBack on the Going Merry, Conis is still silently praying.\nAt the bottom of Giant Jack, Robin comments that the ark will soon be at the top and she tells Gan Fall that what Enel wants is the Golden Bell hidden at the top. Wyper overhears.\nEnel mocks the fleeing angels and strikes at the boats with lightning. At Heaven's Gate some of the fleeing angels look in horror as a hole opens in the White White Sea above them and some boats fall down. Enel also destroys his former home of God's Shrine with lightning strikes and strikes Shandora below as well. Enel mentions the only thing on this land that interests him is the Golden Belfry. But he frowns when he realizes he hears two \"voices\" approaching.\nNami is on her Waver a bit lower on the stalk from Luffy trying to keep up with him.\nLuffy (with his ball behind him) is still running, expressing concern for Nami and swearing Enel won't put his hands on the Golden Bell.\n"
}