{
  "chapter_number": "Episode 167",
  "title": "God Enel Appears!! Aubade to the Survivors",
  "short_summary": "Enel takes away all the limitations the Priests had. Usopp witnesses a mysterious shadow fixing the ship and the next day the Going Merry is found in her original form. The ship is taken off the altar and the Straw Hats act out their plan.\n",
  "long_summary": "Usopp wanting to urinate and being too scared to go alone asked Zoro to accompany him but Zoro refused. Usopp went on his own and noticed that someone was on the ship fixing it. Shocked by the mysterious shadow, Usopp blacks out only to be found by Zoro the next day. The Priests were summoned by Enel, but they began fighting against one another seeing who is the strongest among the three priests. While arguing amongst themselves, they questioned where Enel was and a bolt of lightning came and Enel appeared.\nEnel reveals to the priests the purpose of the Straw Hats coming to Sky Island and told them the Shandia will also be attacking and therefore, the Upper Yard is opened to the priests without any area limitation. He also told them the Ark Maxim was ready. Gan Fall ponders on what Enel's plans might be and Wyper rekindles his resolve to take Enel out.\nThe Straw Hats on the following morning realize that their ship has been repaired. They pondered on who may have fixed the ship considering their location. Usopp wondered how the repair person was able to fix the ship correctly to its original design. Finally, Usopp and Chopper begin their attempt to get the ship off the sacrificial altar. Usopp used Chopper as bait to lure the sky sharks so as to use their power to pull the ship. Nami divided the crew into the exploration and home team. The exploration team will go in search of the gold and the other team will sail the ship which then, they would escape Upper Yard. With this, they set out, and so did their enemies.\n",
  "characters": [
    "Monkey D. Luffy",
    "Pierre",
    "Tony Tony Chopper",
    "Sanji",
    "Nico Robin",
    "Nami",
    "Roronoa Zoro",
    "Usopp",
    "A mysterious man fixing the Going Merry",
    "Gedatsu",
    "Shura",
    "Ohm",
    "Yama",
    "Enel",
    "Gan Fall",
    "Wyper",
    "Holy",
    "Fuza",
    "Gode"
  ],
  "ssum_frequencies": [
    [
      "the",
      8
    ],
    [
      "ship",
      2
    ],
    [
      "and",
      2
    ],
    [
      "is",
      2
    ],
    [
      "enel",
      1
    ],
    [
      "takes",
      1
    ],
    [
      "away",
      1
    ],
    [
      "all",
      1
    ],
    [
      "limitations",
      1
    ],
    [
      "priests",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      28
    ],
    [
      "to",
      14
    ],
    [
      "and",
      11
    ],
    [
      "ship",
      7
    ],
    [
      "usopp",
      6
    ],
    [
      "on",
      5
    ],
    [
      "enel",
      5
    ],
    [
      "they",
      5
    ],
    [
      "their",
      5
    ],
    [
      "was",
      4
    ],
    [
      "priests",
      4
    ],
    [
      "zoro",
      3
    ],
    [
      "by",
      3
    ],
    [
      "out",
      3
    ],
    [
      "be",
      3
    ],
    [
      "of",
      3
    ],
    [
      "will",
      3
    ],
    [
      "team",
      3
    ],
    [
      "go",
      2
    ],
    [
      "but",
      2
    ]
  ]
}