{
  "chapter_number": "Episode 193",
  "title": "The War Draws to a Close!Ringing Far and Wide, the Proud Fantasia",
  "short_summary": "The 400-year war on Sky Island comes to an end. Mont Blanc Cricket and the Masira Brothers hear the Golden Bell ringing and realize that the Gold City was always in the sky. Enel, who was thrown to the Blue Sea heads out to the Fairy Vearth (the Moon). The Sky People (both Skypieans and Shandia) celebrate the end of the war with a great bonfire.\n",
  "long_summary": "Luffy delivers to Enel his finishing blow with this golden ball arm, causing the Golden Bell to ring and fall and the golden ball to shatter. The ringing is heard by Cricket and the Saruyama Alliance all the way from Jaya, and all the other people in Sky Island. The Straw Hats rejoice upon hearing the beautiful sound of the bell. \nHaving confirmed the existence of Sky Island, Cricket surmises that the \"giants\" they see in the cumuloregalis clouds were just shadows of the Sky People living in Sky Island. He then cries in relief knowing the Straw Hats are safe.\nBack in Skypiea, the Golden Bell falls into the sky ocean, followed by Enel and his Ark Maxim. The Skypieans watch as these sink into the sky ocean. The promise to ring the bell has finally been fulfilled after 400 years. Luffy lies down and wonders if the old man and the others heard it, to which Nami replies that she's sure they did. \nEveryone involved in the battle are now being treated or are recuperating. Chopper goes to Wyper to treat his wounds. Zoro, Usopp and Sanji think about how the City of Gold was only a city of gold by name since they were not able to find any treasure within it, that it was too bad that the Golden Bell fell to the sky ocean, and they weren't able to get some gold, thus continuing their journey in poverty. Usopp isn't too torn up about it since he would much rather have the dials than gold since these can't be found in the Blue Sea.\nLuffy, Nami, Conis and Su get back to the group carrying a huge sack of food they found in the priests' food storage on their way back through the forest. Conis' father, Pagaya, who she believed to have died protecting her, appears behind them telling her that he is alive. He said that he found himself in the White Sea after being knocked off. He also updated every one of how the evacuees are returning to the White-White Sea via restored Milky Roads and that since Angel Island is no more, everyone is headed to the Upper Yard. \nGan Fall goes to rescue those who Enel forced to work for him for 6 years to build Maxim and they are reunited with their families. The Shandorians discuss the events, consulting the Shandorian Chief if the 400-year rift could so easily be mended. \nMeanwhile, the Straw Hats have finished off all the food and Nami suggests that they return to their ship so they can sleep comfortably tonight. However, Luffy and Usopp are disappointed by this statement, telling her that this comment disqualifies her from being a pirate, hinting that they still need to get \"that\" thing that they came for. Enel is seen on Maxim sailing across the sky ocean, going to \"where God should be\" which is to the Fairy Vearth (the moon). \nWyper gains consciousness. He sees Gan Fall, Conis and the Shandorian Chief, prompting him to ask if they were captured by Skypieans. The Shandorian Chief tells him that there is no distinction between those who have been injured in battle. Wyper grows restless, remembering that they still need to find and protect the Golden Bell. He then hears the sound of drums and sees a huge fire outside his tent and assumes that they were announcing a battle. The Shandorian Chief calms him down and tells him to wait and see how things are turning out. Gan Fall then encourages him to look outside and see that instead of a battle, a celebration between Skypieans and Shandorians is taking place. Wyper sees this and smiles.\n"
}