{
  "chapter_number": "Episode 200",
  "title": "Luffy and Sanji's Desperate Decision! Large Rescue Maneuvers!",
  "short_summary": "The real Inspector Shepherd is thrown in the brig with Zoro and Usopp, while Sanji and Luffy race to rescue the two while avoiding detection.\n",
  "long_summary": "At the Going Merry, Shipwright Mekao inspects the ship with interest, whilst other Marines laugh at the pirates stupidity in coming back to their ship, saying there are better ones in the bay they could steal. Meanwhile, Luffy and Sanji sneak around the base, attempting to find the jail where Zoro and Usopp are being held. However, neither of them know where the jail is, thus they assume it is in the suspicious looking island surrounded by water. Major Sheppard is captured by the marines and held in the same cell as the Straw Hat Crew, as Robin stole his uniform previously and the Marine mistook him for an intruder. Usopp takes the chance to pretend he is their comrade, assuring the marines won't let him out.\nRobin is in the library searching for a way out of the base, noticing that the Marines are watching her closely. Vice Admiral Jonathan decides that they will have to lead the Straw Hats to the prison in order to capture them. Later, Shipwright Mekao talks to Usopp in the prison, telling him the repairs he did to the Going Merry weren't good enough, and that sooner or later the mast would snap. They talk about the Straw Hat's time in Skypiea, much to Lieutenant Commander Drake's annoyance. However, the Marines force Mekao out after he tells Usopp he might know who mysteriously fixed the Going Merry in Skypiea. \nMeanwhile, Luffy and Sanji attempt to infiltrate the prison, concerned about how deserted the path was. They race down, despite the obvious trap. Luffy discovers the bars are made out of Seastone, whist Sanji attempts to kick down the bars, also discovering that they are practically unbreakable. However, Sanji takes Usopp's impact dial, only to find out it's the voice dial instead. He tries Usopp's other pocket, only for it to be the flavor dial. The gas sets off an explosion, and the Straw Hat's escape only to get lost while following Zoro.\n"
}