{
  "chapter_number": "Episode 64",
  "title": "A Pirate-Loving Town? Arrival at Whisky Peak",
  "short_summary": "Luffy and his crew arrive at Whisky Peak, a town of pirate-lovers who hold them a feast. Things get fun when everyone has a chance to enjoy themselves. Nami and Zoro are getting into a drinking contest to win some money, while Luffy is eating to the fullest. Sanji has the company of several beautiful women, and Usopp lies to make people admire him. Zoro then learns the truth about the people of Whisky Peak.\n",
  "long_summary": "The Straw Hat Pirates travel along with Miss Wednesday and Mr. 9 in the Going Merry to get them to Whisky Peak. Nami is surprised by the weather condition on the Grand Line because it changes randomly and drastically. She tells the crew that they are heading in the wrong direction and the crew follow her orders so they can get to Whisky Peak. The Straw Hat Pirates arrive at their destination, while Miss Wednesday and Mr. 9 get off the ship and start swimming immediately after they see Whisky Peak. Nami says that it is impossible to get off the island unless the Log Pose settles down. The people of the island welcome the Straw Hat Pirates, for which Straw Hat Pirates are surprised to witness a town of pirate-lovers.\nThe Straw Hat Pirates enjoy themselves with the people in the town. Nami is encouraged to participate in a drinking contest for a reward from Igaram. Zoro also joins Nami in a drinking contest. Sanji gets in the company of beautiful women and Usopp lies to people about his adventures for which people get impressed. Luffy eats to his satisfaction. Nami wins the contest by defeating the last contestant.\nAfter the party is over, Igaram reveals that the Straw Hats must be captured alive, so they can get the reward without the 30% reduction that they will get if they kill the Straw Hats. Zoro appears on top of a building in front of the bounty hunters and reveals that he knew that they were pretending to be pirate-lovers. Igaram and the others are surprised and say that Zoro must be killed. Zoro suddenly disappears instantly and everybody gets surprised.\n",
  "characters": [
    "Nami",
    "Monkey D. Luffy",
    "Usopp",
    "Sanji",
    "Mr. 9",
    "Miss Wednesday",
    "Roronoa Zoro",
    "Pandaman (image)",
    "Mr. Beans",
    "Miss Catharine",
    "Igaram",
    "Mr. 13",
    "Miss Friday",
    "Miss Monday",
    "Mr. Shimizu"
  ],
  "ssum_frequencies": [
    [
      "a",
      4
    ],
    [
      "to",
      4
    ],
    [
      "the",
      4
    ],
    [
      "and",
      3
    ],
    [
      "of",
      3
    ],
    [
      "luffy",
      2
    ],
    [
      "whisky",
      2
    ],
    [
      "peak",
      2
    ],
    [
      "has",
      2
    ],
    [
      "zoro",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      27
    ],
    [
      "and",
      10
    ],
    [
      "to",
      9
    ],
    [
      "straw",
      7
    ],
    [
      "in",
      7
    ],
    [
      "get",
      7
    ],
    [
      "that",
      7
    ],
    [
      "they",
      7
    ],
    [
      "hat",
      5
    ],
    [
      "pirates",
      5
    ],
    [
      "nami",
      5
    ],
    [
      "of",
      5
    ],
    [
      "a",
      5
    ],
    [
      "is",
      4
    ],
    [
      "surprised",
      4
    ],
    [
      "people",
      4
    ],
    [
      "zoro",
      4
    ],
    [
      "whisky",
      3
    ],
    [
      "peak",
      3
    ],
    [
      "are",
      3
    ]
  ]
}