{
  "chapter_number": "Episode 226",
  "title": "The Nigh Invincible Man? And a Very Dangerous Man!",
  "short_summary": "Once Foxy wins back his crew, he captures the Straw Hat Pirates. Nami and Luffy fight Foxy and although he's defeated, his crew accepts him back. Later, they sail to an island where they meet someone Robin knows: a Marine named Aokiji.\n",
  "long_summary": "The Straw Hats are deceived by Foxy, who uses his Noro-Noro Beam to trap them in place and drop them into a deep pit on the deck of the Sexy Foxy. Luffy busts through one of the pit's walls, and the Straw Hats are confronted with Foxy, who has taken up an obvious disguise that Luffy nonetheless fails to see through. Eventually Sanji sets him on the right track, and Foxy makes a getaway covered by his powers. Luffy, Nami and Usopp chase after him, while Sanji and Zoro are frozen in a compromising position.\nNami and Usopp find a door with a message that only men can enter. When they both go in, they find that it is a passage over the Sexy Foxy's brig, filled with the Foxy Pirates' troublemakers that have not seen a woman in a long time. Nami finds it too uncomfortable to cross, so Usopp reasons that the prisoners will be vulnerable to light after their time in the dark brig, and throws a flash-bang. Nami is able to make it through, although Usopp trips and falls, and the prisoners hold him in place.\nLuffy and Nami arrive in a large atrium, where Foxy, Porche and Hamburg attack them with the Gorilla Puncher 13 and Donkey Kicker 18. Inspired by Luffy calling for water after he burns his hand on the machine's fist, Nami uses Thunderstorm Tempo to put out the fires, allowing Luffy to smash the Gorilla Puncher and use Gomu Gomu no Spinning Top to collide it with the other machine and defeat them both. Afterward, the Straw Hats and Foxy convene on the deck and agree to end hostilities. Foxy then tearfully asks his crew if they will still accept him, which they enthusiastically confirm. However, as the Straw Hats return to their own ship, Foxy privately tells his subordinates that they must defeat Luffy or they will be stuck flying his ridiculous flag forever.\nThe Straw Hats disembark on an island, where Sanji starts a barbeque. Foxy, Porche, and Hamburg attack in a large crab-shaped submarine which they are confident will be mistaken for an ordinary crab, and their prediction comes true as Luffy grabs the sub's leg and tries to bring it to the barbeque. When its pilots try to shake him off, Luffy angrily retaliates and slams the submarine into the beach, causing it to explode. Porche calls a backup ship and the three return to the Sexy Foxy. \nThe Straw Hats decide to venture into the island's jungle to search for medicinal herbs. They are confused by what looks like a bicycle track along the jungle path. Eventually, they come to a clearing with what looks to be a mushroom growing from a rock. Chopper goes to investigate and is struck out from behind the rock. When the others follow, they see that Chopper actually disturbed the sleep of a mysterious man, the sight of whom sends Robin into a panic. She explains that the man is one of the strongest individuals enlisted in the Marines: the Admiral Aokiji. He responds by saying that she's grown into a beautiful woman, seeming to recognize her.\n"
}