{
  "chapter_number": "Episode 238",
  "title": "Rubberman vs. Fire-Breathing Cyborg",
  "short_summary": "In the streets outside of the hospital, Luffy fights Franky. Inside the hospital, Iceburg regains consciousness and recalls seeing Nico Robin and another tall man before he was shot. The Galley-La Company run outside to stop Franky and Luffy and tell them that they suspect the Straw Hat Pirates committed the crime.\n",
  "long_summary": "Franky continues to call out to Luffy urging for a fight. Luffy is confused on how the stranger knows his name but Nami quickly informs in that is Franky. Luffy then finally recognizes that man responsible for beating up Usopp and calls out to Franky wanting to fight.\nBack at the hospital, Kalifa informs the others of the Galley-La Company that Iceburg is now awake but still badly injured and can go into his room to see him. Paulie informs Iceburg that he and the rest of the company will watch over the shipyard until he recovers. Iceburg then immediately tells the others that he remembers who attacked him and says that one of them was with the Straw Hat Pirates indicating Nico Robin. Outside, the people are excited to hear that Iceburg is awake.\nBack at the shipyard, Franky taunts Luffy about attacking his gang and destroying his house. Nami only wants their money back but Franky says that he has already spent it. However, Luffy doesn't care about the money and wants revenge. The people suddenly start to move away as Franky suddenly starts taking in a large amount of air. Franky then suddenly lets out a large amount of fire that nearly hits Luffy, Nami, and the other Water 7 citizens. Nami assumes that Franky has Devil Fruit powers and Franky suddenly leaps into the water much to the confusion of Luffy and Nami. Franky then suddenly crashes into the boat sending Luffy and Nami into the air and Franky says that he hasn't ate a Devil Fruit. As Luffy falls toward Franky, Franky launches his Strong Right move right at Luffy sending him flying across the water, into the wall, and downward right on the top of his head. Franky moves onto shore as the other people run away and Nami wonders if Franky doesn't have Devil Fruit powers, then what is he. Franky then takes off his hand saying he's actually a human with robotic parts, also known as a cyborg.\nBack at the Galley-La Company, Paulie is confused and shocked to hear that one of the Straw Hats attempted to murder Iceburg. Kalifa confirms this and says that she had Lucci contact the government for more information. Hattori then says that Robin is a notorious criminal and is no surprise that she will do something so sadistic. Kaku then says that the next thing to do is to find the Straw Hats and Lulu wonders if they did this because they wouldn't fix their ship. However, Kaku sums up that the Straw Hats are responsible and must be dealt with. At a different location, Sanji and Tony Tony Chopper are sailing on a boat still looking for Robin. Chopper is still worried about the large wave that will sink Water 7 underwater but Sanji remembers that Chopper left something behind on the Merry. Sanji then turns around much to the excitement of Chopper.\nAt the Galley-La Company, Tilestone charges into the room loudly excited to hear that Iceburg is awake (much to the disdain of the others due to Tilestone's loud yelling). Annoyed, Paulie knocks Tilestone out of the room telling him to keep it down as Iceburg needs the silence to recover. Tilestone then apologizes and then tells Paulie that Luffy and Franky are fighting and destroying the entire shipyard in the process. Paulie is clearly angered by this and Hattori says that at least they know where to find him. Paulie then leads the other members of the Galley-La out to confront Luffy and Kalifa informs Iceburg that now he has peace and quiet. At the shipyard, Luffy and Franky continue to brawl as they wreck the shipyard as they fight. Luffy launches his Gomu Gomu Pistol which sends Franky flying backwards and Franky retaliates with a giant blast (Weapons Left). Luffy dodges the attack and attempts to counter back with a kick but Franky blocks it. Suddenly, both Franky and Luffy are suddenly punched backwards and it was revealed to be by Galley-La. The people are excited to see them and Luffy is just as confused to why they attacked him. Franky warns Galley-La not to interfere with his fight with Luffy but Galley-La simply ignores him and Paulie questions Luffy. Paulie then uses Rope Action on Luffy and slams him onto the ground (Rope Action: Haafu-Notto Ea Doribu). Franky yells out in frustration about Galley-La attacking Luffy, but the other Galley-La members prepare for a fight. Lulu then fires shots at Luffy who absorbs it due to his Devil Fruit powers and Lulu then roughly kicks Luffy onto the ground. Franky then starts to fire at Galley-La and Kaku falls down from above. Franky attempts to blast him but Tilestone knocks him away with a giant log. Kaku then grabs Franky and slams him onto the ground. Meanwhile, Luffy is in a fist fight with Lucci who eventually knocks him backward with his hand. Luffy still doesn't understand why Galley-La is attacking him and Paulie says that one of the members of the Straw Hats attempted to murder Iceburg. Back in the hospital room, Iceburg is remembering that one of the attackers was indeed Nico Robin and wonders if the masked man is also with the Straw Hats. He also wonders that they are after something important and, outside, the people heard that the Straw Hats are to blame for the attempted murder and are said to capture the Straw Hat Pirates.\n"
}