{
  "chapter_number": "Episode 265",
  "title": "Luffy Charges In! Great Decisive Battle on the Judiciary Island!!",
  "short_summary": "Spandam is informed that an intruder has entered the area. Luffy confuses the Marines guarding the entrance gate by manipulating one of their own comrades to fight against them. The Franky Family and the Galley La Company comes in while the Straw Hat Pirates are still in the sea train. Because they are not all quite as limber as Luffy, they have to band together to get inside. Giant Gate Keepers Kashii and Oimo come to fight the Franky Family.\n",
  "long_summary": "Spandam receives a report with the Marine saying there are a bunch of people charging through the main gate and they need reinforcements. The Franky Family charge in riding on Sodom and Gomorrah and blast away at some Marines. Spandam demands to know what is going on. Past the main gate, the Franky Family's largest members, the Kairiki Destroyers are the first to get off and begin fighting through the Marines. Meanwhile, Robin is seen turning around with a concerned look on her face and Rob Lucci tells her it is too late to have second thoughts. Robin and the rest of CP9 with Franky continue to walk on.\nJust outside Enies Lobby, the other Straw Hat Pirates are seen preparing on the Rocketman. Kokoro then says over the loud speaker that they have four minutes left before they charge through.\nMeanwhile, Luffy walks up to a group of Marines and politely asks them if he could pass, but a Marine charges in toward Luffy with a spear. However, Luffy dodges it and uses a new, unique move known as Gomu Gomu no Mikata Robo that allows him to \"control\" the captured Marine. Luffy uses the captured Marine to take down some Marines who says he cannot control his actions. Two Marines attempt to attack Luffy from behind but Luffy escapes and the two Marines attack the previously captured Marine instead. Luffy escapes over the second gate telling the Marines they will have more people to fight later. \nThe Marines are forced to tell Spandam that Luffy has made it to the main island. Spandam is furious wanting to know what happened to Kashii and Oimo thinking they have been taken out as well. The Marine, however, says that they may be sleeping and Spandam angrily tells the Marine to wake them up. Jabra wonders why everyone is throwing a riot over one intruder, but says he and the others will take care of him. Spandam says that is not necessary as Enies Lobby is the way to the World Government and is a symbol of justice. Spandam continues saying it will be an embarrassment if the Straw Hats manage to save their one crewmate and promises that the Straw Hats will pay.\nBack at the main gate, Spandam demands to know what is going on from the gatekeeper. However, the gatekeeper has been knocked out as the Franky Family and Galley-La take out some Marines. Paulie takes out a group using Rope Action: Figure of Eight Knot while Zambai smashes some with his cannon not wanting to waste any ammo on the weaker men. Paulie tells the others to open the main gate and Mozu and Kiwi agree to do so. Peepley Lulu takes out a Marine while Tilestone bear-hugs some others. Mozu and Kiwi manage to pick the locks using their swords and the Kairiki Destroyers push open the large doors. The Franky Family celebrate pushing open the door and they all rush through. Zambai suddenly yells out to some of the others that he has a plan and needs help. As the members of the Franky Family proceed, they are ambushed by the two giants Kashii and Oimo. Kashii and Oimo taunt the Franky Family due to their size and the Kairiki Destroyers agree to fight them. However, even the largest members of the Franky Family are no match for two giants and are effortlessly taken out much to the surprise and shock of the rest of the Franky Family. Kashii and Oimo continue to taunt the Franky Family, saying they will not let them pass, but the Franky Family are determined to save Franky. Back outside the gates, Kokoro says that they have two minutes before charging in. Meanwhile, Luffy finds himself surrounded by many Marines and government agents. One of them taunts Luffy saying they have 10,000 soldiers. Luffy cracks his knuckles preparing for a fight and tells the Marines to get out of his way.\n"
}