{
  "chapter_number": "Episode 156",
  "title": "Criminals Already!? Skypiea's Upholders of the Law",
  "short_summary": "The White Berets come to arrest the Straw Hat Pirates for not paying their entrance, but they are easily defeated by Luffy and Nami.\n",
  "long_summary": "The White Berets confront the Straw Hats telling them to pay the immigration fee. However, the Straw Hats refuse to pay, claiming that the fee is too expensive and also they cannot afford that amount of money. They are still worried that Nami has not returned and ignore the White Berets to discuss how they can get Nami back. Usopp tries to pacify the White Berets by telling the crew to calmly wait for Nami's return and tells the captain of the White Berets, McKinley, to be patient and that they would pay the fee when Nami returns.\nMcKinley goes on to link almost everything the Straw Hats do to a crime including owning a waver, hitting a rare fish (which was about to eat Conis) and Zoro's act about wanting to fight McKinley because of his ongoing talks about them committing a crime. Usopp told McKinley that Zoro just meant it as a joke and not actually cutting McKinley. Chopper got angry and stated that all McKinley is doing is trying to make them guilty by all means. Usopp tried to pacify Chopper and Chopper said all they are doing is standing around doing nothing. An idea came to Usopp and he said they could do something which is - sleep. McKinley on seeing this accused them of environmental pollution. Luffy and Zoro became angry and were ready to fight the White Berets; Usopp continued to try to pacify them.\nAt that point, Nami returned yelling for Luffy not to get anyone upset after noticing that the Skypiea authorities have made contact with the Straw Hats. On hearing the high amount of money Usopp told her about the immigration fee, Nami in anger hit McKinley with her Waver and told them to run. Usopp asked what crime Nami committed and was told it was a class 5 crime punishable by cloud drifting.\nNami told the rest of the crew what she had seen earlier and told them they have to leave immediately. The rest of the crew agreed. However, Luffy was displeased and refused to leave. Although Nami tried convincing him, Luffy remained adamant about not leaving. Conis then appeared and told them to hurry but McKinley told her that if she continues to aid the Straw Hats, she and her father would be punished as well. The White Berets then launched an attack on Luffy but he easily defeated them. McKinley laughed and told the Straw Hats that there is no escaping anymore. They are now class 2 criminals and the Priests of the Upper Yard will be the ones to judge them.\n",
  "characters": [
    "Monkey D. Luffy",
    "Conis",
    "Pagaya",
    "McKinley",
    "Sanji",
    "Tony Tony Chopper",
    "Nico Robin",
    "Usopp",
    "Roronoa Zoro",
    "Su",
    "Nami"
  ],
  "ssum_frequencies": [
    [
      "the",
      2
    ],
    [
      "white",
      1
    ],
    [
      "berets",
      1
    ],
    [
      "come",
      1
    ],
    [
      "to",
      1
    ],
    [
      "arrest",
      1
    ],
    [
      "straw",
      1
    ],
    [
      "hat",
      1
    ],
    [
      "pirates",
      1
    ],
    [
      "for",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      27
    ],
    [
      "to",
      23
    ],
    [
      "and",
      19
    ],
    [
      "them",
      10
    ],
    [
      "that",
      10
    ],
    [
      "mckinley",
      10
    ],
    [
      "told",
      9
    ],
    [
      "they",
      8
    ],
    [
      "of",
      8
    ],
    [
      "nami",
      8
    ],
    [
      "usopp",
      7
    ],
    [
      "white",
      6
    ],
    [
      "berets",
      6
    ],
    [
      "straw",
      6
    ],
    [
      "hats",
      6
    ],
    [
      "is",
      6
    ],
    [
      "a",
      6
    ],
    [
      "about",
      5
    ],
    [
      "luffy",
      5
    ],
    [
      "fee",
      4
    ]
  ]
}