{
  "chapter_number": "Episode 132",
  "title": "The Navigator's Mutiny! For an Unwavering Dream!",
  "short_summary": "Luffy fishes a weird salesman out of the water and onto the Going Merry. He tries to sell his inventory to the Straw Hat Pirates, and Nami obtains a ton of \"1000 year paper\" from him to draw her sea maps. However, she is repeatedly interrupted by her crewmates' antics.\n",
  "long_summary": "Luffy, Usopp, and Chopper are fishing off the side of the boat while the rest of the crew relaxes. Chopper catches a large fish, and Usopp catches a small one. Sanji offers Nami some tropical juice that he says will make her skin smooth, and Luffy and the others ask for some, too, as they want to look cuter. Luffy keeps fishing and pulls out a large sea snail, and the crew discuss whether or not to cook it. Before they can, a hatch on the side of the snail's shell opens and a man comes out. He introduces himself as Rice Rice, a traveling salesman from the Den-Den Company who was lost in a storm during a delivery. He thanks them by offering them free product catalogs. While he was explaining his trade to most of the crew, Luffy, Usopp, and Chopper wander into his Escar and begin playing with his inventory. He interrupts them and takes the Buru Buru Blade from Luffy, explaining its different features and apparent value. When he sees Chopper playing with the Ab-Ab Slider he does the same, claiming that both were his company’s “Number 1” product. He then straps Usopp into the Golden Fish, much to Usopp’s dismay, to demonstrate its functions and then offers the three products, Mero Mero Juice, a stack of encyclopedias, and binoculars for 23,800.\nAs the crew thumbed through the catalogs, Sanji noticed the company’s knife collection. Rice Rice pitched him a super flexible knife from High Mountain and then offered him a dozen table knife set, scissors, a peeling knife, and an electric sharpener for 2,980. He tried to pitch his Silky Smooth Skin Soap to Robin,and she commented on his company’s vast inventory. Luffy asked him if they sold live animals and when Rice Rice told him they did not, the captain was disappointed.\nNami asked if he sold paper strong enough to resist weathering. Rice Rice revealed his Millennium Paper, explaining its qualities and possible uses. When Luffy asked if it could be used to make paper airplanes, Rice Rice annoyedly said that doing so would be a waste. Recognizing Nami’s strong desire for the paper, he tried to cheat her and drive up the paper’s price. He offers it to her for a “reduced rate” of 48 million and she asks if he could take it down further. When he offers to sell it for 47.5 million she countered offered with 2 million. Though Rice Rice drops back to a 4.8 million offer, Sanji said they would pay for it. He ties up Luffy and proposes they turn him into the Marines and Rice Rice realizes that he was the notorious pirate Monkey D. Luffy. As he trembles in fear he notices the crew’s jolly roger and falls to the ship’s deck, nervously cowering. He quickly jumps to his feet and makes an excuse that he had an appointment to get to, climbs into his Escar and flees the ship in haste.\nWith Rice Rice gone the crew notices that he has left the inventory he was showing them, including the Millennium Paper Nami wanted. She takes it into her room telling her crewmates to keep quiet and watch the clouds for any weather changes. She decides to start making her dream of drawing a map of the world a reality, settling down to draw Little Garden, Drum Island, and Arabasta. She recalls standing on a cliff in Cocoyasi Village with Bell-mère and Nojiko, asking her mom where the wind and sea come from. Bell-mère answers, laughing and patting her daughter's head. Nami then recalls when she returned to that spot after stealing books from a shop in her village and her mom came up to bring her home for dinner. Nami asks her mom about what is past the sea, to which Bell-mère responds saying that she did not know past the Grand Line. She then told her mom her resolve to travel the world and make a map of everywhere she goes.\nBack outside, Sanji orders Luffy, Usopp, and Chopper to clean the ship's deck. Zoro argues that Robin should help instead of relaxing with her book but Sanji defends her. Zoro and Sanji begin to fight over this causing the ship's deck to shake. With the rumble, Nami's ink pen slides across the paper while she is mid-stroke. Aggravated, she comes out of her room and hits both of them over the head telling everyone to be quiet. She returns to her drawing and starts a new draft.\nBack outside, Luffy, Usopp, and Chopper try cleaning the ship by riding on the Ab-Ab Slider with a mop. They use the Silky Smooth Skin Soap and make sudsy bubbles which cover the entire deck. Nami comes out when she hears them laughing loudly and is surprised by the bubbles. Getting carried away, Luffy falls off the Ab-Ab Slider and overboard. He grabs the figurehead to prevent himself from falling into the sea but he launches himself straight into Nami's room knocking all of her map-making supplies to the floor in a crash. Furious, she demands they all stay quiet or else she would charge them all 100,000. Luffy tries to apologize, but she pushes them all out. Chopper is both scared and saddened by Nami's frustration.\nNami returns to her map-making and everyone except Chopper falls asleep on the ship's deck. He notices the clouds change and a tornado appears before them. Terrified, he tries to tell Nami but recalls her threat. Unsure what to do he sits on the ship's deck in fear. Nami finishes her first map and exits her room to find Chopper crying about the tornado and not being able to tell her. She reassures him that everything will be alright and wakes up the crew. They all jump to raise the sails and steer the ship, except Robin, who continues to read in the rain. After they pass the storm Nami tells everyone about her first map and reaffirms her dream to chart the whole sea. Robin finishes reading and closes her book and the crew lowers the sails to continue onward.\n",
  "characters": [
    "Nami",
    "Roronoa Zoro",
    "Monkey D. Luffy",
    "Tony Tony Chopper",
    "Usopp",
    "Nico Robin",
    "Sanji",
    "Rice Rice",
    "Bell-mère (flashback)",
    "Nojiko (flashback)"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "to",
      3
    ],
    [
      "a",
      2
    ],
    [
      "of",
      2
    ],
    [
      "and",
      2
    ],
    [
      "her",
      2
    ],
    [
      "luffy",
      1
    ],
    [
      "fishes",
      1
    ],
    [
      "weird",
      1
    ],
    [
      "salesman",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      61
    ],
    [
      "and",
      49
    ],
    [
      "to",
      41
    ],
    [
      "he",
      27
    ],
    [
      "her",
      27
    ],
    [
      "a",
      24
    ],
    [
      "she",
      18
    ],
    [
      "rice",
      16
    ],
    [
      "luffy",
      13
    ],
    [
      "of",
      13
    ],
    [
      "nami",
      10
    ],
    [
      "that",
      10
    ],
    [
      "they",
      10
    ],
    [
      "chopper",
      9
    ],
    [
      "for",
      9
    ],
    [
      "them",
      9
    ],
    [
      "his",
      9
    ],
    [
      "in",
      8
    ],
    [
      "with",
      8
    ],
    [
      "crew",
      7
    ]
  ]
}