{
  "chapter_number": "Episode 289",
  "title": "Zoro's New Technique Explodes! The Katana's Name is Sogeking?",
  "short_summary": "Zoro has to fight with Sogeking stuck in his right hand holding a katana against Kaku and Jabra. Franky defeats Fukurou.\n",
  "long_summary": "Now recharged, Franky launches Fukurou through a wall, with a Strong Hammer punch, amazing Chopper. However, the zipper-mouth agent is not down yet, giving rise to Franky using his Franky Destroyer Cannons. Escaping, Fukurou uses Soru, and tries to ambush Franky, only for Chopper to reveal his location.\nAngered, Fukurou forces himself and Franky out into the ocean, leaving Chopper unable to help out, due to his Devil Fruit side effects. However, Chopper ends up having more important things to deal with, as Kumadori releases himself from the fridge.\nFranky and Fukurou each try to send the other into the waterfall, resulting finally in Franky using Strong Right to secure himself to Fukurou, and take him down with him. Desperate to save himself, Fukurou uses Geppou, but Franky holds on, making the condition that the fight can continue on shore, as long as Fukurou uses Geppou to get them both to safety. After a boastful spar of words, both say that they have a move that will finish things off once and for all.\nAs Sogeking and Zoro still try to escape Jabra and Kaku, Sogeking tries to use the CP9 agents' rivalry against them, by invoking arguments between them, trying to make them fight over who's better. Zoro, however, spoils this, by saying exactly what Sogeking must be planning. Zoro then suggests that to get free, they play Janken, the stakes being that the loser has their hand chopped off, to which Sogeking greatly opposes. Finally, Zoro thinks up another plan, and decides to fight with Sogeking in his right hand against Kaku and Jabra, with Sogeking holding the katana Zoro cannot use in his trapped hand, in essence using Sogeking as a replacement katana.\nAs Fukurou continues to take himself and Franky into the air, he decides to finish things quickly by using Tekkai Dama to spin Franky into the Tower of Justice. Franky uses a combination of Franky Centaur and Coup de Vent to keep things stable, and finally uses another, more powerful Coup de Vent to send Fukurou into the ground with full force, winning his fight with a victorious \"SUPER!\"\n"
}