{
  "chapter_number": "Episode 108",
  "title": "The Fearsome Bananawani and Mr. Prince",
  "short_summary": "Most of the Straw Hat Pirates are helplessly trapped. Vivi leaves to find help but Crocodile is contacted by \"Mr. Prince\".\n",
  "long_summary": "Chaka orders the royal guards to attack the rebels in order to protect Arabasta. Meanwhile, Koza and the rebels head to Alubarna. The Straw Hat Pirates are still locked up in Crocodile's cell. Crocodile taunts the tied up Vivi, with a key to get the locked up pirates. Vivi is able to get free from the ropes but the key that Crocodile had \"accidentally\" slips from his hands and goes through his trap door where one of his many banana crocodiles eats it.\n\"Mr. 0\" gives everyone in his VIP room one hour to live due to water filling the room. Before he is able to leave with Miss All-Sunday, Crocodile gets a call on his responder snail from \"Mr. Prince\" who the Straw Hats recognize as Sanji. \nVivi leaves to get Sanji and Chopper to help save the rest of the Straw Hat Pirates. The bridge of the casino collapses before Princess Vivi can leave, trapping her inside the casino. But Sanji says that he didn't do it to keep her trapped inside, but rather to keep the Baroque Works out of the casino.\n",
  "characters": [
    "Chaka",
    "Koza",
    "Kebi",
    "Nefertari Vivi",
    "Crocodile",
    "Roronoa Zoro",
    "Smoker",
    "Nami",
    "Usopp",
    "Monkey D. Luffy",
    "Miss All Sunday",
    "Toto",
    "Igaram (flashback)",
    "Mr. 3 (flashback)",
    "Mr. 2 Bon Kurei",
    "Tony Tony Chopper",
    "Ultraking",
    "Mr. 1",
    "Banchi",
    "Miss Doublefinger",
    "Sanji"
  ],
  "ssum_frequencies": [
    [
      "most",
      1
    ],
    [
      "of",
      1
    ],
    [
      "the",
      1
    ],
    [
      "straw",
      1
    ],
    [
      "hat",
      1
    ],
    [
      "pirates",
      1
    ],
    [
      "are",
      1
    ],
    [
      "helplessly",
      1
    ],
    [
      "trapped",
      1
    ],
    [
      "vivi",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      17
    ],
    [
      "to",
      12
    ],
    [
      "his",
      5
    ],
    [
      "vivi",
      4
    ],
    [
      "of",
      4
    ],
    [
      "in",
      3
    ],
    [
      "and",
      3
    ],
    [
      "straw",
      3
    ],
    [
      "pirates",
      3
    ],
    [
      "up",
      3
    ],
    [
      "crocodile",
      3
    ],
    [
      "get",
      3
    ],
    [
      "from",
      3
    ],
    [
      "but",
      3
    ],
    [
      "sanji",
      3
    ],
    [
      "casino",
      3
    ],
    [
      "rebels",
      2
    ],
    [
      "hat",
      2
    ],
    [
      "locked",
      2
    ],
    [
      "crocodiles",
      2
    ]
  ]
}