{
  "chapter_number": "Episode 242",
  "title": "The Signal is the Explosion! CP9 Starts to Move",
  "short_summary": "The Straw Hat Pirates (still missing Sanji) rush to Galley-La Company where Robin and CP9 begin a raid. In Iceburg's room, Robin and the mysterious man Iceburg saw before, tell him that they have purposely placed the blame on the pirates. Their true aim is the blueprints he would have passed down to Paulie. Luffy is stuck in a building, separated from his group.\n",
  "long_summary": "Just outside of the Galley-La Company, the mob of shipwrights is guarding every entrance into the building preparing for the said arrival of the Straw Hat Pirates. Chopper is continuing to watch as the shipwrights are surrounding the building and Zoro wants to know what's going on. Chopper says that the shipwrights are just standing around but are armed. Nami urges everyone to be careful as the shipwrights can be deadly when push comes to shove and not to rush in. Luffy agrees not to rush in and Zoro tells Chopper not to take his eyes off of the building as something may happen. Zoro then says that it's their only opportunity to know the truth of Robin and it has to be tonight. Luffy then says that they'll be talking to her soon.\nInside of the Galley-La Company, the mob of shipwrights and Paulie, Kaku, Rob Lucci and Hattori, Peepley Lulu, and Tilestone are still on guard. In his room, Iceburg asks Kalifa to step out of his room and ask Paulie to come inside. Kalifa steps out and informs Paulie that Iceburg needs him and Kalifa decides to head into her office if anyone needs her. Kaku thinks it's an odd time for a one-on-one conversation and he and Paulie wants to know what it's about. Tilestone attempts to talk loudly but Paulie, Kaku, Lucci, and Lulu all knock him out before he can do so. Lulu then tells Paulie to head inside and find out and he and the others will move away to keep the conversation private. Tilestone wants to know what Iceburg is talking to Paulie about but Lulu says that they should be focusing on the pirate problem. Hattori says that they should look out for a pirate crew with seven members and also says that they should really watch out for Luffy, Zoro, and Robin. Kaku says not to underestimate the girl traveling with them or the other guy with the long, round nose. Hattori says that there is them along with two others. As Hattori says to take down the pirates if they set foot on their property, Iceburg and Paulie can be seen talking. Paulie agrees to Iceburg's plea and swears to him that he wouldn't fail. Paulie exits the room and tells everyone that he has to take care of something and Lulu says that he and the others will watch over Iceburg. Paulie then walks off into a room remembering Iceburg telling him to move his desk and reveal a safe underneath. Paulie then enters the combination to try and open the safe.\nJust outside, Robin can be seen with the bear-masked CP9 agent and they receive a message from another agent. The agent says that there will be a signal just in a moment and that will be their time to strike. The bear-masked agent asks Robin if she's ready and she confirms so. Suddenly, a large explosion goes off shocking everyone in the area including the shipwrights and the Straw Hats. The bear-masked agent and Robin then make their move and jump into the courtyard. The shipwrights inside are running around trying to find any intruders. Tilestone asks if Iceburg is okay and Iceburg says he is but a little shocked. Tilestone overhears other shipwrights finding a masked man in the building and he and Lulu run off. Kaku attempts to stop them but decides to sit just outside the door along with Lucci. Back outside, some shipwrights are chasing another masked CP9 agent. The CP9 agent easily takes them down and heads up for the room. More shipwrights can be seen being taken down by Robin's ability and the bear-masked agent easily knocks some aside. Chopper continues to watch them down there and Zoro, Chopper, and Nami all notice that Luffy is gone. Zoro and Nami are furious that Luffy rushed off without a plan.\nA mob of shipwrights corner Robin and the masked-bear agent and they threaten to kill them. The masked-bear agent pulls out and cape and, as the shipwrights are shooting, he and Robin suddenly disappear leaving the shipwrights confused. Back on the roof, the other masked CP9 agent continues to fight off the shipwrights. The masked agent suddenly starts walking/flying around in the air (Geppou) and takes out a mob of shipwrights with his rose attack (Thorny Rose). The agent heads inside the building while two other CP9 agents arrive. Paulie manages to get what was in the safe but, suddenly, the two CP9 agents appear behind him. The masked agents inform Paulie to hand over the paper and Paulie is horrified to see that they killed off many shipwrights. Paulie then knows that it isn't an assassination plot and the bull-masked agent says that they need the item in Paulie's hands. He then says that since Paulie knows of it, he needs to be taken down as well. Back outside, the shipwrights continue patrolling the area trying to find out where the agents went to. Robin and the bear-masked agent walk to a wall and the bear-masked agent suddenly makes a door into Iceburg's room from the wall. Iceburg is shocked to see this and the bear-masked agent says it's because of the Door Door Fruit. He then shoots Iceburg on the shoulder causing him to fall onto the ground. Robin is surprised by this but the agent says it's not fatal but a warning shot. Iceburg then notices that Luffy has nothing to do with the assassination plot and Robin confirms this. The bear-masked agent then says that Iceburg is alive for two reason: to tell his side of the story of the assassination plot and they were trying to find an important document - blueprints of a ship. The bear-masked agent then says knowing that Iceburg's life is in danger, that he will pass it down to his most trusted. Iceburg then realizes it's a trap and that Paulie is in trouble. The bear-masked agent then tells Robin that he'll go and deal with the people just outside the door and that if the blueprints are retrieve, she'll have to kill Iceburg. He then says that once Iceburg is gone, Paulie will be gone as well and the blame will still be placed on the Straw Hats. Back outside, Zoro, Chopper, and Nami are running toward the building talking about how Luffy recklessly rushed in. They eventually run into a mob of shipwrights and Luffy can be seen stuck between some buildings. Luffy tries to free himself saying that he must get to Robin.\n"
}