{
  "chapter_number": "Episode 154",
  "title": "Godland Skypiea! The Angels Of the Cloud Beach",
  "short_summary": "As the crew arrives in Skypiea, they are greeted by Conis and her pet Su. Conis and her father start explaining how the life in Skypiea is and how the different Dials work.\n",
  "long_summary": "The Straw Hats, with the help of the Speedy Crab, are finally transported to Skypiea. Robin mentions the sign Skypiea which they see and Nami indicates that it is the same name on the map which Luffy had in a destroyed ship previously. The Straw Hat Pirates land on Skypiea and begin exploring the new environment. They comment on the fluffy cloud, the fluffy cushion, the fruit - Conasshu, the flowers, etc. While exploring, they hear the sound of a musical instrument and Zoro comments that someone is present. Usopp thinks it's a guerilla and upon seeing the figure, Sanji comments that it was an angel.\nThe angel named Conis greets them and asks if they were Blue Sea Dwellers and Luffy responds that they came from the Blue Sea. She offers to open the Conasshu for Luffy stating the outside of the fruit is as hard as steel and cannot be bit into. Conis finally introduces herself and the cloud fox Su. She asks to be of service if they have questions. At that time, her father comes riding towards them. Nami asks what it is he is riding on and Conis responds that it is called a Waver.\nNami then remembers that the Waver is the equipment Noland mentioned in his travel log, a ship that sails without wind. She asks how it's possible and Conis responds asking if they have heard of dials. Luffy tries riding the waver but is unable to control the machine. Nami borrows the waver and rides it skillfully to the surprise of everyone including Pagaya who says it takes 10 years of practice to learn how to ride the waver. Nami asks Pagaya if she can ride some more on the waver and he agrees. Usopp comments on the construction site he found and Pagaya tells them it is the site where clouds are cut for construction. He explains to them regarding Sea Clouds and the Island Clouds as well as the technology behind the Seastone.\nThey arrive at Conis' house and Sanji goes to the kitchen to explore the Sky Cuisine while Robin asks Conis to explain more about dials to them. Luffy is already holding on to one when Conis asks him to say something into the dial. After that she tells him to press the apex of the dial and what he says was repeated. She explains that the dial is called the Tone Dial. Conis goes ahead and explains the various types of dials, how and where the sea shells are found and the dial behind the use of a waver.\nSanji brings out their food and comments on not seeing Nami on the sea. Usopp indicates that she may have gone exploring and Conis and Pagaya state their uneasiness. Conis tells them of the place where they must not go under any circumstance. The place adjacent to the Island and easily reached with the Waver. Meanwhile, Nami arrives at a place and comments on how huge the place is. The rest of the crew asks Conis what she means and she tells them the place they must never go to The Land Where God Resides - Upper Yard.\n"
}