{
  "chapter_number": "Episode 247",
  "title": "The Man who is Loved by his Ship! Usopp's Tears!",
  "short_summary": "Franky tries to get Usopp to listen to reason about the condition of the Going Merry. Though Usopp does understand the truth, he relates some odd experiences occurring with the ship recently that gave him pause in admitting it. Meanwhile, the foremen of Galley-La Company appear to be on the move. Is the Franky Family their next target?\n",
  "long_summary": "Back at Dock Six of Water 7, Usopp continues to patch up Going Merry. Franky asks Usopp point-blank what his plans are once Merry is fixed. He'd like to eventually sail Merry back to East Blue. Franky quickly tells him that's not happening. He had examined Merry while having it lifted into Dock Six, and corroborated Kaku's diagnosis of a broken keel. Franky suggests dismantling Merry was pretty much the only sane course. Usopp told him not to, raising his slingshot against him. Franky said that if Usopp's plan were to go down with Merry, he'd gladly allow Usopp to go through with it. But a ship had one purpose: to carry people from one shore to another. By his judgment, Merry was not going to make it to the next shore. Therefore, it was no longer a ship. He grabbed a piece of Merry's hull and ripped it off. Usopp responded by firing Kaen Boshi at Franky, knocking him back.\nFranky, determined to force him to listen to reason, grabs Usopp and throws him down into the work bay, telling him to see the damage for himself. Laying on the bottom of the water, Usopp sees the previous patches applied to the keel of the Going Merry, as well as the additional damage that both Franky and Kaku had warned him out. Still, he climbs out of the water, drags the piece of hull that Franky broke off Merry back into place, and patches it back together. Franky again tells Usopp there is no way Merry will survive another voyage, least of all with an amateur shipwright like him. Usopp tells Franky to shut up...then falls to his knee crying and confesses that he knew all along Merry was no longer seaworthy.\nHe relates an experience from Skypiea, something he thought originally was a dream. He heard what sounded like a wooden mallet hammering on Merry. Though no one should've been there, he could've sworn he saw someone hammering at the ship. The next morning, the Straw Hats found that the ship was inexplicably, though haphazardly, repaired. Not only that, but it had also been restored to its original plan, missing all its previous modifications, including those made for the flight to Skypiea. He recalls hearing a mysterious voice saying the ship would carry them for a little while longer, as if it were the ship itself speaking to him. When he heard the Galley-La assessment, he remembered those words, as if the ship itself were trying to reassure him.\nUsopp then told Franky that he probably thinks he's crazy. But not only does Franky believe Usopp, he knows exactly what phenomenon Usopp was talking about. Usopp had found Merry's Klabautermann: a particular spirit manifested on ships that are cared for greatly by their crews. According to legend, these spirits assist sailors in their time of need. Although Franky had heard the legend many times before, this was the first time he had ever heard someone mention seeing one.\nFranky asks Usopp why he fought Luffy over Merry and left the Straw Hat Pirates when he knew the ship was doomed. Usopp only manages to say it's not that simple before the doorbell rang. Mozu and Kiwi go to answer the door while Franky and Usopp continue to argue over how best to handle the situation; Franky insists he will take care of Merry in a more respectful manner, but Usopp is still not ready to let go even though it is hopeless. This brings out Usopp's feelings that Merry would be disposed of like useless garbage.\nSuddenly, Mozu and Kiwi are knocked unconscious by the person at the door: Kalifa. She is joined by Kaku, Blueno, and Rob Lucci. The episode ends with Franky charging them, identifying them as Galley-La.\n"
}