{
  "chapter_number": "Episode 269",
  "title": "Robin Betrayed! The Expectations of the World Government!",
  "short_summary": "Nico Robin questions why Spandam was given rights to the Buster Call, which triggers his anger, thus leading to him beating her. CP9 plans to kill the Straw Hats because they violated the original arrangement: that they entered Enies Lobby after leaving Water 7. Back in the fray, Franky's Giant Bulls talk with Chopper. He translates and they notice that Sogeking is not with them anymore. Elsewhere, Blueno appears before Luffy.\n",
  "long_summary": "Robin questions why Spandam was given rights to the Buster Call, when she is reminded with the Ohara incident. Robin has a brief flashback of the archaeologists. Spandam tells Robin that the Straw Hats are on the island and should have already been captured (but this report was incomplete). Robin says her agreement was to let the Straw Hats go if she is captured. Spandam then tells Rob Lucci to remind Nico Robin of the exact conditions that were offered, which Rob Lucci explains that the terms of the arrangement were that, excluding Nico Robin, the Straw Hat Pirates would be allowed to leave Water 7 safely; Spandam then tells Robin that after allowing the Straw Hats to leave Water 7 safely as promised, they then decided to come to Enies Lobby (which was beyond the scope of the arrangement). The Marines are still trying to capture Luffy, but are getting clobbered. Fukurou tells Blueno that the report said that only 5 people were down, and they noticed the Den Den Mushi receiver is hooked off. Spandam ask what the CP9 wants and Rob Lucci explain they want blood, and they have the right to kill people because they are with the Government. Sodom and Gomorrah come and rampage over the Marines. Luffy gets cornered by the Marines, so to escape he goes on the roof, but the Marines follow him. Luffy uses Gomu Gomu no Rocket and barely escapes the Marine's attacks. Sodom tells Chopper how Franky helped them out and now they are loyal followers of the Franky Family. The Straw Hats now notice that Sogeking is not with them. The Galley-La Company are at the Main Gate and still fighting with the Marines, Paulie remembers what the Straw Hats said and will now stop the Marines from interfering. Luffy has finally shaken off the Marines and made it to the courtyard. Blueno makes a door out of thin air and explains this is the first time that some has got past the entrance. Blueno asks Luffy when he will stop fighting and he replies that he won't at all.\n"
}