{
  "chapter_number": "Episode 55",
  "title": "The Holy Beast! Apis' Secret and the Legendary Island",
  "short_summary": "The Calm Belt is revealed to have no winds or currents as well as being the home of many giant Sea Kings. Apis forms a plan with Luffy's help and escapes the Sea Kings by riding with one's sneeze. Later, the crew reaches Warship Island, where they listen to the soporific story of the island's creation. After following Apis into a cave where a dragon is hidden, Luffy and Nami find the reason why Apis is being chased.\n",
  "long_summary": "Having entered the Calm Belt, the Going Merry ends up on top of a Sea King's head and is surrounded by other Sea Kings, Zoro suggests that nobody should move or make a sound and hope that the beasts ignore them so they can paddle back. Usopp, in fear, shouts at the suggestion, which a Sea King hears causing it to attack the ship.\nApis falls off the ship but is rescued by Luffy before she is swallowed. She notices that Luffy's arm stretched when he rescued her. While being pulled up to the ship, she sees the Sea King's nose and asks Luffy to swing her back downwards. As she is going down, Apis grabs hold of the Sea King's nostril hair and pulls it out. Luffy finally pulls her back to the ship and Apis is caught by Zoro. The other Straw Hats realize that she pulled out the nostril hair and are panicking because the Sea King is about to sneeze, causing the ship to fall off its head. The force of the sneeze launches the ship across the Calm Belt past the Sea Kings and back to where they started outside the Calm Belt. \nThe crew continue to sail on towards Warship Island. They spot what seems like a huge ship through a thick fog and are awed at its gigantic size. Apis tells them that it is not a ship but is in fact Warship Island and that it is named so because it resembles a warship.\nAs they are approaching the island's port, the residents see their ship and panic seeing their pirate flag. Fearful of a pirate invasion, some of the residents meet them at the shore with weapons. Apis goes down from the ship and greets them. The residents are surprised that Apis is with pirates and ask her why she brought them to the island.\nThe rest of the crew disembark the ship. Apis tells the residents to relax because they are not bad pirates but are nice and helpful. The residents, still skeptical about the crew, continue to question Apis about how she ended up with them since the last time they saw her, she was taken by the marines. She explains how she escaped, got stranded in the ocean and was rescued by the Straw Hats. The residents continue to ask Apis why she was taken in the first place and that it is not safe for her to stay on the island since the marines are still lurking around. An old man calls to Apis and tells her to come to his house. Nami asks who the man is, while Apis runs towards him and tells her that it is her grandfather, Bokuden. Her grandfather thanks the crew for saving his granddaughter and, in honor of Apis' safe return, invites them to a celebration, to which they accept.\nMeanwhile, marines continue to patrol around the island and spot the Going Merry, the Straw Hats and Apis. This is reported to Nelson Royale, who was under the impression that the girl was lost at sea. He verifies this with Eric, who confirms that she indeed got lost at sea. Nelson Royale tells him he is wrong and relays the report to Eric that Apis is back on Warship Island and commands him to capture her again.\nBack on the island, Bokuden is preparing pork buns for the celebration but says that they will not be ready for at least 4 to 5 hours. While waiting, Nami asks Bokuden why the marines are after Apis. Bokuden directs the question back to Apis to which she answers that she does not know. Nami comments that Apis mentioned earlier that she knew why they are after her but just refused to tell them. Apis brushes this off and tells them that she lied. Bokuden then says that he really does not know any reason why the marines would be after Apis and there is nothing significant about the island, except for an old legend. \nThe legend goes that the people of Warship Island are descendants of Lost Island which sank into the sea a thousand years ago, which was also home to the millennial dragons. The bones of these dragons are called dragonite, also known as the Elixir of Immortality. The Straw Hats say that it does not explain why the marines are after the girl and that they must be overlooking something and that this must be connected to the legend somehow. \nBokuden then recounts the legend from the very beginning which bores Apis causing her to leave her grandfather's house. The old man goes on for a while and some of the crew members have already fallen asleep. Luffy wakes up in hunger and leaves. On the way out, he smells the pork buns that the old man was preparing earlier and goes towards the smell. However, Apis is putting all of them inside a sack. Afraid of being caught, Apis hides and is about to hit Luffy in the head, but he stumbles to the floor and falls back to sleep before Apis can hit him. \nNami notices that Luffy has been gone for a while and decides to also sneak out and go look for him as an excuse. She finds him inside the kitchen, and she notices a trail left by the sack Apis was pulling. Luffy and Nami follow the trail which leads them across a cliff onto the other side of the mountain towards a cave.\nInside the cave, Apis is talking to someone she calls as Grandpa Ryu. She recounts how Luffy and his crew saved her from the marines. She proceeds to give him the pork buns she brought with her knowing that he must have been hungry. Luffy and Nami hear her talking to someone and Luffy approaches her asking her where she took the pork buns. Apis is asking them to stay away, shielding something with her small body. Looking closer, Nami and Luffy see that Grandpa Ryu is actually a dragon. Luffy is excited by the sight of a legendary dragon and asks him where he comes from. While there is no audible response, Luffy seems to understand the dragon. Apis tells Luffy that Ryu is telling her that Luffy can be his friend ang that he can tell that he is a good person. Apis says that she is able to read Ryu's mind and asks how Luffy is able to understand him to which Luffy replies that he does not know and that it just happened.\nNami asks if Apis got her ability from a devil fruit. She answers that she ate the Hiso Hiso no Mi once and since then, she has been able to read the mind of any animal. She recounts how she met Ryu, that one day while playing in the fields, she heard a voice in the mountains. She followed the voice into the cave and saw Ryu. He was helpless and had used up the last of his energy searching for his friends. He told her that he got separated from them on their way to their dragon's nest in Lost Island. Nami says that she thought the island was under water, but Apis says that Ryu is certain that it will resurface any day now. The problem, however, is that Ryu does not remember where the Lost Island is located because of old age and Apis has been helping him by researching as to where it may be located. Some marines were in Warship Island, and she made the mistake of asking them if they knew where it was. The marines saw her pendant that is shaped like a millennial dragon claw and took her to question her everything she knew about Lost Island's whereabouts because of the dragonite it may contain, but she refused to tell them anything. Apis is determined to help Ryu get back to his dragon's nest as this will get him his energy back. After hearing this, Luffy says that he is going to help Ryu go back to his home. Nami protests at first because of the legend that the island is underwater and that they have no map to the said island, but Luffy is determined to help the dragon, to which she gives in.\nEric is seen going towards Warship Island and is convinced that due to Apis' possession of the pendant, she must know everything about the dragonite and its whereabouts. \nThis is the first time in the anime that Calm Belts are shown. It also explains where Calm Belts are located and how they are nesting grounds Sea Kings.\nLuffy demonstrates his ability to hear the \"voice of all things\" when he is able to understand Ryu.\n"
}