{
  "chapter_number": "Episode 10",
  "title": "The World's Strongest Weirdo! Jango the Hypnotist!",
  "short_summary": "Klahadore confronts the crew and Usopp, expelling them from the mansion. However, they discover that Klahadore, whose real name is Kuro, is a pirate captain working with a hypnotist to assassinate Kaya.\n",
  "long_summary": "Klahadore confronts the crew, refusing their request for a ship. Redirecting his rage at Usopp, he insults Usopp for his pirate father, calling him a barbaric, lowly criminal. Usopp angrily attacks Klahadore. In response, Klahadore expels Usopp and the crew from the front yard, ordering them to never return.\nKaya remains in her bedroom and cries, and Klahadore enters to console her. He explains his past and the reasoning behind his protection of her. After being expelled from the ship he was working on, he was left derelict in Syrup Village. Kaya's father kindly accepted him into his mansion, and he dedicated himself to servitude for Kaya's family. After Kaya's parents passed away, Klahadore decided to become her guardian and protect her from harm, including Usopp, whom he considers to be a bad influence on her. Kaya forgives Klahadore for his harsh handling of the situation.\nZoro and Nami remain on the outskirts of town with the children. One of the children discovers the strange moonwalking man and alerts the others. The man introduces himself as a hypnotist. He demonstrates his skills by hypnotizing the children with a chakram on a string, causing the children to fall asleep. However, he accidentally hypnotizes himself, causing him to fall asleep as well.\nUsopp and Luffy sit on a cliff, where they discuss Usopp's father, Yasopp. However, they find Klahadore, who is privately meeting with the hypnotist, Jango, at the base of the cliff. To their horror, they find that Klahadore was really Captain Kuro of the Black Cat Pirates. Kuro and Jango intended to assassinate Kaya to inherit her wealth, as Jango could hypnotize Kaya into changing her will. They reveal that Kuro escaped Marine pursuit by sending a lookalike of him to the Marines for execution. Jango reveals that the Black Cat Pirates' ship was stationed at the island, ready to invade the village.\nKuro and Jango spot Luffy and Usopp overhearing their conversation. Jango hypnotizes Luffy asleep, causing him to fall headfirst off the cliff. They decide not to pursue Usopp, knowing the townspeople would not believe him if he spoke out. Usopp flees toward the village.\n"
}