{
  "chapter_number": "Episode 113",
  "title": "Alubarna is Crying! Fierce Fight of Captain Karoo!",
  "short_summary": "Vivi's attempts to stop the rebel army are futile and she is attacked by Mr. 2, but she manages to escape. Meanwhile, the battle between Usopp and Chopper against Mr. 4 and Miss Merry Christmas begins.\n",
  "long_summary": "Sanji realizes that Vivi is in trouble and that Mr. 2 had went after her. He tells Usopp to go and help Chopper at the South East Gate. But Sanji is caught in-between a fight with the Royal Army and Rebel Army. He tells both sides that he is not with either side and beats up both sides to get to Princess Vivi, telling both groups that he only fights for the ladies.\nChopper is caught in a fight with the team of Miss Merry Christmas and Mr. 4.\nMr. 2 attempts to kill Vivi, but Karoo gets up in time to get her on his back and run away, although he is not in a good condition to run fast. Karoo runs up a cliff and is unable to reach the top which is only a step away. But he remembers when Luffy told him that Vivi is the Straw Hats' friend and he flaps his wings and reaches the top. Although, Mr. 2 begins to run up the cliff too. Karoo gets hit with a stray bullet from the fighting and is no longer able to run. After falling, Karoo tells Vivi to run by signaling with his wing because Mr. 2 is getting closer. Out of nowhere two other members of the Duck Troops show up and Sanji is with them. Sanji is left to fight Mr. 2 and the two members of the Duck Troops take care of the injured Karoo.\nZoro and Nami are left with Mr. 1 and Miss Doublefinger. Nami and the ducks cheer Zoro on because they believe he is going to fight the Baroque Works members. But they walk past Zoro and go straight for Nami as they believe that the weakest opponent should be taken out first. Nami tries to talk her way out of it but realizes that they will not back down so she runs away.\nUsopp finds Chopper laying on the ground and wakes him up. Chopper tells Usopp that Miss. Merry Christmas ate the Mole Mole Fruit so she is able to go underground and that Mr. 4 is very strong. Usopp and Chopper are left to dodge the bombs that Mr. 4 continues to hit towards them.\n",
  "characters": [
    "Sanji",
    "Usopp",
    "Matsuge",
    "Tony Tony Chopper",
    "Mr. 4",
    "Miss Merry Christmas",
    "Mr. 2 Bon Kurei",
    "Nefertari Vivi",
    "Karoo",
    "Monkey D. Luffy (flashback)",
    "Roronoa Zoro",
    "Nami",
    "Portgas D. Ace (flashback)",
    "Nefertari Cobra (flashback)",
    "Igaram (flashback)",
    "Ivan X",
    "Cowboy",
    "Mr. 1",
    "Miss Doublefinger",
    "Kentauros",
    "Hikoichi",
    "Lassoo"
  ],
  "ssum_frequencies": [
    [
      "and",
      3
    ],
    [
      "to",
      2
    ],
    [
      "the",
      2
    ],
    [
      "she",
      2
    ],
    [
      "mr",
      2
    ],
    [
      "vivis",
      1
    ],
    [
      "attempts",
      1
    ],
    [
      "stop",
      1
    ],
    [
      "rebel",
      1
    ],
    [
      "army",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "and",
      19
    ],
    [
      "the",
      19
    ],
    [
      "to",
      16
    ],
    [
      "is",
      15
    ],
    [
      "that",
      10
    ],
    [
      "mr",
      9
    ],
    [
      "he",
      8
    ],
    [
      "with",
      7
    ],
    [
      "a",
      6
    ],
    [
      "up",
      6
    ],
    [
      "of",
      6
    ],
    [
      "vivi",
      5
    ],
    [
      "2",
      5
    ],
    [
      "chopper",
      5
    ],
    [
      "but",
      5
    ],
    [
      "karoo",
      5
    ],
    [
      "run",
      5
    ],
    [
      "sanji",
      4
    ],
    [
      "in",
      4
    ],
    [
      "tells",
      4
    ]
  ]
}