{
  "chapter_number": "Episode 248",
  "title": "Franky's Past! The Day the Sea Train First Ran!",
  "short_summary": "The foremen discovered Franky's hidden room, and he feared they would trample his memories. A long flashback ensued, covering Franky's past in Tom's Workers and how he and Iceburg helped create the Sea Train.\n",
  "long_summary": "Franky, angry, charges in and attempts to attack Kalifa for injuring Mozu and Kiwi but Blueno blocks his attack using Tekkai. However, Franky manages to pick up Blueno and overpowering him while yelling at the CP9 agent. Blueno attempts to use Shigan on Franky but Rob Lucci stops him saying they need Franky alive after kicking Franky away. Usopp is surprised at Franky thinking what he did to get Lucci and the others mad (still thinking they're with Galley-La). Franky wants to know how CP9 found out his hidden base but Lucci says it's irrelevant and says that they are there now and are assigned an operation. He then reveals to Franky that they are spies working for the World Government and surprises Franky by revealing his real name as \"Cutty Flam\". Franky is impressed on their detective work but is worried and wants to know where Iceburg is. Lucci says that he is dead much to Franky's shock. Lucci continues saying that Tom entrusted the blueprints to Pluton to Iceburg who then entrusted to Franky and demands Franky to hand over the blueprints. Franky, enraged, fires his right hand at Lucci who effortlessly dodges it and ruthlessly knocks Franky backwards sending him crashing through the wall. Usopp is shocked at what just happened and the crash reveals a secret room. Lucci is surprised to see this and Kalifa informs them they are drafting tables. Lucci confirms that it may be where the Pluton blueprints are and orders the other CP9 agents to find them. Blueno spots nameplates that says \"Cutty Flam\", \"Iceburg\", and \"Tom\" and Lucci walks over to a picture. Franky, who is up on his feet again, tells Lucci not to touch it saying that picture is his memories and is where he grew up with Tom's Workers.\nA long flashback starts with a younger Franky riding on one of his Battle Frankies to Water 7. Franky turns around spots a large Sea King chasing after him and fires cannonballs at it. However, it has no effect only angering the beast more. The Sea King dives into the water causing Franky to crash onto land over Iceburg. Iceburg yells at Franky but soon runs away after seeing the large Sea King who attempts to attack him. Iceburg yells at Franky again saying they should be working on ships and not some \"toys\" but Franky yells back saying they're not toys but his battleships the Battle Frankies. They continue arguing until Tom lifts up the ship and builds it together using sheer strength. Tom is excited at his work with Yokozuna agreeing and Iceburg and Franky are staring in shock. Tom and Yokozuna walk off with Iceburg and Franky giving chase. At Tom's Workers, the group are eating and Tom asks about Franky's latest Battle Franky model. Iceburg blasts Franky on how his latest ship almost got both of them killed but Franky yells back at him. Tom could only laugh at this while Kokoro walks in and tries to calm them down. Kokoro then says that another ship carrying lumber was attacked by pirates and that since the King of the Pirates was executed, the entire city was being taken over. She continues saying that due to that, people are losing hope and that Aqua Laguna is preventing them from getting lumber properly. She fears that Water 7 will eventually sink into the ocean due to the frequent Aqua Laguna hits. Franky remembers that Tom build a large pirate ship before and asks if he could build one. However, Tom laughs angering Franky and Tom says that there is no such thing as a blueprint for a pirate ship but the flag makes it. Later that night, Franky wonders what Tom is working on and Tom says that it's hope for their island and then tells Franky to go to bed.\nAt daytime, a large Judicial Ship pulls into Water 7 and the people want to know what they are here for. It turns out that they are here for Tom and the Marines start to bring him aboard the ship. Franky and Iceburg attempt to get to Tom but a couple of Marines stop them but Tom reassures them that he will be fine. Aboard the ship, the trial is being watched over by Jorge and one of the men says that Tom was responsible of building the Oro Jackson: Gold Roger's ship. He says that Tom has been sentenced to be executed in Enies Lobby due to his involvement with Gold Roger and Franky is horrified to hear this. Jorge says that building a ship is not a crime but says that he must make an exception for the King of the Pirates. Jorge then says that Tom is sentenced to death and orders the Marines to take him away. However, the Marines are unable to move Tom due to his size and strength and Tom starts to speak up about his new project. He says that it will be a train that will run on the surface of the water and says that he'll help lift up the spirits of the people by building a Sea Train. The people and even Jorge sound interested and Jorge tells the Marines to let Tom stay and asks Tom to tell him more. Tom says that the Sea Train is like a ship but pumps out steam and runs on the tracks. He says that it will transport people, goods, and even ships to other islands and won't be affected by the conditions of the seas. Two people complain saying that Aqua Laguna will destroy the tracks and the Sea Kings will cause trouble as well. However, Tom says that the tracks will be submerged under the water a bit so that it won't be affected by the waves and even plans on adding a special siren underwater so that the fish will be alerted when the Sea Train is coming. He says that it will even scare off the Sea Kings so that they won't bother the Sea Train. He plans on connecting the tracks to multiple places much to the excitement of the people and Tom says that he'll finish up the blueprints very soon but says that it'll take a master shipwright to build it. Jorge says that will the Sea Train will also run to Enies Lobby which Tom confirms this and says that the Sea Train will fill Water 7 back with hope. Jorge says how long it will take and Tom says that it will take ten years to build it. Jorge then tells Tom to build it and tells Tom that the next ten years will be considered as probation. The people are excited to hear the idea about the Sea Train but Franky still looks worried.\nBack at Tom's Workers, Tom is glad to still be alive but Kokoro is a little worried that Tom was laughing but is glad to hear about the Sea Train. Iceburg comments saying that the Sea Train is a great idea but Franky suddenly gets up and teaches Yokozuna how to do the front crawl. Iceburg yells at Franky for leaving but Franky is still angry over how the World Government wants to execute Tom for all the work he has done. Franky leaves showing Yokozuna how to swim and Iceburg is still upset at him and even tells Tom that he should kick him out for how he is behaving. Tom says that two years ago, he found Franky on Scrap Heap Island firing cannonballs and Franky says that his parents ditched him. Tom says that his parents were most likely pirates that couldn't handle his behavior. Tom says that he has a good heart and says that he and Iceburg will become master shipwrights someday. Some scenes are shown with Tom showing the finished blueprints to Iceburg and Yokozuna cheers on. The three being to work on the raft while Franky watches from a distance. He constructs another Battle Franky but the others are more focused on building the Sea Train. Eventually, Franky starts to help out much to Tom's pleasure. Franky, Tom, Iceburg, and Yokozuna being constructing while facing several hindrances along the way (including being chased by Sea Kings and the railing breaking apart). Years later, the people are still sulking until one person says that the Sea Train has been completed. The people begin boarding the Sea Train with Kokoro being the conductor. The Sea Train successfully sets off much to the pleasure of the people, Tom, Yokozuna, Iceburg, and Franky. The Sea Train, Puffing Tom, officially makes its departure filling Water 7 with hope.\n"
}