{
  "chapter_number": "Episode 135",
  "title": "Infamous Pirate Hunter! The Wandering Swordsman, Zoro!",
  "short_summary": "Zoro has a flashback about the time when he first met Johnny and Yosaku and faced off against the Dick Bandits along with their leader Dick.\n",
  "long_summary": "The episode begins on an island where a very exhausted Zoro wanders around.\nA group of pirates are seen laughing at a bar named W Brothers. The head of the table is a bandit named Billy, who proclaims he will \"drink this bar dry\" with the other pirates questioning him. Yosaku notices Billy and finds out his 5,000,000 bounty. Johnny is shown to be very reluctant and tells Yosaku, who tries to counter Johnny saying that they can't just take the small guys forever. However, Johnny is still persistent not wanting to risk instant death. \nJust then, Zoro enters the pub very exhausted and sits down wanting food. The owner tells Zoro off since he has no money to pay. Zoro however says he'll pay once he \"collects the bounty from the guy sitting behind me.\" Billy, very angry to hear this, gets up and charges at Zoro. Zoro quickly opens his katana slightly and counters the sword. Zoro, very hungry, asks about Billy's bounty and Billy confirms the 5,000,000 on his head. With the information given Zoro quickly finishes him off in the chest. He now has the money he needs to eat.\nJohnny and Yosaku, very frightened from the ordeal, question if the stranger is the \"Infamous Pirate Hunter guy\" describing him as the 3-sword wielding demon that took the form as a human. Quickly brushing off the rumors they approach Zoro asking him to follow the Bounty Hunter rules and hand over the dead body of Billy because they spotted him first. Zoro ignores, making Johnny annoyed in the process.\nZoro then stops and asks them if they've heard of Hawk Eyes Mihawk. They answer in approval and Zoro explains to them that he is searching for Mihawk so he can defeat him and become the \"Greatest Swordsman\" in the world. He then clarifies he claims bounties only in order to eat, therefore he is no \"bounty hunter\". Yosaku scoffs at Zoro calling his goal an impossible task. Zoro ignores those comments saying he already made up his mind because it was his \"childhood dream\" and nobody can ever change his mind. This comment leaves Johnny in shock. Zoro gets up and apologizes for his intrusion on \"taking their bounty\" and lets them have it. Of course, if they pay the bill for his meal.\nAfter turning in the bounty, Yosaku is seen to be very happy as they now get to lay off the bounty hunting for awhile and be able to eat more nicely. Johnny, still remembering his conversation with the stranger, asks Yosaku \"Why he became a Bounty Hunter.\" Yosaku, confused, answers back, \"To Eat.\" But Johnny explains to him that he became a Bounty Hunter because he yearned to be like the brave Hunters that protected his poor village from the pirates that attacked it. His talk with the stranger made him remember about his own childhood dream. Yosaku laughs it off saying it's not like him.\nSuddenly, the villagers in the town are running in fear closing the windows and running away. One of the villagers tell him that the infamous Dick Bandits are attacking the storage at the edge of town. Yosaku scrolls through the papers and find out he has a bounty of 10,000,000. \nAt the edge of town, Dick breaks open the storage facilities with his massive Pistol and his group of bandits loot the goods. Johnny and Yosaku arrive at the scene with all the frightened villagers. All the villagers are too afraid to reclaim the stolen goods fearing their death. As the Bandits empty the storage Dick becomes very arrogant proclaiming only idiots try to oppose his mighty self. Suddenly he gets hit by a hammer. A boy named Harry tries to attack Dick but to no avail. However the boy won't give up. This makes Johnny reminiscent of his childhood and convinces Yosaku to go on the offense. They charge at Dick, now face to face with him. \nDick shows no fear to the duo. Saying they aren't worth his time and would rather pay them to buzz off. Johnny proclaims he would rather fight for justice. This makes the Bandits laugh. Johnny pleads for Yosaku to fight with him. Yosaku, with a sense of bravery, agrees to the offer. Yosaku then brags how they turned in the 5,000,000 bounty over to the Marines. This causes Dick to stop laughing and get angry at them since it turns out Billy was Dick's younger brother.\nMeanwhile, as the fight begins in the distance, we pan to Zoro walking up the steps to a swordsmith. He walks up to the sweating man and asks if his Meitou has been repaired. He compliments the swordsman for his impressive workmanship. The swordsmith adds on saying it wasn't very easy as Zoro handles his Katanas way too hard and the other two katanas he used are shown to be shattered. He then has a flashback to the time he challenged and fought Kuina. Zoro offers to repay the swordsmith but is denied as it's not everyday you get to see such a beautiful sword. Zoro hands back the long sword, that he had used prior to kill Billy, but the sword shatters right in front of the swordsmith. He scoffs saying Zoro would break every katana he touches. Zoro, with regret, promises to pay him back somehow. As this happens a huge gunshot can be heard. Zoro is informed that the Bandit Mountain Whale Dick has arrived and has a 10,000,000 bounty on him. Zoro is then showing relief as how he can pay the swordsmith back. \nCutting back to the fight, Harry, the little boy, watches in horror as the duo try to fight Dick to no avail as he keeps knocking them back before they could reach him. Even still they get back up to charge at him with determination. Dick questions how they could have taken out his little brother. They reply that they only turned him in. The two bounty hunters charge back one more time, for being called weak, before being knocked out to the ground very weak and worn out. Harry gets mad and charges only to get hit. Dick's crew reports back saying they loaded everything onto the cart. Dick, now out of patience, declares he's had enough with such \"weak punks.\" Johnny and Yosaku gets back up as Johnny proclaims that he would risk his life to prevent the Bandits from getting away. This leaves an impact on Harry. Dick, running out of patience, asks his crew to finish them off. Harry is knocked away by one of the bandits landing in front of Zoro's feet. The bandits then beat up Johnny and Yosaku. Harry gets back up but is stopped by Zoro. He tells Harry to think of what he can do before attacking. \nAs Johnny and Yosaku are badly hurt and thrown to the ground Dick tells them that they had bad luck and he earned nothing from this fight. One of the Bandits picks up a sword and charges to kill them but is interrupted by Zoro's blade. Johnny and Yosaku recognize Zoro and he asks if it's okay to take their bounty again as he needs the money, with them approving. Zoro then ties his bandana on his head as Dick slowly recognizes him. The two also recognize the katana with a white scabbard (Wado Ichimonji). Zoro asks Johnny and Yosaku if he can borrow their katanas. They slowly agree and realize Zoro's identity. Dick doubts Zoro would be able to take out his men even using three swords. Zoro points out there is a difference between \"using three swords\" and \"practicing three sword style\". As the Bandits charge at Zoro he swiftly defeats all of them at once. Zoro looks back at the bodies only to have Dick charge at him from behind and pull the trigger.\nAs the bang happens, we finally cut back to the present to where a big mountain gets blown to bits with Usopp firing next to everyone on board. Zoro comes back to his senses sneezing. As he sneezes, Robin comes in with a jacket. Due to being suspicious of her, Zoro grabs tightly to his Wado Ichimonji, guarding it. He reminds Robin that she can't stand beside him. She tries saying that he'll catch a cold. Zoro declines saying people who catch colds have weak hearts. Robin then reminds him of the Pirate Hunter Zoro name. He then tells her he never called himself that. Robin asks who gave him that name. He replies saying he doesn't know and it has nothing to do with him. Another cannon fire is heard as Robin walks back to reading The Rainbow Mist book.\nWe then cut back to when Dick fires at Zoro with Harry flying in with a Water Bucket, cancelling the gunshot. Zoro uses the opportunity to slash Dick. Zoro examines the borrowed katanas and is relieved they aren't broken. He thanks Harry for helping him. After the commotion both Johnny and Yosaku are in awe of Zoro and ask him to join forces with them. Zoro shrugs and tells them why not. Johnny and Yosaku celebrate.\n",
  "characters": [
    "Roronoa Zoro",
    "Billy (flashback)",
    "Yosaku (flashback)",
    "Johnny (flashback)",
    "Dareda (flashback, wanted poster)",
    "Dick (flashback)",
    "Harry (flashback)",
    "Kuina (flashback)",
    "Tony Tony Chopper",
    "Usopp",
    "Monkey D. Luffy",
    "Sanji",
    "Nami",
    "Nico Robin"
  ],
  "ssum_frequencies": [
    [
      "the",
      2
    ],
    [
      "and",
      2
    ],
    [
      "dick",
      2
    ],
    [
      "zoro",
      1
    ],
    [
      "has",
      1
    ],
    [
      "a",
      1
    ],
    [
      "flashback",
      1
    ],
    [
      "about",
      1
    ],
    [
      "time",
      1
    ],
    [
      "when",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      95
    ],
    [
      "to",
      62
    ],
    [
      "and",
      46
    ],
    [
      "he",
      42
    ],
    [
      "zoro",
      40
    ],
    [
      "his",
      29
    ],
    [
      "him",
      25
    ],
    [
      "a",
      23
    ],
    [
      "of",
      23
    ],
    [
      "yosaku",
      21
    ],
    [
      "with",
      20
    ],
    [
      "johnny",
      20
    ],
    [
      "as",
      19
    ],
    [
      "they",
      18
    ],
    [
      "in",
      18
    ],
    [
      "dick",
      18
    ],
    [
      "is",
      16
    ],
    [
      "that",
      16
    ],
    [
      "back",
      16
    ],
    [
      "bounty",
      15
    ]
  ]
}