{
  "chapter_number": "Episode 186",
  "title": "Capriccio to Destruction! The Impending Doom of Sky Island!!",
  "short_summary": "Enel's thunderclouds are coming down to Sky Island while the evacuation is half complete.\n",
  "long_summary": "The episode starts with Enel shrugging off Sanji then hearing the explosion and seeing the black clouds are not coming out of the chimney anymore. Enel curses Sanji and figured one of the gears must have been dislodged. He dematerializes to go reset it.\nSanji's blackened and seemingly lifeless body is still on the deck. We see Usopp has hooked the Usopp AAaaaAAAaaaAA on a sidewall of the ship and is climbing up the side thanks to his starfish-shoes. He peeks on the deck and sees Enel is gone. Usopp talks to Sanji's body and reassures him that Nami landed safely. Then he carries Sanji's body to the edge of the boat and thinking on how he needs to lands on the island cloud and not in the jungle or the ruins, he uses some special spring shoes - Usopp Hopping - to jump off the ship in the air while carrying a still-unconscious Sanji in his arms. Unfortunately, he jumps too far and starts to panic when he sees his landing spot is going to be right in the middle of the jungle. As he is about to crash though, the rope he is still attached to held him back and they start dangling in the air. The hook then gives in and they start falling back down but land on some island clouds. Nami who is watching from afar goes to get them with her Waver. Nami thanks Sanji who is still unconscious for saving her then tries to pull an upside down Usopp out of the cloud.\nOn Ark Maxim, we see pipes bursting, glass breaking and pieces of machineries giving in. Enel who is walking inside the ship curses Sanji again. But he then confidently says that it won't be that easy to drop the Ark from the sky as there is a back-up system based on technology from his homeland of Bilka. Using the power of 200 extinct Jet Dials, the Ark can stay in the air for a full extra hour after the propulsion mechanisms have failed. Enel is confident that the \"final performance\" is still coming and using his physical strength starts repairing pieces that were out of joint.\nBack on the ground, Nami tells Usopp of the giant bean stalk being also in the ruins of the City of Gold and therefore they must have landed right above it on a higher cloud. Usopp is a bit confused but tells her the priority is to leave because if they stay where they are (with the Ark hovering above them), they could be in trouble. Nami agrees they need to find the others and get off the island.\nWe see Luffy and Aisa running through the ruins. Aisa is dragging Pierre by the beak and Luffy is running with his arm stretched by the weight of the golden ball behind him. As he runs though, the ball starts getting her own momentum and rolling on her own taking Luffy with her in the wrong direction. Aisa is irritated with Luffy for destroying Shandora by crashing into the walls.\nOn the Ark, the thunderclouds are being released again. Enel is satisfied and looking forward to his \"final gala\" but is irritated that Sanji's body is gone.\nAn out-of-breath Luffy has finally arrived at the site of the earlier \"Final 5\" battle but he and Aisa are surprised to see everyone gone - Robin, Zoro, Chopper, Wyper and Gan Fall. They guess that Robin must have used her ability to get everyone back on higher ground already. Aisa is very upset looking at the giant hole Enel's final attack on Wyper had created in the ground. She flashbacks to Robin telling them about Enel's plan to destroy Skypiea and tearingly asks Luffy if this is really going to happen.\nLuffy is running up the beanstalk with Aisa and Pierre on his back and still dragging his golden-ball-encased arm behind him. Aisa is hopeful she will get to see Wyper once arrived up there.\nWe see Robin looking up the stalk and reflecting on the fact the Ark is heading towards the Great Belfry as she expected. She hopes Nami and the boys are safe and are not on board anymore. Luffy is running higher on the stalk and Aisa notices Robin below. She points it out to Luffy who then throws Aisa and Pierre in the air for Robin to take care of. Robin catches them with her Hana Hana no Mi abilities but Luffy is dragged lower down the stalk by the golden ball that had gotten caught in the movement when he threw Aisa below. Robin wonders what the golden ball is about and Luffy confirms with her that the Golden Bell should be at the top of the stalk and that it is what Enel is aiming for. In the background, Aisa is still freaked out about witnessing Robin's multiple arms. And then Luffy's gone before Robin finishes her explanations. Robin then inquires with Aisa about Nami's fate. Aisa first says Nami should be on the Ark then realizes her mantra ability can only pick up one voice left up in the air.\nNami, Usopp and a still-unconscious Sanji arrive on the Waver and everyone reunites. Usopp is upset to see Zoro, Chopper and the others unconscious on the ground and says that if he had been there... Nami inquires about Luffy and Aisa tells her he went up the stalk to face Enel and save her. Everyone commiserates about Luffy and needing to get off the island soon. Nami tells the others to go back to the Going Merry while she is going up the stalk to follow Luffy.\nLuffy is still running up the Ark cursing Enel.\nAt the Shandia village, the Shandia are still rushing to board the ships out of there. One lady is worried about Aisa but the Shandia Chief hopes she is with one of the warriors.\nOn Angel Island, the sky is still turning dark and people still rushing to flee. Some of the White Berets are informing McKinley they need to use the ships at the wharf, otherwise they won't have enough space to fit everyone. McKinley says there is no time to go there and urges them to create a river with some emergency Dials. Half of the islanders are still on the island and after angrily remembering Conis' speech urging the islanders to flee, McKinley tells the White Berets not to let people take any belongings with them to make sure everyone leaves.\nWe see that the Milky Road is jammed with boats trying to leave. At Heaven's Gate, Amazon is taking pictures of the fleeing boats and asking for a 2,000,000,000 extol disembarkation fee. People on the boats try to warn her to leave too as Skypiea is about to be destroyed.\nAt the Going Merry, Conis notices the wind has stopped. Suddenly we hear then see lightning coming out of the thunderclouds and burning trees and attacking buildings and people on Angel Island. Nami, Usopp and the others see the lightning starting to strike and are shocked. Enel says the time has come and the lightning starts to intensify. The jungle on Upper Yard and buildings on Angel Island are getting destroyed and people are panicking. The wharf gets attacked by the lightning and the White Berets try to direct the remaining islanders to the beach where there still are some boats left.\nOn the Shandia village, the boats still have not left and the Shandia Chief prays to Kalgara for protection.\nThe huge lightning bolts are destroying parts of Upper Yard and Usopp and the others are getting thrown around. Suddenly, Wyper opens his eyes. Nami again tells the others to flee while she goes to get Luffy. She rides the Waver up the stalk. While Usopp asks Robin to help carry the unconscious bodies, Aisa sees Wyper has woken up and is standing. Zoro and Gan Fall both wake up at that point. Gan Fall asks if Enel has started yet. Chopper, Sanji and Pierre are still unconscious. Robin tells everyone to hurry because there is nothing they can't do here anymore. Wyper seems to be looking wistfully at the destruction before them.\nNami is riding up the beanstalk worrying how Luffy is going to fight an enemy that can fly. Enel is looking at the lightning destroying Upper Yard and enjoying the spectacle. Luffy is running up the beanstalk, golden ball in tow, warning Enel he is not going to get away with it.\n"
}