{
  "chapter_number": "Episode 255",
  "title": "Another Sea Train? Rocketman Sortie",
  "short_summary": "Sanji fights his way through another train car and finds Usopp and Franky. Seeing how determined Luffy is to save Robin, Kokoro and Iceburg lend the Straw Hats the use of another sea train, Rocketman. The Franky Family shows up, pleading with Luffy to let them help out, because they'll do anything for their leader, and Luffy agrees to let them come.\n",
  "long_summary": "Luffy wants to depart right away to Enies Lobby even though the Aqua Laguna is hitting the island. He asks Paulie if there's a ship he could borrow to get them there, or better yet, a sea train. Paulie informs them that the sea train was built by a team headed by a legendary shipwright and there's nothing else like it in existence in the world and if they were to set out, they would immediately get killed so they would do better to wait until morning.\nAt that moment Nami remembers reading about Enies Lobby and the Gates of Justice - a set of large steel gates beyond which people only find despair. Enies Lobby is known as the Judicial Island and has a judicial court located on it. However, it functions as such in name only; if you're taken to Enies Lobby, you're already considered guilty. Beyond the Gates of Justice lie two locations, one is the Marine Headquarters and the other is Impel Down - an undersea prison reserved for the criminals who once ran amok in the world. Robin, who has a bounty on her head, would only suffer pain once she crossed those doors.\nPaulie tells them that they shouldn't go there because they are pirates too and would get caught. Luffy declares he is going and he would steal a ship to get there. Paulie and Luffy are about to fight, when Kokoro stops them and asks Luffy to follow her if they didn't fear death.\nSanji gets to the railcar where Franky and Usopp are tied up and after defeating all the officers inside, Sanji and Franky get into an argument that Usopp unsuccessfully tries to stop. There are several Den Den Mushi there which Sanji plans to use to call Nami. But the argument is loud enough that Captain T Bone who is in the next car is alerted and draws his sword to check the commotion.\nKokoro leads Luffy, Zoro and Chopper to the unused sea train, Rocketman. It is a sea train which wasn't used because its speed couldn't be controlled. Iceburg is already at the train and has serviced it and filled it with coal enough to last the trip. After he is thanked by Luffy, Iceburg tells him that he can thank him later if he isn't killed by the train ride.\nNami comes there bringing with her the two conductors who are carting in meat and drinks, and both Zoro and Luffy dig in and thank her. While he is eating, the Franky Family members come in and beg Luffy to be let to ride with them to go and rescue Franky. While Nami opposes, Luffy just tells them to get in; however, they would ride on king bulls and need only hold on to the train as it went.\nThe gang get on and the train is ready to depart with Kokoro piloting the Rocketman as she tells Iceburg to rest up, and that Franky would be okay, as he got hit by a Sea Train and survived. Paulie also sneaks onboard the train as it is leaving while Luffy gets on top of the train and holds on. He yells that they are going to get everything back as the train departs.\n"
}