{
  "chapter_number": "Episode 267",
  "title": "The Means of Escaping is Opened! Fly through the Sky, Rocketman!",
  "short_summary": "While Nico Robin and Franky are brought before Spandam, Luffy blasts his way through another wave of Marines. In order to get past the gate, Zoro orders that they just keep going. Yokozuna bends down the outside gates and they fly over the gate by using it as a ramp inside. Back on the ground, Paulie is stabbed by someone from the Watchdog Unit of the Law. The Rocketman flies over the gate and the point of the train smashes into Oimo's back, knocking him out cold.\n",
  "long_summary": "The Rocketman is nearing Enies Lobby. Meanwhile, Nico Robin and Franky are brought before Spandam, the leader of CP9. Spandam mocks Tom for rebelling against the government. Franky then attacks Spandam by biting him. Kumadori defended Spandam by striking Franky's chains with his staff.\nOn the streets, Luffy defeats another wave of Marines and World Government agents. He runs near the top of the building, rips out a portion of wall, throws it into the air, and uses his Gatling Gun move to cause the wall to turn into rubble flying in all directions.\nThe remaining Marines approach Baskerville, a group of three people dressed up as a single person. They tell Baskerville that Kashi has been defeated, and that Oimo is being overwhelmed by the remaining fighters. Baskerville sends one hundred men from the Watchdog Unit to the area.\nAt the gate, Oimo is distracted by the Franky Family while Mozu and Kiwi manage to unlock the gate. Oimo tries to stop them from getting past the gate but is restrained by Paulie's Rope Action. The King Bulls pull the rope, causing Oimo to spin. \nMeanwhile, the Rocketman finally reaches Enies Lobby. Yokozuna pushes on the gate, allowing the Rocketman to ride over the fence. The train is sent flying into the air. Meanwhile, the Franky Family finally defeats Oimo. Paulie advances past the gate with the others, only to be stabbed in the shoulder by a member of the Watchdog Unit. Oimo also wakes up, only to be knocked back out by the Rocketman crashing into him.\nThe Straw Hats emerge from the Rocketman and defeat the Marines and agents. The remaining agents corner Luffy near the end of a cliff. Luffy screams at the agents and tells them to stay out of his way.\n"
}