{
  "chapter_number": "Episode 4",
  "title": "Luffy's Past! The Red-Haired Shanks Appears",
  "short_summary": "The significance of Luffy's straw hat is explained as the hat was entrusted to him by his idol, Shanks. Luffy then accidentally finds himself in Orange Town, territory of the pirate Buggy.\n",
  "long_summary": "The burglar girl's dinghy is discovered by three Buggy Pirates while at sea. Pretending to be a desperate, stranded woman, she lures the pirates on her boat with promises of treasure. However, she secretly boards the Buggy Pirates' boat and sails away from them without their knowledge. The ship the pirates are on capsizes from a windstorm.\nMeanwhile, Luffy and Zoro sail towards their next destination, but Luffy loses his signature straw hat when the boat jostles. Zoro recovers the hat, and its significance to Luffy is explained.\nIn his childhood, Luffy befriended Shanks, a pirate captain residing in his home village. While Luffy and the Red Hair Pirates were at a bar, Luffy unknowingly ate the Gomu Gomu no Mi, a Devil Fruit Shanks had acquired during his travels. Upon eating the fruit, Luffy's body immediately gained rubber-like properties, but he had permanently lost the ability to swim. \nHowever, Luffy was terrorized and threatened by Higuma and his group of mountain bandits. Although Shanks and his pirates came to his aid, Higuma escaped, abducting Luffy. Higuma sailed out to sea on a small rowboat and threw Luffy into the sea for him to drown. However, a Sea King, a carnivorous sea monster, appeared and devoured Higuma whole, threatening to target Luffy next. Shanks rescued Luffy, but he lost his left arm in the process. \nEventually, the Red Hair Pirates departed from Foosha Village and set sail for the Grand Line. Just before he left, Shanks entrusted Luffy with his straw hat for him to protect. Throughout the years, Luffy cherished his hat to remind him of his idol. \nBack to the present day, Luffy is abducted by a bird and sent flying away. The Buggy Pirates who were left stranded in the sea discover Zoro's rowboat, board it, and attempt to hijack it, but are swiftly defeated by him. The Buggy Pirates explain that Buggy is a fearsome pirate with his own Devil Fruit ability. \nMeanwhile, the bird lets go of Luffy after being shot down by cannon fire, causing Luffy to fall into Buggy's territory. He meets the female thief for the first time, who had stolen the map and was being pursued by Buggy Pirates.\n",
  "characters": [
    "Tightrope Walking Funan Bros",
    "Nami",
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Shanks (flashback)",
    "Lucky Roux (flashback)",
    "Benn Beckman (flashback)",
    "Yasopp (flashback)",
    "Limejuice (flashback)",
    "Building Snake (flashback)",
    "Makino (flashback)",
    "Higuma (flashback)",
    "Bonk Punch (flashback)",
    "Woop Slap (flashback)",
    "Lord of the Coast (flashback)",
    "Pinky",
    "Superhuman Domingos",
    "Buggy"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "of",
      2
    ],
    [
      "hat",
      2
    ],
    [
      "significance",
      1
    ],
    [
      "luffys",
      1
    ],
    [
      "straw",
      1
    ],
    [
      "is",
      1
    ],
    [
      "explained",
      1
    ],
    [
      "as",
      1
    ],
    [
      "was",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      24
    ],
    [
      "luffy",
      16
    ],
    [
      "and",
      13
    ],
    [
      "to",
      12
    ],
    [
      "his",
      12
    ],
    [
      "pirates",
      10
    ],
    [
      "a",
      10
    ],
    [
      "by",
      6
    ],
    [
      "buggy",
      6
    ],
    [
      "sea",
      6
    ],
    [
      "shanks",
      5
    ],
    [
      "is",
      4
    ],
    [
      "of",
      4
    ],
    [
      "but",
      4
    ],
    [
      "hat",
      4
    ],
    [
      "in",
      4
    ],
    [
      "he",
      4
    ],
    [
      "higuma",
      4
    ],
    [
      "for",
      4
    ],
    [
      "him",
      4
    ]
  ]
}