{
  "chapter_number": "Episode 88",
  "title": "Zoan Type Devil's Fruit! Chopper's Seven-Level Transformation",
  "short_summary": "Chopper demonstrates the powerful abilities of his Rumble Balls when fighting Chessmarimo. Dalton is revived by the Isshi-20.\n",
  "long_summary": "Luffy plants Hiriluk's flag on top of a tower and propels himself towards Wapol and Chessmarimo. He then asks Chopper if he would be a able to handle Chessmarimo by himself and he responds by saying it will be \"a piece of cake\". Chopper takes a Rumble Ball out and consumes it. He starts fighting with Chessmarimo who got out two bows with an incendiary arrow on each one. He shoots the arrows but Chopper is able to dodge them both. Chessmarimo now gets out four wooden hammers and Chopper explains the drug and how he can use seven forms. He is able to break two hammers with his hooves and he claims that they are strong enough to break through rock. Chessmarimo now gets out four axes and starts attacking the reindeer, which he dodges. Chopper spots the weak point of Chessmarimo with his enhanced brain point and punches him there after dodging an attack. Luffy has been watching Chopper's fight in amazement but everyone loses track of Wapol, who sneaks off and enters Drum Castle.\nMeanwhile, the Isshi-20 are able to revive Dalton after regaining the trust of the citizens. Dalton tries to leave the town but he is very weakened. Usopp volunteers to carry him but he can barely stand the weight. Zoro helps him out and they head towards the mountain.\n",
  "characters": [
    "Hiriluk (flashback)",
    "Tony Tony Chopper",
    "Monkey D. Luffy",
    "Wapol",
    "Sanji",
    "Kureha",
    "Chessmarimo",
    "Dalton",
    "Nefertari Vivi",
    "Usopp",
    "Isshi-20",
    "Roronoa Zoro",
    "Pandaman (image)",
    "Nami"
  ],
  "ssum_frequencies": [
    [
      "the",
      2
    ],
    [
      "chopper",
      1
    ],
    [
      "demonstrates",
      1
    ],
    [
      "powerful",
      1
    ],
    [
      "abilities",
      1
    ],
    [
      "of",
      1
    ],
    [
      "his",
      1
    ],
    [
      "rumble",
      1
    ],
    [
      "balls",
      1
    ],
    [
      "when",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "and",
      11
    ],
    [
      "he",
      11
    ],
    [
      "the",
      10
    ],
    [
      "to",
      7
    ],
    [
      "chessmarimo",
      6
    ],
    [
      "of",
      5
    ],
    [
      "chopper",
      5
    ],
    [
      "out",
      5
    ],
    [
      "a",
      4
    ],
    [
      "able",
      4
    ],
    [
      "with",
      4
    ],
    [
      "but",
      4
    ],
    [
      "is",
      3
    ],
    [
      "him",
      3
    ],
    [
      "luffy",
      2
    ],
    [
      "on",
      2
    ],
    [
      "himself",
      2
    ],
    [
      "towards",
      2
    ],
    [
      "wapol",
      2
    ],
    [
      "be",
      2
    ]
  ]
}