{
  "chapter_number": "Episode 205",
  "title": "Catch Them All in One Net! Jonathan's Secret Scheme!",
  "short_summary": "Sanji, Zoro, Usopp, and Robin continue to search for their treasure. Luffy leads Nami to the captain’s quarters where they retrieve their gold.\n",
  "long_summary": "Nami and Sanji finally find the Waver in a patch of grass. Meanwhile, Shepherd finds Luffy, Robin, Usopp and Zoro at the vault. He shows that he has an extremely large bazooka. However, he is easily defeated by Robin, who uses her Devil Fruit power to point the bazooka at the ground and fire it, launching it into the air. The Straw Hats escape the vault.\nMeanwhile, Nami drops off Sanji at the ship before pursuing the Straw Hats herself. She overhears Marines discussing how the Straw Hats have fled towards the mountains.\nThe Straw Hats ask Kobato and Mekao where the gold is stored. Mekao points them to a cliff face and says that the treasure was likely at the top. However, Mekao also warns that Jonathan would very likely use the gold to bait the Straw Hats into a trap. \nAt the top of the cliff, Nami joins the others by riding the Waver up the cliff. They deduce that the only way for Jonathan to be able to trap them is if he placed the gold near his office. So, Luffy and Nami head towards Jonathan's office, while the others go to the edge of the water for Sanji to pick them up.\nLuffy and Nami manage to find the window of Jonathan's office and break in. Jonathan, who was waiting in there the whole time, is surprised. The gold is in his office. Luffy takes the gold, but reinforcements arrive, and he is captured in the seastone net. However, because the Marines were using guns, Nami defeats all the Marines by using the Clima-Tact to create lightning. They take the gold and escape. \nNami and Luffy are picked up by the Going Merry, which has been disguised as a Marine ship. Meanwhile, Shepherd mocks Jonathan for letting the Straw Hats escape. He then orders the Marines to intercept the Straw Hats at the gate. The Marines then notice that one of the Marine ships was really the Going Merry. The Straw Hats \"thank\" the Marines for showing them where the gate was. Meanwhile, Jonathan tells Shepherd that the Straw Hat pirates fell into his \"ultimate trap.\"\n"
}