{
  "chapter_number": "Episode 105",
  "title": "The Arabasta War Front! City of Dreams, Rainbase",
  "short_summary": "The Straw Hat Pirates travel to the city of Rainbase to take down Crocodile and Baroque Works, but they run into Smoker and Tashigi, who chase after them.\n",
  "long_summary": "Vivi, still in tears, declares that their plans of stopping the rebellion have changed to finding Crocodile. Nami states that this seems to be the quickest way of stopping the fighting from happening. Vivi takes out a map of Arabasta and shows them Alubarna's location, the capital of Arabasta where her father is, and Katorea, where the rebel army is camped. Sanji supposes that they have to get to Crocodile before the rebels invade Alubarna. She also shows them where Crocodile lives which is Rainbase and tells them it is a day's journey from where they are.\nOn their way to Rainbase, Usopp asks for a sip of Luffy's water given to him by Toto, but Luffy refuses to give Usopp any since the old man had to dig all night to fill the container, and that they can't just drink it like it is regular water. \nMeanwhile, in the rebel base in Katorea, a boy is begging the leader of the rebel army, Koza, to join the fight. Koza dissuades the boy, but he remains determined stating he wants to fight. Koza then says that that is the reason he can't let the boy join them because none of the rebels want to fight and that the only reason they do is because they have to. Koza tells the boy to leave and then starts to discuss their plans to invade Alubarna with his men. Once they have gathered all the weapons they need from all the rebel towns, they will then begin their all-out attack on the capital.\nIn Alubarna, Chaka suggests to Cobra that they must take action towards the rebel army before they attack the capital. Cobra angrily refuses to attack the rebels that in doing so would be the true destruction of their kingdom. He recalls the dance powder incident and surmises that since that incident, someone has been trying to tear apart their country and that before they should act, they must determine who is really behind all of it. Chaka argues that whoever is behind it has not made himself known and that they cannot sit back and wait for whoever it is to divide them, to which the king remained adamant in his refusal to act.\nWhile Chaka and Pell discuss Vivi and Igaram's efforts to determine the mastermind of the turmoil within their kingdom, a palace guard informs them that Karoo has returned. They rush to see Karoo and find Cobra reading the letter Vivi wrote informing him that Crocodile is without a doubt the person who is trying to destroy Arabasta Kingdom. She tells them that Igaram died protecting her. Furthermore, she says that she has teamed up with an amazing group of people who will help her save Arabasta.\nHaving learned of the identity of the mastermind behind their country's troubles, Cobra orders his forces to march onto Rainbase. Chaka and Pell discourage this plan saying that they will have to plan the attack and that Crocodile has the hearts of some of the citizens, even more than the King. Moreover, they are worried that the absence of the Royal Army from the capital will make it vulnerable to the rebel army's occupation. Cobra replies that he doesn't care if the rebels destroy the palace since it is only a building. It doesn't matter that the Royal Army falls in the end, as long as Crocodile is defeated, the country can still be reborn, but if they battle the rebel army, Crocodile will win. They start preparations to take down Crocodile, with Chaka readying the war council and Pell scouting ahead to conduct reconnaissance. \nMeanwhile, in Rainbase, Luffy's group have finally arrived. They plan to lay low since they are under the assumption that Crocodile already knows they are on the island. However, Luffy and Usopp loudly enter a bar where Smoker and Tashigi are staying, and inadvertently sit right beside them. At first, they go unnoticed, but eventually, the two parties see each other, so Luffy and Usopp run away and are chased by the Marines. They lead the Marines to the other crew members (minus Chopper), so their plan of laying low is no longer feasible. The group decides to split up and just meet at Rain Dinners, the casino where Crocodile is. \nChopper, after going to the restroom, returns to where everyone was but sees that they are gone. He determines that everyone split up when he finds everyone's scent coming from different directions. Luffy is chased by Smoker but he manages to lose him temporarily. Vivi and Zoro are chased down by Marines but Zoro lets Vivi go ahead without him. However, he is faced by Tashigi so he runs aways, unable to handle a confrontation with her since she looks so much like his childhood friend. Usopp, Nami, and Sanji are also pursued by marines but Sanji asks Usopp to protect Nami so he can deal with the Marines. Nami and Usopp arrive at Rain Dinners and find Zoro there. Luffy arrives shortly after, again being chased by Smoker. The four of them decide to enter the casino without the others in order to escape Smoker.\nInside, Crocodile and Miss All Sunday find out of the Straw Hat's arrival and plan to give them a \"warm welcome.\"\n",
  "characters": [
    "Nefertari Vivi",
    "Usopp",
    "Tony Tony Chopper",
    "Sanji",
    "Roronoa Zoro",
    "Nami",
    "Monkey D. Luffy",
    "Matsuge",
    "Toto (fantasy)",
    "Kappa",
    "Koza",
    "Farafra",
    "Erik",
    "Kebi",
    "Okame",
    "Chaka",
    "Pell",
    "Nefertari Cobra",
    "Karoo",
    "Crocodile",
    "Smoker",
    "Tashigi",
    "Pandaman",
    "Miss All-Sunday"
  ],
  "ssum_frequencies": [
    [
      "the",
      2
    ],
    [
      "to",
      2
    ],
    [
      "and",
      2
    ],
    [
      "straw",
      1
    ],
    [
      "hat",
      1
    ],
    [
      "pirates",
      1
    ],
    [
      "travel",
      1
    ],
    [
      "city",
      1
    ],
    [
      "of",
      1
    ],
    [
      "rainbase",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      62
    ],
    [
      "to",
      41
    ],
    [
      "and",
      28
    ],
    [
      "that",
      26
    ],
    [
      "they",
      24
    ],
    [
      "of",
      19
    ],
    [
      "is",
      19
    ],
    [
      "crocodile",
      11
    ],
    [
      "he",
      11
    ],
    [
      "a",
      10
    ],
    [
      "them",
      10
    ],
    [
      "in",
      9
    ],
    [
      "their",
      9
    ],
    [
      "it",
      9
    ],
    [
      "are",
      9
    ],
    [
      "but",
      8
    ],
    [
      "where",
      7
    ],
    [
      "rebel",
      7
    ],
    [
      "usopp",
      7
    ],
    [
      "by",
      7
    ]
  ]
}