{
  "chapter_number": "Episode 274",
  "title": "Answer Us, Robin! The Outcries of the Straw Hat Crew!!",
  "short_summary": "Franky helped Robin escape from their chains and they made it outside to see Luffy. Luffy wants to come over to rescue Robin but she tells him to stay, that she only wanted to die. Below, as Yokozuna fell, the giants came to cover. All the Straw Hats arrived on the roof, and asked Robin to return.\n",
  "long_summary": "Spandam gets an update from the Marines. They've managed to locate Luffy atop the Courthouse. This confuses Spandam since he knows Blueno was up there, too. He looks out his window again and sees Luffy recuperating by eating the meat he'd kept in his pockets. Then he sees Blueno motionless nearby. Spandam can only make one sickening conclusion from this. Luffy had defeated Blueno, a member of CP9, one of the most merciless organizations in the World Government. Such a feat should be unthinkable, but Luffy's defiant call for Nico Robin leaves no doubt who won that fight. He immediately calls for Rob Lucci and the rest of CP9. He also orders Baskerville to guard the drawbridge to the Tower of Justice at all costs.\nFranky doesn't understand why Robin refuses to be saved even after Spandam broke his promise. Franky begins to suspect Robin is running away from something else. While Luffy yelled in the background, Franky decided to make Robin face him. Spandam returns, ordering the Robin and Franky be taken to the Gates of Justice immediately. But he's shocked to discover Frankly has used the rest of his cola power to inflate his rear in what he claims to be a self-destruct mode. Everyone runs for cover, and Franky uses the commotion to release the pressure in his Coup de Boo: a giant flatus that blasts himself and Robin outside, onto the balcony, and into Luffy's sight, breaking his chains in the process. Thankfully, the guard fence keeps them from flying into the abyss outside the tower. Luffy wanted to slingshot himself over the waterfall to rescue Robin, but she told him to stay and that she only wanted to die. The rest of CP9 then joins Spandam to retake Robin and Franky.\nIn front of the courthouse, Yokozuna keeps a brave stand but now faces the jurors. Jurors are also blocking the way for Mozu's and Kiwi's teams and the rest of the Straw Hats. Zambai is surprised there's an actual courthouse instead of just an empty hall. Baskerville reveals the truth is somewhere in between. He does hold a trial, but the Jurors are all pirates condemned to death; therefore, their only pleasure left is to take as many other pirates with them, so the only thing they say is, \"Guilty!\". The fighting is getting rough; even Yokozuna goes down from a continual assault from the Jurors' giant iron balls. Meanwhile, the Marines regroup behind bulletproof shields and are about to charge into the courthouse. But they are then stopped by Oimo and Kashii, who still have a beef with the Marines who made them waste 50 years by lying to them. Zoro, lost as usual, decides to take a shortcut by blasting the ceiling with Tatsu Maki. This takes out the Juror blocking Nami and Chopper but catches them, too. As Luffy and CP9 stare at each other across the abyss, Luffy declares that they will rescue Robin anyway. Only after she's safe can she decide her own fate. The rest of the Straw Hats eventually join Luffy on the roof (Nami and Chopper blown through the ceiling, Zoro climbing up after them, Sanji kicking his own hole, and finally Sogeking being thrown up by Kashii). Once again, Luffy declares that if Robin wants to leave or die, she can only do so once she's back by their side.\nThe Straw Hats gather together, each standing atop one of the battlements of the courthouse. Across the falls is the Tower of Justice: their goal and their enemy staring back at them. Tears stream in Robin's eyes as Luffy declares, \"Leave the rest to us!\"\n"
}