{
  "chapter_number": "Episode 288",
  "title": "Fukurou's Miscalculation! My Cola is the Water of Life",
  "short_summary": "Nami becomes Kalifa's opponent, Kumadori goes after Chopper, and Luffy unleashes a new power! Meanwhile, Franky spars with Fukurou in an attempt to get to the kitchen to power up with Cola.\n",
  "long_summary": "Nami begins to run up the stairs to face Kalifa, when Kumadori stomps in wanting to continue his fight with her. Chopper tells Nami to continue while he faces him. He then transforms into Arm point and attacks Kumadori, telling him that he will be his opponent.\nMeanwhile, Chimney and Gonbe save Luffy from drowning, and pump out all the water he took in. Once revived, Luffy goes back to his pursuit of Robin. Not thinking things through, he begins to stretch his arms and grab a hold of a nearby cannon, preparing to launch off of it in hopes that he will fly across the whirlpools. But when Chimney tells him she found another way there, he accidentally falls back into the water again. After being rescued, again, Chimney and Gonbe show him the secret passage they found. She tells him that they were following \"that guy with Lucci\" (Spandam), Lucci, and \"black-haired neechan\" (Robin) to that place. After running down the stairs, they came to a pair of giant steel doors. After seeing that a key is needed to open the doors, Luffy told Chimney and Gonbe to stand back. Luffy uses Gear 3 and breaks down the door with tremendous strength. This is the first time Luffy uses the Gear 3 technique, although only his shadow is seen. After the dust cleared, Chimney and Gonbe looked in awe at the huge hole that the door once stood then were surprised that Luffy had been reduced to a Chibi-like form!\nMeanwhile, Spandam had heard a huge crash, and is worried. Lucci calmly says that it must have been the pirates breaking through the doorway. Spandam says that was impossible not only because it was a solid steel door, but also because they did not know how to get to door room. Lucci tells him that a girl and her bunny were following them, and Spandam demands to know why he did not stop or attack them. Lucci simply says he did not receive an order to do so. Furious, Spandam tells him that his first priority above all else is to protect his life and to eliminate anyone who gets in his way. Spandam then orders Lucci to take Robin and hurry to the Gates of Justice before the pirates catch up with him. At that same time, Luffy, running down the pathway, returns back to his normal size and speeds ever closer to Robin.\nMeanwhile, Nami had just reached the place in the structure where Kalifa was last seen. Before entering the room, she wonders how Sanji ended up like he did now. Then she heard water running from behind the door. She opens it to find Kalifa undressing, seen as a shadow behind a veil, preparing to take a bath.\nThe scene switches to Franky, who was facing Fukurou. Fukurou was using Soru so that Franky would not be able to catch up with him. Franky finally catches him and throws Fukurou against a wall and uses his Beans Left technique on him. That, however, drains the little remains of his Cola, so he hurried to the kitchen. However, Fukurou suddenly appears before him, unharmed. Franky calls him a coward for running away like this, which annoyed Fukurou enough to have him use his special punch, Jugon, which he claims is faster and stronger than a normal Shigan move. Franky, although knocked back by the attack, stands firm and removes the skin from his right hand, preparing to use his Strong Hammer attack. Fukurou performs Tekkai, and since Franky was low on cola, the attack did little damage. Fukurou punches him again, and Franky tells Fukurou his punches are flimsy. Fukurou disagrees with him, saying Franky's punch was flimsy. Franky said if that was true, then his punch was a paper-punch. Fukurou then said he was just pants.\nThen Franky and Fukurou began beating each other up with punches and throwing clothing-related insults at each other. Their fight crashed through the wall into the kitchen. Franky then notices a huge refrigerator in the room. Just then, Chopper and Kumadori crash into the room. Chopper, now in his Heavy Point form, runs out of time on his Rumble Ball use. Kumadori was about to attack, but then Chopper opened up the refrigerator and locked Kumadori inside. Franky yells at him, saying he has business with that refrigerator, but Chopper, like Luffy, still has not Franky for beating up Usopp. Franky tells him that if he wants to save Robin, then he will have to help him out by tossing him Cola out of the refrigerator, which will power him up.\nFukurou, now getting angrier by the minute, uses his Jugon Ougi (Jugon Secret Attack) to make duplicates of himself and repeatedly punch Franky. Franky tries to fight back but he's simply too weak. Chopper, accepting that Franky is not an enemy, begins looking for cola in the refrigerator. Chopper opens the fridge quickly enough so that Kumadori does not come out and tosses Franky three bottles of liquid, presumably believing them to be cola. Franky places them in his own mini-fridge and adopts the Fresh Franky persona, with onion-shaped hair. He uses his special Veggie-punch on Fukurou, but it does no damage. After being hit with another Jugon attack, Franky throws the bottles back at Chopper, telling him that it was Vegetable juice and he needs to look in the refrigerator for cola.\nChopper opens the fridge again and tosses Franky three more bottles. This time, Franky's hair turns wavy and he sits back and talks calmly, adopting a farmer persona. He says working on the fields have been hard work and that they should stop the fighting and simply have some tea. Franky then snaps out of it and again throws the bottles of tea at Chopper, who was thoroughly entertained by Franky's persona. Franky says he has no other personalities and says he will only take Cola. Chopper then tosses him 3 more bottles, which are definitely Cola. Franky jumps to get them, but Fukurou, trying to prevent him from using the cola to power up, uses his Rankyaku technique on him. Franky is knocked to the ground, but after the smoke clears it is seen that Franky had placed the bottles of cola inside him and has powered up!\nFranky then walks slowly toward Fukurou, with his fists up, telling him to get ready. Fukurou laughs it off, assuming the next punch will be just as weak. Franky uses his Strong Hammer move, which knocks Fukurou through three walls and outside, against the outermost rail of Enies Lobby. Fukurou is unable to move and appears to be knocked out. Franky then says that Fukurou was right, the punches he had been delivering were weak.\n"
}