{
  "chapter_number": "Episode 13",
  "title": "The Terrifying Duo! Nyaban Brothers vs. Zoro",
  "short_summary": "Kaya discovers Klahadore's true nature after finding Merry wounded. Meanwhile, Jango hypnotizes his men to increase their strength, and after this plan fails he summons the Nyaban Brothers to battle Zoro.\n",
  "long_summary": "The children attempt to enter Kaya's mansion to check on her, but Usopp's secret entrance had been sealed and they cannot climb the gates. Inside the mansion, Kaya exits her bedroom to find a wounded Merry on the floor. Merry reveals that Usopp had been telling the truth and Klahadore was indeed a pirate attempting to assassinate Kaya for her family fortune.\nAs the invading Black Cat Pirates find themselves unable to fight off Luffy and Zoro, Jango hypnotizes them to increase their strength. The newly hypnotized combatants become far stronger, shattering cliffs with a single punch. However, Jango accidentally hypnotizes Luffy in the process, who, with his strength enhanced, defeats the Black Cat Pirates, then tears off the bow of the Black Cat Pirates ship. Jango hypnotizes Luffy asleep and Luffy collapses, but the bow also falls and crushes the enemy pirates.\nAs a last-ditch effort to penetrate the crew's defenses, Jango summons the Nyaban Brothers, Sham and Buchi, who had been watching over the ship. Although the Nyaban Brothers initially appear weak and cowardly, they use this as an act to catch Zoro off guard. Sham takes two of Zoro's katanas, leaving him to defend himself with a single sword. Usopp attempts to shoot them with a slingshot but misses, hitting Zoro instead and allowing the Nyaban Brothers to slash his chest. Nami attempts to retrieve Zoro's katanas but is stopped by Jango, who slices her in the shoulder with his chakram.\nTo the horror of the Black Cat Pirates, Kuro arrives at the coast, frustrated with the setbacks to the operation.\n",
  "characters": [
    "Kuro",
    "Merry",
    "Usopp",
    "Monkey D. Luffy",
    "Nami",
    "Roronoa Zoro",
    "Jango",
    "Tamanegi",
    "Ninjin",
    "Piiman",
    "Kaya",
    "Sham",
    "Buchi"
  ],
  "ssum_frequencies": [
    [
      "after",
      2
    ],
    [
      "to",
      2
    ],
    [
      "kaya",
      1
    ],
    [
      "discovers",
      1
    ],
    [
      "klahadores",
      1
    ],
    [
      "true",
      1
    ],
    [
      "nature",
      1
    ],
    [
      "finding",
      1
    ],
    [
      "merry",
      1
    ],
    [
      "wounded",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      24
    ],
    [
      "to",
      14
    ],
    [
      "and",
      8
    ],
    [
      "a",
      6
    ],
    [
      "with",
      6
    ],
    [
      "pirates",
      5
    ],
    [
      "jango",
      5
    ],
    [
      "her",
      4
    ],
    [
      "but",
      4
    ],
    [
      "black",
      4
    ],
    [
      "cat",
      4
    ],
    [
      "luffy",
      4
    ],
    [
      "had",
      3
    ],
    [
      "been",
      3
    ],
    [
      "as",
      3
    ],
    [
      "off",
      3
    ],
    [
      "zoro",
      3
    ],
    [
      "hypnotizes",
      3
    ],
    [
      "who",
      3
    ],
    [
      "his",
      3
    ]
  ]
}