{
  "chapter_number": "Episode 138",
  "title": "Where the Island's Treasure Lies! Zenny Pirates Full Charge!",
  "short_summary": "Zenny decides to follow his dream and become a pirate, despite his age. He helps the Straw Hat Pirates out of trouble with the Marines, and then they part ways.\n",
  "long_summary": "Zenny spots a fleet of Marine ships and realizes that a trap has been set up against the Straw Hats. Zenny decides to “sail down” the mountain using his ship to help them. Zenny sees that he is now at sea and he declares that he has officially become a pirate.\nWhile the Marines are distracted, the Straw Hats head towards the Going Merry. A Marine sees this and asks Minchey to inform their captain that the pirates are up to something. Minchey shoots at him and reminds him they cannot tell their captain what’s going on if they wanted to steal the old man’s treasure.\nZenny realizes that the chief petty officer has been paying off his men so they can go on his side projects and mocks him. He challenges him that if he wanted his treasure, he would have to take it himself. Zenny then sends his goats to attack the Marine ship and chaos ensues.\nThe chaos proves to be too much for Zenny and he experiences chest pains. Minchey kicks him and grills him about the treasure’s location. Zenny confesses that he is broke and that he has no treasure. Minchey doesn’t believe him and decides to just search the whole island instead of waiting for the old man to tell him the treasure’s location.\nBefore Minchey can kill Zenny, Robin throws an abacus at Minchey and the goats trample him. The Going Merry reaches Zenny and Chopper rushes to give him medical attention. With Minchey captured and everybody safe, Nami asks Zenny about his treasure. Zenny reveals that he exchanged all his treasure for cash. He was attacked by pirates and ended up marooned on the island. When he came to, the goats had eaten all his cash and left him with nothing which is why he considers the goats his treasure.\nThey then send Minchey flying back to the Marine fleet. Moore strips him of his rank and calls him a disgrace. He then calls Luffy and tells him that he has no interest in capturing Zenny. And that while he wants to capture the Straw Hats, he also wants to pay a debt of honor for delivering up a disgraced member of his fleet. He allows them to choose where they will fight. Luffy accepts and heads out to meet the Marine fleet. He then unintentionally leads the fleet to a foggy reef area which causes the Marine ships to sink.\nZenny goes back to the island to repair his ship and decides to sail off to sea after the repairs. The Straw Hats have set up Zenny’s supplies and medicine so he will be able to head out when he is ready. Zenny decides that his age will not stop him from becoming a pirate and that he will go on adventures so long as he is able to.\nAs the crew worry about him, Luffy assures them that the old timer will be fine and Zoro agrees as he thinks while Zenny did have a weak heart, he had plenty of guts to make up for it.\n"
}