{
  "chapter_number": "Episode 146",
  "title": "Stop Dreaming! The City of Ridicule, Mock Town!",
  "short_summary": "Jaya's main town is full of infamous pirates that are constantly brawling with each other. Luffy and Zoro have a run-in with a pirate known as 'Bellamy the Hyena', who ridicules their dreams and beats them up. Luffy and Zoro do not fight back, because they had no reason to fight as Bellamy was not in their way.\n",
  "long_summary": "In a bar, Roshio and Bellamy are gambling and Roshio wins. However, Bellamy refuses to accept defeat and insists that Roshio cheated by having Sarquiss bear false witness. Roshio tries to fight Bellamy but he is defeated easily. The Straw Hats were still at sea and trying to locate Jaya when Chopper commented about the Seagulls flying above; then suddenly the Seagulls fall and Chopper states they were shot. Usopp comments that only an extraordinary marksman would be able to have shot them and it is more likely that the shots were random. Van Augur, siting on a roof somewhere in Jaya, is revealed to have shot the birds and comments on their fate.\nMeanwhile at Mock Town, Jesus Burgess is seen challenging a man to a fight and he defeats his opponent. One of the onlookers comments to him that the man he defeated is one of Roshio's men, judging by the mark on his head band. Meanwhile at the bar, two men are discussing how Roshio was defeated, with the false excuse that he cheated, and one of them recognizes the man who had defeated Roshio to be Bellamy.\nThe Straw Hats finally arrive at Mock Town. Luffy and Zoro left the ship and Nami accompanied them after considering that they would cause trouble which will get them kicked out of the town. Such a turn of events would disrupt their information gathering for the Sky Island. To avoid that, she made them promise that they would not start a fight with anyone. While on their way, Doc Q fell in their path and asked for assistance in getting up. Luffy and Zoro got him on his horse, Stronger. He thanked them saying he was born with a weak body and brought out a basket of apples and asked them to choose one. Zoro indicated that it was suspicious. However, Luffy went ahead and helped himself to one apple. Shortly after Luffy took a bite of the apple, an explosion erupted nearby because some people had eaten apples with explosives. Doc Q then stated that Luffy is a lucky man for choosing the apple that is a dud. On the ship, Chopper, Usopp and Sanji notice that Robin also left, without them realizing it.\nStill trying to inquire information, Luffy, Zoro, and Nami went past Jesus Burgess who is growling, standing on the roof of a building. The people comment that he's got many victims without a bounty on his head and it is best to stay away from the wrestling champion. On hearing this, Luffy and Zoro become competitive but Nami squashed the competitive fuel in them to avoid a fight. They reach Tropical Hotel with the intention of gathering information. However, Spector, the hotel manager, refuses them because the Bellamy Party has rented the entire place and no other customers are allowed. This reveals Spector's fear of Bellamy.\nSarquiss returns at the hotel and upon seeing Luffy, Zoro, and Nami, he comments that they are shabby-looking kids. Luffy asks if he should kick Sarquiss's butt but Nami and Spector yell \"no\". Sarquiss throws some money at them saying they should use that to buy themselves some clothes. Luffy gets excited and he is ready to take the money when Nami drags him away. They reach a restaurant and Nami is complaining about the town when the bartender tells her that since many rich pirates come to Mock Town to unload their wealth, brawls and murder occur frequently. While conversing with Nami, Luffy, and Blackbeard comment on the cherry pie and the drink. They have opposite opinions on the food and they are close to starting a fight because of this. Blackbeard asks if Luffy is a pirate and Luffy replies that he is. He then asks for Luffy's bounty and when he learns that it is 30,000,000, he disbelieves it. He left the bar somewhat disappointed.\nBellamy and his crew come into the store and Bellamy inquires if this is Straw Hat Luffy with the 30,000,000 bounty. He buys Luffy a drink which Luffy accepts saying Bellamy is a good guy. While Luffy is having his drink, Bellamy smashes Luffy's head into the bar table. Immediately, Zoro and Luffy get ready to fight. Nami tells them to stop and asks the bartender if he has any information regarding the Sky Island. People in the bar are dumbfounded and break into laughter. To her defense, Nami says that the log pose points upwards but the people continue to laugh saying the log pose is broken. Bellamy says that they should not believe the cock-and-bull story about an island in the Sky and that only ignorant sailors ride the knock-up stream only to fall back down. He says all dreams could be explained and the age where pirates dreamed is over. He also mocks the people who die while chasing their dreams and he says that they give him an upset stomach. Luffy who had his fist clenched, releases it when he hears Bellamy's statement and even goes as far as allowing Bellamy to punch him. Nami tells Luffy and Zoro to forget about the promise and fight Bellamy and his crew. Luffy then tells Zoro that they are not going to fight them.\n"
}