{
  "chapter_number": "Episode 192",
  "title": "The Miracle in God's Country! A Love Song Heard by Angels",
  "short_summary": "Luffy finally defeats Enel, ringing the Golden Bell in the process.\n",
  "long_summary": "The villagers leave in ships shocked at the destruction of the Upper Yard. Nami continues to drive up the falling beanstalk. Everyone is concerned for Wyper and Zoro.\nEnel then laughs at everyone running and sends a lightning bolt towards their location which also causes Nami to swerve on the beanstalk. Conis and the villagers look on in terror but realize after the smoke clears that Upper Yard is still standing. Gan Fall realizes that the Vearth is just that powerful and questions why they were so blind for 400 years. Usopp tries to get everyone out of the way as the beanstalk appears to fall on them. Luffy gets closer, but Enel is unimpressed and uses Raigo. Luffy gets closer and the waver cuts off, but Luffy continues to jump towards Enel. The beanstalk finally falls all the way to the ground and Luffy uses the ball of gold with his Gomu Gomu Hanabi saying that Enel ruined the weather once they got there.\nEnel realizes the gold ball on Luffy's arm is a natural conductor and tries to drop the thunder ball before Luffy can discharge it. The White Berets ask their leader to stop as it is pointless, but he says they can't go back or forward and starts to pray. The rest of the villagers are also in a praying stance, with Luffy in the sky continuing his fireworks displays causing \"cracks\" to appear on the thundercloud. Nami and Enel are shocked as Luffy has succeeded in clearing the sky causing the sun the shine through with the villagers looking on in shock.\nLuffy's arm is twisted as Enel uses a 200 million volt amaru turning into a giant electric monster and says he is a God. Enel then sends out a blast saying Luffy's still just a Paramecia type and he can't stop a Logia. Luffy walks on the giant's arm and kicks him in the face. Luffy dodges a trident, but it burns him instead and the golden ball pulls him closer. Luffy gets himself free and uses the golden ball and the twisted arm from earlier to hit Enel, sending him into the golden bell.  \n"
}