{
  "chapter_number": "Episode 287",
  "title": "Even if I Die, I Won't Kick you! Sanji's Manly Chivalry",
  "short_summary": "Nami barely escapes from Kumadori, stealing his key in the process. Kaku utilizes his new body to cut the Tower of Justice in half, which also results in Zoro and Sogeking being cuffed together by Seastone Cuffs. Jabra insults Kaku about the giraffe stuff as he repeats that, \"giraffes are AWESOME!\" Sanji attempts to get the key from Kalifa however fails as he keeps his promise that he will never kick a woman.\n",
  "long_summary": "After Kaku utilizes his new body to cut the Tower of Justice in half, Sogeking and Zoro realize that they have been handcuffed together, now having to face both Kaku and Jabra together, with a huge disadvantage. Jabra says that Kaku should be ashamed and a professional doesn't let his emotions get the better of him, as Kaku gets offended and Kaku tells Jabra that giraffes are awesome, and he loves them, and Jabra says \"Fine. Whatever you say, man.\" As Chopper finds the two of them running away from the wolf and giraffe, he is told to look for the number 2 key, the key to unlock their cuffs.\nNami escapes Kumadori within an inch of her life losing her jacket, stealing his key in the process, through Chopper's intervention, as Chopper finds the two fighting, on his search for the number 2 key.\nSanji attempts to get the key Kalifa has away from her, but cannot bear the thought of hurting a woman. Attacks are exchanged, but each time Sanji merely pulls back at the last second, so as not to hurt Kalifa. Finally, Kalifa bores of this, and uses her newly acquired powers on Sanji, rendering him helpless. As Nami and Chopper talk about how to get Zoro and Sogeking free, a deformed Sanji is thrown through the ceiling into their room.\nAs Nami berates him for losing, Sanji tearfully explains that even if he were to die in the process, he would never raise his foot to a woman. Pitying Sanji for having this weakness exploited, Nami vows to defeat Kalifa.\n"
}