{
  "chapter_number": "Episode 194",
  "title": "I Have Come Here! The Weaving of the Poneglyphs",
  "short_summary": "Robin deciphers the Poneglyphs on the Golden Bell and realizes how to find the Rio Poneglyph. She also discovers that Gol D. Roger left a message written in the same language as the Poneglyph. Gan Fall informs her that Roger could hear the voice of all things but not actually read the letters, and he had once visited Skypiea. The grateful Shandia offer a broken golden pillar from the Belfry as an attempt to repay them. Soon afterwards, the Straw Hat Pirates find a sizable amount of gold in Nola's stomach and begin to leave Skypiea, after mistaking the cloth covered pillar for a giant cannon.\n",
  "long_summary": "We see the aftermath of the party——people resting being exhausted after partying for four days. Luffy is running around trying not to wake people looking for his Crew. He finds Nami, wakes her up and asks her to wake the others so they can steal the gold and run. They get into a silly argument which ends up waking most of the sleeping Sky People. Afterwards, Luffy proceeds to tell them his plan.\nIn the morning, a Shandorian reports to the Shandorian Chief that they have found the Golden Bell and that it is hanging on to Giant Jack, but it might not hold. He asks for help from every able-bodied warrior to go to the western shore to pull the bell up from the sky ocean. The Shandorians try to pull up the bell but are initially unsuccessful. Skypieans then arrive to help and manage to pull up the bell. \nMeanwhile Usopp is initiating trade with the Sky People, offering them rubber bands and metal sheets in exchange for dials. His trade went well, and he is excited to use the dials he obtained to enhance Nami's Clima-Tact and his weapon. Zoro is training by cutting stone while waiting for the others. Luffy, Sanji, Chopper and Nami are inside Nola, retrieving the treasure inside its belly. Robin is wandering outside, investigating the Shandia ruins. \nAfter the Golden Bell is recovered, the Sky People prop it up and discover that one of its columns has broken off. They see the Poneglyph at its base and wonder what the ancient writings say. The Shandorian Chief says that being an ancient text, it is impossible for them to read it. Robin appears and proceeds to read the writings out loud for the Sky People to hear. She tells them that the Poneglyph mentions Poseidon, an ancient weapon named after a god and that it gives its whereabouts. She is disappointed as this was not what she wanted to find. \nAs she is walking away, a Shandorian points out ancient writing engraved on the side of the bell which she missed. She reads the writing as \"Gol D. Roger\" which shocks her. It continues to say \"I made it here and I will guide this passage all the way to the farthest ends of the earth. The stormiest seas will not stop me. - Pirate Gol D. Roger.\" She surmises that the Pirate King came to the Sky Island but is confused as to the meaning of those words. She wonders how he was able to understand and use the ancient language. Gan Fall tells Robin that he met Roger when he came to Sky Island over twenty years ago. \nRobin tells the Shandorian Chief that the duty of the Poneglyph that the Shandorians have been protecting for centuries has been fulfilled since Roger has already taken the text of the Poneglyph here to the island where the \"real Poneglyph\" may be located. The Shandorian Chief is moved to tears since this means their duty has also already been fulfilled, that they don't have to fight any longer and that the war is finally over. Robin states that she too must carry on fulfilling her duty to take the text on Poneglyphs she has read all the way to Laugh Tale. \nGan Fall tells Robin that Luffy reminds him of Roger and that he finds him very interesting. Robin agrees and says that she finds him interesting as well. The Shandorian Chief, grateful for the Straw Hats help, wants to give them gold by offering the Belfry's broken column. The Sky People wrap up the column to carry to the Straw Hats. \nMeanwhile, the Straw Hats are growing impatient waiting for Robin. As she approaches the crew, they see the wrapped up broken golden column and mistake it for a huge cannon and make a run for it. The Sky People give chase trying to give them their gift. \n",
  "characters": [
    "Nola",
    "Monkey D. Luffy",
    "Nami",
    "Usopp",
    "Tony Tony Chopper",
    "Sanji",
    "Nico Robin",
    "Roronoa Zoro",
    "Shandia Chief",
    "Braham",
    "Genbo",
    "Kamakiri",
    "Gan Fall",
    "Crocodile (flashback)",
    "Gol D. Roger (image)",
    "Pierre"
  ],
  "ssum_frequencies": [
    [
      "the",
      11
    ],
    [
      "a",
      4
    ],
    [
      "and",
      3
    ],
    [
      "to",
      3
    ],
    [
      "golden",
      2
    ],
    [
      "find",
      2
    ],
    [
      "poneglyph",
      2
    ],
    [
      "that",
      2
    ],
    [
      "roger",
      2
    ],
    [
      "in",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      60
    ],
    [
      "to",
      32
    ],
    [
      "and",
      19
    ],
    [
      "that",
      16
    ],
    [
      "is",
      13
    ],
    [
      "for",
      12
    ],
    [
      "she",
      12
    ],
    [
      "it",
      10
    ],
    [
      "of",
      9
    ],
    [
      "sky",
      9
    ],
    [
      "he",
      8
    ],
    [
      "up",
      8
    ],
    [
      "robin",
      8
    ],
    [
      "people",
      7
    ],
    [
      "shandorian",
      7
    ],
    [
      "they",
      6
    ],
    [
      "a",
      6
    ],
    [
      "them",
      6
    ],
    [
      "bell",
      6
    ],
    [
      "as",
      6
    ]
  ]
}