{
  "chapter_number": "Episode 81",
  "title": "Are you Happy? The Doctor who is Called a Witch!",
  "short_summary": "While Sanji and Luffy struggle to survive in the wilderness, the islander's worst nightmare turns true as Wapol returns to the island. The doctor is discovered to be on the other side of the island, and Usopp, Vivi, and Dalton rush to find her. Dalton however, returns as he hears of Wapol's return.\n",
  "long_summary": "Sanji and Luffy encounter a herd of lapahns. While under attack, Sanji tells Luffy not to attack nor be struck by the animals, as Nami would receive the impact too. Sanji uses Flanchet Shoot on a lapahn.\nAt a town, Kureha treats a sick boy by doing a little operation and giving him antibiotics. She then charges a fee of food, beverages, trash bags, and 50% of the restaurant's assets. After the boy awakens and gives her his thanks, she decides to make a 1% discount on the fee.\nZoro is outside the ship, training his body to resist the cold while Karoo is watching covered in a blanket. Zoro invites Karoo to join him, but he refuses by shaking his head with his eyes closed. After he opens them again, he does not see Zoro and thinks he must have drowned in the river. Karoo nervously jumps off the ship to save him, while Zoro comes out of the water, commenting how nice the dive was. Back in the wilderness surrounding the Drum Rockies, Sanji and Luffy are hindered by the persistence of the rabbits. On their way to Cocoa Weed, Dalton talks about the former king, and how he was a subordinate of his reign and how Wapol formed the Isshi-20 while restricting the access to doctors for the country. After seeing Vivi's anger just afterwards, Dalton seems to come to the conclusion that Vivi is indeed a princess that he has seen before.\nZoro got lost and while wandering in the woods, he encounters Kureha and Chopper. He asks if she can give him a ride to the next village, but Kureha kicks him in the face for calling her old and leaves. Zoro then decides to train his muscles in order to get warmer. At the coast of Drum Island, the Bliking Pirates arrive. As Kuromarimo holds a citizen captive, they have beaten the watchmen. Wapol is then seen riding on Robson. After Chess informs the status of the Drum Castle, Wapol's crew begins to mobilize, but they then changes course, as the Going Merry is spotted. Usopp and the others are speaking to some people in Cocoa Weed and someone says that the doctor went to Gyasta. A badly injured watchmen informs of the arrival of Wapol to Dalton. Luffy and Sanji find themselves in the middle of an avalanche caused by the lapahns.\n"
}