{
  "chapter_number": "Episode 98",
  "title": "Here Come the Desert Pirates! The Men Who Live Free",
  "short_summary": "Nami and Vivi find themselves an easier way to travel in the desert and leave all the men behind. While trying to catch up with them, Ace gets lost. Luffy and the rest of the gang find the Barbar Pirates and Vivi meets a figure from her past.\n",
  "long_summary": "The Straw Hats are on their journey through the desert and Luffy is really thirsty. Vivi and Nami get ahead of them because they are riding Matsuge. Zoro is pulling Chopper because he cannot stand the heat. Suddenly Luffy starts seeing that a tsunami is coming and Usopp remembers he let him drink a cactus back during their journey. Chopper realizes that it was a psychoactive cactus which causes hallucinations. Luffy tries to hit the others and Chopper injects him with a tranquilizer. Zoro is pulling Luffy and they continue their journey, but they suddenly notice they've lost sight of Nami and Vivi as well as Ace. Luffy wakes up and everyone blames him for getting lost. Usopp starts hearing something, and when they pass the dunes, a pirate ship is sailing through the sand. Usopp then sees that the pirates have captured Nami and Vivi. Luffy starts to run towards the ship and the others follow him. He then stretches his arms and he tangles them around the mast. He rams into the mast, breaking it. The mast then falls over the deck of the ship. A Giant Scorpion comes from below the sand in front of Ace and he tells it not to dare do it. Luffy is on the deck of the ship with the pirates, telling them that he is really thirsty. Nami asks if he did not come to save them, but he says that he only came for water. The captain of the pirates walks towards Luffy and mentions that they are the Barbar Pirates. He also mentions that they have a saying: aside from friends, everything alive in the desert can be eaten. Luffy has a chitchat with Barbarossa and he later apologizes for treating Luffy's friends that way. He says that they were really hungry and wanted to eat something. Then one pirate says that they cannot leave because the main mast is broken and without it, they will not have enough thrust to go through the sand. Luffy decides to collect wood for the pirates in order to fix the ship, since he is the one responsible for breaking it. They give them a sand sled and let Rasa and Zaba accompany them because they know where the Meriyasu Oasis is.\nAce is walking and the scorpion is behind him, defeated with smoke coming out of it. He then says that he warned him.\nMeanwhile, Luffy and Vivi are in trouble after Rasa pushed their sled into quicksand.\nSanji and Zoro are working inside the ship of Barbarossa and Nami is talking with him. The Sandora Desert Bandits approach the ship's location to fight the pirates. A Sandora Giant Bug is carrying a large ball of dung over a dune, only to release it towards the Barbar Pirate's ship. Barbarossa tries to stop the dung after it has gained momentum, but he is quickly overcome, so Zoro cuts it into pieces and Sanji breaks the debris coming towards the ship. A Giant Gecko is messing with Ace's course, but after he sees the roasted scorpion he starts to cry. Meanwhile, Luffy is able to reach for the sled that Rasa is piloting in order to pull their sled back on course. Luffy and the others arrive at the oasis, only to find everything is buried. Here, they learn about Rasa's backstory. During dusk, Ace is seen riding the gecko and screams after Luffy.\nWhile this episode is mostly filler, the part where Luffy hallucinates after drinking cactus juice is found in the manga.\n",
  "characters": [
    "Monkey D. Luffy",
    "Usopp",
    "Matsuge",
    "Nami",
    "Nefertari Vivi",
    "Sanji",
    "Tony Tony Chopper",
    "Roronoa Zoro",
    "Portgas D. Ace",
    "Barbarossa",
    "Zaba",
    "Rasa",
    "Igaram (flashback)",
    "Nefertari Cobra (flashback)"
  ],
  "ssum_frequencies": [
    [
      "the",
      5
    ],
    [
      "and",
      4
    ],
    [
      "vivi",
      2
    ],
    [
      "find",
      2
    ],
    [
      "to",
      2
    ],
    [
      "nami",
      1
    ],
    [
      "themselves",
      1
    ],
    [
      "an",
      1
    ],
    [
      "easier",
      1
    ],
    [
      "way",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      44
    ],
    [
      "and",
      25
    ],
    [
      "is",
      22
    ],
    [
      "he",
      19
    ],
    [
      "luffy",
      15
    ],
    [
      "to",
      15
    ],
    [
      "a",
      13
    ],
    [
      "they",
      12
    ],
    [
      "that",
      12
    ],
    [
      "it",
      10
    ],
    [
      "of",
      9
    ],
    [
      "ship",
      8
    ],
    [
      "him",
      7
    ],
    [
      "pirates",
      7
    ],
    [
      "them",
      6
    ],
    [
      "with",
      6
    ],
    [
      "for",
      6
    ],
    [
      "in",
      6
    ],
    [
      "are",
      5
    ],
    [
      "their",
      5
    ]
  ]
}