{
  "chapter_number": "Episode 127",
  "title": "A Farewell to Arms! Pirates and a Little Justice",
  "short_summary": "With the fighting over and Crocodile in custody, the air was cleared as to what really happened in Arabasta, and the long road to recovery finally begins.\n",
  "long_summary": "Although the people's anger is quelled, they don't initially believe Vivi's claim that \"the nightmare is over\". The people are still angry that King Cobra apparently attacked Nanohana. At this point, Chaka orders the Royal Army of Arabasta to stand down. Also, Igaram appears, to Vivi's relief as she descends the clock tower. He presents Kappa, the kid who was allegedly hurt by the Royal Army in Nanohana. Kappa testifies to the treachery of Crocodile and Baroque Works, and how Mr. 2 Bon Kurei impersonated King Cobra. The people finally agree to throw their weapons down for good.\nIn the streets, the Straw Hat Pirates are met by King Cobra, who is carrying Luffy, weak but alive. Sanji doesn't know who Cobra is at first, until Vivi runs to him and hugs him. Cobra said Luffy somehow found the strength to carry both of them up to the surface. He also says Luffy got an antidote for Crocodile's poison, though he'll still need to be treated for his injuries. The Straw Hats say they'll make their way to the palace incognito when they're ready, since they're wanted.\nThe people gather around the disgraced Crocodile as the Marines arrive with Tashigi. Tashigi reveals that her men had confiscated Baroque Works ships with \"Dance Powder\", a powder that can induce rain, and linked them to Crocodile. She strips him of his title as Warlord of the Sea and places him under arrest, though he's still unconscious and can't resist anyway. The rest of Baroque Works is out of commission...except for Mr. 2, who sneaks through Alubarna to get away. Koza tries to reconcile the actions of the rebellion as he digests Crocodile's treachery. But King Cobra tells his people they can get past this ugly moment in their history, and Arabasta can continue to move forward.\nOn the coastline, Hina accuses Smoker of using the Dance Powder. Smoker says he knows King Cobra was trying to protect his kingdom without using it, and didn't want to ruin that. He asks Hina to take the ship they are aboard, the Baroque Works rainmaker ship, and Crocodile to Headquarters. Tashigi also orders the Marines in her unit to turn a blind eye to the Straw Hats. The wounded are cleared from Alubarna's square, and Koza assures Vivi that he'll be fine. The people of Arabasta rejoice at the return of the rain. That evening, back at the palace, the Straw Hats finally made it back and are now recuperating from their injuries. Vivi is watching the rain in their room when Igaram came in. He eulogizes Pell and honors his bravery in protecting the kingdom.\nThe next day, at the port where the Marines are moored, Tashigi arrives with Crocodile. She reports to Smoker, and apologizes for letting Luffy go. Smoker ignores it. Tashigi feels as if she could not figure out what true justice was in the situation and was ashamed that she assisted the Straw Hats in defeating Crocodile. Smoker starts talking about ambition, and how some he knows are making names for themselves. Smoker provides no comfort to the conflicted Tashigi, only telling her to get stronger if she is feels she is not up to the task. She declares she will, and he tells the other soldiers they can only wish for guts like hers.\nMarine Headquarters places a Den Den Mushi call in to Smoker, requesting he and Tashigi report in. They have ignored his report, and are crediting him and Tashigi with the apprehension of Crocodile, with promotions in rank to match. Hina says the World Government wants to cover up the Straw Hats' involvement. Unwilling to accept that, Smoker angrily tells the World Government what they can do with their promotion.\n"
}