{
  "chapter_number": "Episode 96",
  "title": "The Green City, Erumalu and the Kung Fu Dugongs",
  "short_summary": "Ace decides to travel with the Straw Hat Pirates for a while, as he is hunting for a man known as Blackbeard. The group arrives first at the 'Green City' of Erumalu only to find it abandoned to the desert. Vivi and Nami explain what Dance Powder is and what it has done to Arabasta.\n",
  "long_summary": "Citizens are gathered outside the Alubarna Palace to see the king. The guards start to push them, when Nefertari Cobra comes out and tells them that everyone who wants to speak with him can come inside. He cannot solve their problems right now, but he can hear and empathize with them. He then tells the people that he will make the kingdom great again, even if it costs him his life. After that, he goes along with Pell and wonders where and what Vivi is doing.\nIn the Going Merry, Luffy and Usopp are playing with the wet rice and Sanji hits them and tells them not to play with food. He then says that if they have nothing to do, they can wash the dishes. He says he has to pack lunches and Ace tells him that he can help, but Sanji declines because Ace is a guest. Usopp and Luffy start washing the dishes, but Sanji scolds them because they are using mop water to wash the dishes. Zoro is training while Chopper is feeling the breeze made by his swings. Vivi asks Nami if they can stop, as she has an important task for Karoo. They are outside the ship on a shore and Vivi asks Karoo if he can deliver a letter for his father, even though he has to cross a desert by himself. In that letter, she has written all the schemes of Baroque Works. Karoo accepts and departs rapidly. On the deck of the ship, Ace suggests to Zoro that Crocodile might have a deeper goal than just usurping the throne.\nCrocodile lights a cigar and talks to himself about his views on Arabasta, the kingdom of sand, when Miss All Sunday starts walking towards him. She then informs Crocodile that the Billions ships that were at the port town of Nanohana have been all wiped out by a single person, and that they are confirming the information just as they speak. Crocodile tells Miss All Sunday that they have more volunteers to Billions, but if someone tries to get in his way, she should crush them. Miss All Sunday responds that she has already sent the Erimaki Runners to contact the others.\nThe Straw Hats arrive at the desert and Chopper comments that he bets it will be hot. Nami answers him by telling him that it gets over 50°C in the desert. Sanji sees that Nami and Vivi have full clothes now and is upset that they changed their clothes. Vivi tells him that any exposed skin in the desert will result in a sunburn. Sanji then starts rolling in the deck as the other head to exit the ship. Zoro is about to drop the anchor when he sees figures inside the water. Kung-Fu Dugongs get out of the water and Luffy thinks they are seals, but Vivi screams what they are. Usopp tries to fight one of them, but is defeated. Luffy defeats one, but Vivi explains that if you win, they become your pupils. Luffy starts training with them and they want to follow him afterwards, but Vivi tell him that they cannot cross the desert. Chopper comes up with the idea of giving them food so they stay at the shore. When he takes out a piece of meat, all the Kung-Fu Dugongs top Chopper. After that, the Kung-Fu Dugongs are giving them a farewell with a drum and Sanji gets mad because Luffy just lowered the supplies of the Straw Hats. The pirates arrive to Erumalu. Vivi explains how it used to be known and why now it is a ghost town. Dance Powder was used to rain in Alubarna and people called it the King's Miracle. After that, a load of the powder was sent as if the king had ordered it, making it seem like the king was provoking the droughts in surrounding towns. Luffy gets angry and destroys a building with a punch, he then tells Vivi that he is itching to complete their mission. Everyone then heads towards Yuba.\nThe following are the differences between the anime and the manga:\nThe following were added in the anime:\nThe following was extended in the anime:\n"
}