{
  "chapter_number": "Episode 18",
  "title": "You Are a Special Animal! Gaimon and His Bizarre Friends",
  "short_summary": "After designing a jolly roger for the crew, they visit the Island of Rare Animals for treasure. They do not find treasure, but they befriend Gaimon, a man trapped in a box who had been living on the island for twenty years.\n",
  "long_summary": "While at sea, Luffy designs a jolly roger to represent the crew. After refining the design with his artistic skills, Usopp paints it to the sails. However, Nami spots the Island of Rare Animals in the distance, an island rumoured to contain legendary treasures but is divinely protected by the gods.\nThe crew decide to dock at the island to plunder its treasures. However, they are quickly confronted by strange hybrid animals and an unseen man claiming to be a god. After his makeshift traps fail against the crew, he attempts to retreat, but the crew catch him. They discover the man is Gaimon, a man who had been trapped in a box for twenty years. Luffy quickly befriends Gaimon, but is warned of the horrors that lie ahead in the Grand Line.\nGaimon explains his past. Formerly a boy aboard a pirate ship, he too arrived at the island in search of treasures, but his crew failed to find any treasure after a month of searching and prepared to leave. Gaimon finally found treasure atop a mountain, but fell off the mountain and into a box, where he became stuck. He also found out that his crew had already set sail, leaving him behind.\nThe crew decide to search for the treasure themselves. However, after Luffy climbs the mountain, he realizes that all five treasure boxes at the top of the mountain were empty. Luffy decides to invite Gaimon into his crew. Gaimon refuses, stating that he had befriending the animals native to the island. He also states that knowing there was no treasure gave him closure and the freedom to live as he pleased. After Gaimon thanks them for their help, the crew depart, heading towards their next destination.\n",
  "characters": [
    "Usopp",
    "Roronoa Zoro",
    "Nami",
    "Monkey D. Luffy",
    "Usagihebi",
    "Cocox",
    "Lionbuta",
    "Kabagorilla",
    "Kirinkodanuki",
    "Kamonohitsuji",
    "Saikangaroo",
    "Gaimon"
  ],
  "ssum_frequencies": [
    [
      "a",
      3
    ],
    [
      "for",
      3
    ],
    [
      "the",
      3
    ],
    [
      "they",
      3
    ],
    [
      "island",
      2
    ],
    [
      "treasure",
      2
    ],
    [
      "after",
      1
    ],
    [
      "designing",
      1
    ],
    [
      "jolly",
      1
    ],
    [
      "roger",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      24
    ],
    [
      "to",
      13
    ],
    [
      "a",
      9
    ],
    [
      "crew",
      9
    ],
    [
      "he",
      8
    ],
    [
      "gaimon",
      7
    ],
    [
      "his",
      6
    ],
    [
      "after",
      5
    ],
    [
      "island",
      5
    ],
    [
      "of",
      5
    ],
    [
      "but",
      5
    ],
    [
      "that",
      5
    ],
    [
      "treasure",
      5
    ],
    [
      "at",
      4
    ],
    [
      "luffy",
      4
    ],
    [
      "in",
      4
    ],
    [
      "and",
      4
    ],
    [
      "mountain",
      4
    ],
    [
      "however",
      3
    ],
    [
      "animals",
      3
    ]
  ]
}