{
  "chapter_number": "Episode 182",
  "title": "Finally Clashing! Pirate Luffy vs God Enel!!",
  "short_summary": "Finally, Luffy meets up with Enel. During the battle, Enel realizes that he cannot hurt Luffy because he is made of rubber. Meanwhile, Conis tells the dangers of staying in Angel Island to the other Skypieans.\n",
  "long_summary": "Conis is seen riding a waver towards Angel Island. At Lovely Street, McKinley announces to the public that Conis, Pagaya and Gan Fall, their former God, are on the run and that any information related to their capture should be reported to him and the White Berets. The citizens are concerned that if the three are hiding nearby, then God's judgement may land on the citizens as well. Just then, a soldier reports to McKinley that Conis has appeared at the harbor. As Conis advances with her waver, the White Berets are shooting arrows towards her. McKinley wonders why Conis is acting like she wants to be captured and proceeds to order for her capture. As the White Berets prepare to stop her advance, Conis continues to approach them with full speed, asking them to get out of her way. She manages to run over McKinley and as she jumps off of the waver, the waver crashes into McKinley and against a building. Conis finds herself surrounded by worried citizens who are afraid that God's judgement will be cast upon her, and that they'll get caught in it.\nAt the Arc Maxim, Enel is laughing and mentions to Nami that Conis has caused a scene at Angel Island, to which Nami responds that she was supposed to be at the Going Merry. Nami asks Enel about his Mantra abilities, particularly on his ability to identify people. Enel explains that he is able to use his lightning powers to read radio waves within Skypeia and if he hears a conversation he doesn't like, he casts his judgement. Nami begins to worry again and wonders how she'll escape. Enel stares at her direction and she asks him if something's wrong. Enel stares away and wonders whose presence he is sensing and then mentions to Nami that it was nothing.\nBack at Angel Island, Conis is begging the crowd to hear her out, to which the citizens respond back to stay away from them. A soldier attempts to attack her but Conis aims her Burn Bazooka at him, threatening to shoot. She then tells the crowd to go to the edge of the clouds at Cloud End so they can escape by boats to the Blue Sea, as the island will be destroyed by Enel. The crowd remains skeptical and a child throws a tomato at her face. Conis drops her Burn Bazooka and McKinley wonders what she is about to do. Shocking the crowd, she yells out that she does not accept Enel as God. The crowd runs away and hides, as to not receive God's judgement.\nEventually, the crowd notices that nothing happened to her and she responds saying that there's no point to God casting judgement on her when the whole island will be eliminated. She tells them that this message is from a soldier who risked his life to tell Pagaya and her this information, before judgement was cast on her father and the soldier. The crowd remains uneasy, as the same child asks why a God that helps them would do such a thing. Conis again pleads them to go to Cloud End, but the citizens express concern on leaving their homeland and relocating in the unknown Blue Sea. She tells them this is better than getting killed and that for the past six years, they all should know what kind of man Enel is. The crowd remains uncertain, believing that the events she fears may not happen or that a miracle will save them.\nIn shock at the crowd's stubbornness, Conis shoots her Burn Bazooka into the clouds. She reminds them that Enel has the power to keep them in despair and that time is running out and that waiting for a miracle to happen won't save them. She concludes to them that lying low as victims is no longer safe and that they must take action now to leave the island, for they can no longer protect their lives by blaming someone later. The crowd is moved by this and many of them go to pack their things and head to Cloud End. Some members of the crowd remain, asking of the status of their family members that are part of the Divine Squad, to which she responds that she doesn't know. They ask what the Divine Squad is doing in the first place, and McKinley interrupts them saying the White Berets will figure it out and tells the crowd to go ahead and that the Divine Squad will catch up to them. \nThe crowd is convinced and leaves, and McKinley tells Conis that he can't let this island turn into Birka, a southeastern sky island that Enel was raised on that disappeared six years ago, implying Enel destroyed his home island before coming to Skypeia. McKinley reveals that prior to Enel's arrival, McKinley used to serve under Gan Fall's Divine Squad. McKinley formed the White Berets knowing that while it would appear to betray the Divine Squad, he would be able to protect the island by enforcing Enel's rule. The White Berets gave the island years of stability by ensuring that no one would anger God, but McKinley now admits it was all for nothing if the island is truly eliminated. Conis tells McKinley that he had the people's safety prioritized, and that is nothing to be ashamed of. Conis asks him to continue to protect the people so she can help the Straw Hats escape.\nLuffy and Aisa riding on Pierre are seen running towards the location of the Arc Maxim. Robin wakes up and realizes that she can't carry Zoro, Wyper, Chopper, Gan Fall and herself up the stalk to escape at once but that they still need to escape to the upper area. Enel realizes that the presence he senses is not one of the five that survived and wonders where this new presence was hiding. Enel jumps towards the edge of the Arc Maxim to see and hear Luffy screaming for him. Nami runs over to see a determined Luffy ready to fight back. As Enel and Luffy exchange words, Aisa and Pierre are hiding and witnessing their display and she worries for Luffy's safety. As Nami attempts to warn Luffy of Enel's powers, Enel stares at her which stops her from talking. Enel comments that he can hear Angel Island running about and that they must've realized what will happen to them. Luffy asks him what makes him God and Enel responds he'll know soon enough. Luffy runs up and stretches his arm to get onto a platform, to which Enel comments that Luffy is no ordinary human either, but only a Paramecia user. \nAs Enel charges El Thor, Luffy rushes towards him, but El Thor is fired. Nami and Aisa scream at the display. As the smoke clears out, a giant hole is seen in the walls, and Luffy looks at it questionably before returning his gaze to Enel. To Nami's surprise and to Enel's amazement, Luffy dodged the attack. Enel charges up 60 Million Volt Jamboule and fires it at Luffy, which catches him this time. The smoke clears again to show an unharmed Luffy. Enel zaps out of his space to appear directly in front of Luffy this time and uses 100 Million Volt Vaari. Nami then realizes that Enel's attacks are useless, as electric attacks don't affect the rubber properties of Luffy's body. Luffy yells out that he's had enough and after that final attack by Enel failed, shocked faces from Nami, Aisa, Pierre and finally Enel are revealed. Enel shakes his head thinking that physical attacks won't harm his body but as Luffy runs towards him, he successfully kicks and damages Enel. Nami now realizes that Enel's lightning effects can't protect him either, and that Luffy may be the only natural enemy to Enel.\n\n",
  "characters": [
    "Conis",
    "McKinley",
    "Enel",
    "Nami",
    "Pagaya (flashback)",
    "Moyle (flashback)",
    "Monkey D. Luffy",
    "Pierre",
    "Nico Robin",
    "Gan Fall (K.O)",
    "Roronoa Zoro (K.O)",
    "Tony Tony Chopper (K.O)",
    "Wyper (K.O)",
    "Aisa"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "luffy",
      2
    ],
    [
      "enel",
      2
    ],
    [
      "he",
      2
    ],
    [
      "of",
      2
    ],
    [
      "finally",
      1
    ],
    [
      "meets",
      1
    ],
    [
      "up",
      1
    ],
    [
      "with",
      1
    ],
    [
      "during",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      71
    ],
    [
      "to",
      66
    ],
    [
      "and",
      53
    ],
    [
      "that",
      47
    ],
    [
      "enel",
      27
    ],
    [
      "is",
      21
    ],
    [
      "she",
      20
    ],
    [
      "her",
      19
    ],
    [
      "a",
      18
    ],
    [
      "of",
      18
    ],
    [
      "luffy",
      17
    ],
    [
      "conis",
      16
    ],
    [
      "at",
      16
    ],
    [
      "them",
      16
    ],
    [
      "as",
      15
    ],
    [
      "island",
      13
    ],
    [
      "mckinley",
      13
    ],
    [
      "crowd",
      12
    ],
    [
      "him",
      11
    ],
    [
      "nami",
      11
    ]
  ]
}