{
  "chapter_number": "Episode 263",
  "title": "The Judiciary Island! The Full Picture of Enies Lobby!",
  "short_summary": "Nico Robin willingly follows Blueno into his improvised door, and Sogeking and Sanji are left alone. For a while, Blueno explains a little of Robin's past involving the Buster Call. Back at the Rocketman, Yokozuna the frog jumps onto the front of the train, knocking them from the rails. After Kokoro speaks with him, he joins the group. CP9, Franky, and Robin finally reach Enies Lobby and disembark.\n",
  "long_summary": "Blueno appears behind Sanji using his Doa Doa no Mi powers and uses Rankyaku to send Sanji flying backwards. Robin and Sogeking watch in horror as Sanji almost slides off the train car. Sogeking wonders how Blueno did that and Blueno slowly starts walking toward them. Sogeking stands in Blueno's way but as Sogeking briefly talks with Robin, Blueno disappeared. Blueno suddenly appears behind Sogeking and Sogeking turns around in horror.\nFranky is surprised that Blueno disappeared but Rob Lucci explains it's because of Blueno's Doa Doa no Mi powers that allows him to create doors even in the air itself (Air Door). Blueno uses Shigan onto Sogeking and Sogeking falls to his knees. Sogeking demands Blueno to let Robin go but Blueno stabs him again with Shigan. Sogeking falls to the ground and Sanji attempts to attack Blueno but he uses Tekkai to block. Blueno comments on Sanji's weaker kick and viciously slams Sanji to the ground. Blueno attempts to attack Sanji again but Robin holds him back using her powers saying she promises that she won't escape and not to hurt them. Blueno says that they keep attacking him and Robin urges him to leave before Sanji and Sogeking gets up again. Sogeking suddenly speaks up saying they will be alright and knows she is still hiding something. Sogeking there is one last thing and that is a pirate isn't allowed to leave their crew without their captain's permission. He then says she can always believe in Luffy. As Robin heard his statement, Robin suddenly remembers an island being destroyed. Blueno kicks away Sogeking and Robin enters through the air door. Sanji calls out to Robin but Blueno cuts him off saying she wouldn't break their agreement. Sanji wants to know why and Blueno explains that, long ago, an island was erased. He continues saying that the Navy issued a Buster Call that completely wiped out the island and that Robin was the only survivor who was a child at the time. Sanji is shocked to be hearing this and Blueno says that Robin was living with that nightmare for years. Sanji angrily says that they knew and are just using her and Blueno says that of course they knew and it's for the sake of justice. Sanji angrily tries to kick Blueno but he already disappears behind his air door. Sanji yells out that it isn't over. Back in train car 2, Lucci tells Robin to take a seat as they will arrive in Enies Lobby shortly. Franky, wanting to know what's going on, follows Robin and Kalifa wonders if it's a good idea to let Franky go into the train car with Robin. Lucci says that there is nothing they can do as they almost reached their destination and all they can do is await their execution.\nBack on the Rocketman, Luffy angrily yells at Yokozuna for derailing the train and demands an apology. Yokozuna yells back at Luffy but Luffy starts attacking him threatening to eat him. Yokozuna slams Luffy backwards and, inside, Paulie wonders what is going on. Everyone else are shaken up and Zambai notices that his King Bulls are gone with the rest of the Franky Family. Paulie says that they're the ones that disappeared as their train got derailed. Everyone is suddenly shocked that Zoro is sleeping while Kokoro gets the Sea Train in control. Zambai asks Kokoro if they will be okay and Kokoro tries to get the Sea Train back on course. Nami asks Kokoro if they know which direction to go and Kokoro says of course as the Sea Trains are built with external poses that always point to the other island's stations. Nami says she will watch the sea as she is a navigator and Kokoro is glad to hear it. Kokoro then yells at Yokozuna to get over to her and Yokozuna does. Kokoro talks with Yokozuna knowing he was just trying to protect her but Kokoro informs him that the pirates didn't kidnap her. Everyone is surprised that Kokoro is talking to a frog and, meanwhile, the Franky Family are trying to look for everyone else. Suddenly, one of the members spots a lone train car and prepare to fight. However, upon closer examination, they spot Sanji.\nBack on the Puffing Tom, Kalifa informs an Enies Lobby associate that they will be arriving soon. Lucci says how he feels nostalgic about returning to the \"nightless island.\" In train car 1, Franky is shocked to hear the Iceburg is still alive. Robin tells Franky that CP9 still believes they killed him and that Franky should keep quiet about it. Franky says that Robin acts tough but she does have a heart. Franky then says that the World Government has got what they want: the only women that has the know-how to bring back an ancient weapon and the man with the only known blueprints for one. Franky continues saying if the government gets hold of those blueprints, the entire world will be turned upside down. Franky says that his master laid down his life to ensure those blueprints wouldn't fall into the government's hands. Franky tells Robin that she must find a way to get back to Luffy but Robin says she can't stay with them, all she will bring is suffering. Franky ensures Robin that she isn't the one that is hurting them but the government is. Franky says that the government may say that Robin's existence is a crime but, no matter how dangerous you are, just being alive and who you are is never wrong. Franky continues saying no matter what you do, you are who you are.\nBack on the Rocketman, Kokoro tells Yokozuna it's been eight years since Tom has been taken away. She notices how Yokozuna has challenged the Sea Train every day since then and that Yokozuna wants to get stronger so he wouldn't have to lose the ones he loves again. Kokoro tells Yokozuna it's time to put his training to the test as Franky has been taken away as well. Kokoro asks if Yokozuna is up for a fight and Yokozuna yells out signaling a \"yes\". Kokoro tells Luffy that she found another ally for him and Luffy is glad to hear it. Nami tells Kokoro that she has found a good current to get back on track and Kokoro is determined to get them back on course. Luffy, now on Yokozuna, is ready to go. Meanwhile, the Puffing Tom has arrived at Enies Lobby and the Marines welcome CP9. However, Franky starts to bite on the head on one of the Marines and the rest of the Marines try to restrain him. Robin exits the train as well and Lucci comments on how loud Franky is. CP9 walks down with Franky and Robin and the rest of the Marines and government agents comment on the group. Franky is shocked to see the view of Enies Lobby and notices the waterfall that flows down to nothing.\n"
}