{
  "chapter_number": "Episode 157",
  "title": "Can we Escape!? God's Ordeals are Set in Motion!",
  "short_summary": "While trying to escape from Skypiea, Robin, Chopper, Nami, and Zoro end up going to the forest, taken by a huge shrimp: a servant of God.\n",
  "long_summary": "The Straw Hats have now been marked as wanted criminals and Nami convinces the crew for them to leave. However, Luffy remains adamant in not leaving until he visits the Upper Yard. Just as they are about to leave, Luffy asks Pagaya if they could take the rest of the food left in his house and he agrees. Luffy calls Sanji to come along to pack them lunches. Usopp then asks if he could take some materials that may be needed to fix a ship and Pagaya again agrees. The three of them leave to Conis house while the rest of the crew goes to the ship.\nConis then approaches the rest of the crew on the ship to tell them about a special cloud they could get on that would get them past the White Sea quickly and get them to Cloud End faster. Nami is excited to hear the news and states they just need to get there on time before Luffy realizes. Conis then tells them to raise their anchor and wait for the 3 that went up to her house. While at Conis house, Luffy notices she was not around and Pagaya tells them she went to give her regards to the rest of the crew.\nAfter Conis left, Nami comments about seeing a ray of hope in their situation. Robin then questions if such a special cloud existed and if it did, it would not be unusual for Skypieans to live in the Blue Sea. However, Nami and Chopper disapproves it and Chopper uses Heavy Point to raise the anchor of their ship. Conis returns to her house and there Luffy and Sanji are going back andeal on food when Usopp gets up and looks towards the sea. The rest of the crew are awaiting the return of the 3 that left to Conis' house when they felt the ship move. Usopp then notices that something is going on and calls the attention of the other 2. They come out and realize that the ship has started to sail. Luffy comments on how cool it was that the ship was sailing backwards but Usopp tells them to look closely and they can see a shadow underneath the ship pulling the ship along with it.\nZoro wonders if they have gotten on the special current and Robin tells him that was not the case. While trying to understand the situation, Pagaya tells them that which is pulling their ship is the Super-Express Speed Shrimp. Zoro tells the rest of them to jump out of the ship and he would think of something but they were worried at what would happen to the ship if they left it. Zoro cuts the Speedy Shrimp and Robin tells him to stop because others will come after them. She says it may just be the beginning and Zoro comments on Heaven's Judgment saying the God is calling them forth.\nLuffy, Usopp and Sanji ask where the rest of the crew are taken to and Pagaya says the Super-Express Speed Shrimp is a servant of God and most likely they are taken to the Sacrificial Altar at the Upper Yard. Sanji is very angry at  God and Pagaya goes on to explain that people who are to become sacrifices receive one of the two judgments of heaven. They are either the sacrifice or the ordeal. He goes on to explain that the people being judged are the three of them left behind. Pagaya describes to them how to reach the location of the Sacrificial Altar. Luffy then replies that so all they have to do is to beat the priests and that things just got interesting.\n",
  "characters": [
    "Monkey D. Luffy",
    "Nami",
    "Usopp",
    "Sanji",
    "Roronoa Zoro",
    "Nico Robin",
    "Tony Tony Chopper",
    "Pagaya",
    "Conis",
    "Su",
    "Amazon (flashback)",
    "McKinley"
  ],
  "ssum_frequencies": [
    [
      "to",
      2
    ],
    [
      "a",
      2
    ],
    [
      "while",
      1
    ],
    [
      "trying",
      1
    ],
    [
      "escape",
      1
    ],
    [
      "from",
      1
    ],
    [
      "skypiea",
      1
    ],
    [
      "robin",
      1
    ],
    [
      "chopper",
      1
    ],
    [
      "nami",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      54
    ],
    [
      "to",
      34
    ],
    [
      "and",
      25
    ],
    [
      "of",
      19
    ],
    [
      "them",
      15
    ],
    [
      "they",
      13
    ],
    [
      "that",
      13
    ],
    [
      "ship",
      12
    ],
    [
      "on",
      10
    ],
    [
      "luffy",
      9
    ],
    [
      "are",
      8
    ],
    [
      "is",
      8
    ],
    [
      "pagaya",
      7
    ],
    [
      "rest",
      7
    ],
    [
      "conis",
      7
    ],
    [
      "tells",
      7
    ],
    [
      "it",
      7
    ],
    [
      "crew",
      6
    ],
    [
      "if",
      6
    ],
    [
      "house",
      6
    ]
  ]
}