{
  "chapter_number": "Episode 128",
  "title": "The Pirates' Banquet and Operation Escape Arabasta!",
  "short_summary": "Luffy recuperates after his defeat of Crocodile, and King Cobra does his best to thank the Straw Hats for saving his kingdom and his daughter. The Marines are closing in, but Luffy gets an unexpected ally. Meanwhile, Vivi ponders whether her destiny is on the sea, or in Arabasta.\n",
  "long_summary": "Dr. Ho wonders over Chopper's skill at mixing medicine. As she passes by, Vivi notes that he was trained as a doctor on Drum Island. Dr. Ho notes he did not know about Chopper's techniques despite 40 years of training himself. Chopper goes into his usual routine of responding to praise with insults, but Dr. Ho translates them as appreciation. Vivi cares for Luffy at a nearby bed, with Karoo laying at the next bed over.\nSanji and Usopp walk through the capital city as it rebuilds, remarking at the people's resilience as they rebuild. Sanji quickly walks away from one area when he recalls that a particular set of holes through a series of buildings was caused by him. Zoro is elsewhere, working on his concentration by balancing boulders on his fists, seeking to be able to call upon his utmost skills at the shortest notice. In the palace library, King Cobra encourages Nami to take as many books as she likes back with her when the Straw Hats depart. Chaka and his guards hold off Marines who are looking for Luffy and Zoro while Sanji and Usopp, who are not yet wanted, walk by unnoticed.\nLuffy soon wakes up, and is feeling much better. He looks for his hat, then quickly feels hungry, and is conflicted between looking for his hat and finding food. Usopp points out Luffy's straw hat on the next bed over; it was found at the ruins by a soldier. Luffy had no idea that he was in bad shape when he was brought to the palace infirmary, and thanks Chopper and Vivi for nursing him back to health. Zoro enters, and Luffy says to him \"Long time, no see\", then gets puzzled as to why he says it. Zoro gets yelled at by Chopper for ignoring his advice to take it easy. Apparently, Luffy had been asleep for three days; he calculates that he missed 15 meals. A figure comes in, sensing Luffy's awakening. At first Zoro thinks it's Igaram crossdressing, but it's actually his wife, Terracotta, the royal chef. Zoro notes how disturbingly similar she looks to Igaram. She is personally overseeing the banquet to thank Luffy for rescuing Vivi and her husband. Having heard of Luffy's legendary appetite, she has brought a large tray of fruit for Luffy to tide him over before dinner. He scarfs the entire tray up in a split-second. Terracotta looks forward to the challenge of feeding Luffy.\nAt the banquet that follows, the palace guards stand in disbelief as the Straw Hats gorge themselves, especially Luffy, who has a bad habit of eating food off other people's plates. Sanji is concerned over how fast Chopper is sucking down pasta. Usopp puts the contents of one of his Tabasco no Boshi on a rice ball as a trick; Luffy eats it, of course, and spits fire. Sanji starts to get recipes from the servers. Vivi just laughs at the spectacle, and soon even the guards can't help but laugh as the banquet gets even more raucous. It eventually involves the nose chopsticks. All the while, Terracotta cooks happily, embracing the challenge.\nLater on, Cobra invites the Straw Hats to the baths. Eventually, Sanji asks Igaram to show him toward the ladies' side of the bath, so he can do some peeping. He gets offended, but Cobra himself points at a wall they can look over, even though his daughter is in there. Nami and Vivi have that side of the bath to themselves, even though it is as spacious and lavish as the men's side. Nami wonders if a ship could carry such a bath. Vivi notes of all the wonderful things they have seen on their voyage together. As they get ready to switch so Nami can wash Vivi, they notice all the men looking over the wall; Luffy, Sanji, Usopp, Chopper, even Cobra and Igaram (only Zoro absent). Nami has a simple solution. She stands, pulling her towel around her, and tells the men they will owe her 100,000 each for this. She then unleashes her most diabolical move: Happiness Punch. She opens her towel, baring her entire body to the guys. They are all stunned, getting massive nosebleeds and falling back to their side, Sanji mumbling.\nWith their bath back to themselves, Nami notes the Straw Hats might leave Arabasta that evening. There's no reason for them to stay, and the Marines are probably looking for them by now. This news startles Vivi. On the men's side, Cobra does something unexpected by bowing to the Straw Hats. Igaram is alarmed by his un-kingly display of bowing to another man, but Cobra notes there's no such thing as a naked king. He is thanking them as a resident of Arabasta for saving his kingdom, and as a father for saving his daughter. Nami and Vivi overhear Cobra's gesture.\nAs night falls over the palace, Nami officially suggests to the others that they leave tonight. Zoro and Sanji agree with her reasoning. Luffy wants some more food, but Zoro says they have to leave immediately. Elsewhere in the palace, Chaka and Igaram have received a new bounty poster for Luffy, and one for Zoro as well. Luffy's bounty has been raised to 100,000,000, and Zoro now has a bounty of 60,000,000. Igaram remarks that Luffy can not turn back now that he's defeated one of the Seven Warlords of the Sea.\nLater that night, Igaram runs to warn the Straw Hats, but they are already gone, only Vivi left in their room. Vivi tells him they've already left.\nElsewhere in Arabasta, two Marine Sergeants appear on a ship. One of them is Jango, who has turned traitor on the pirate movement. The other is Fullbody, who has apparently gotten new clout among the Marines. They have taken down a pirate ship, and are dancing in victory. On the nearby dock, Hina is disappointed that their operation took so long. Another Marine notes that all harbors are blockaded, but the Going Merry has gone missing from Erumalu. She orders the Marines to search all over for their ship. Jango and Fullbody return to Hina. She orders them to begin patrol for the Straw Hat Pirates, to their excitement.\nThe Straw Hats are running across the desert on a group of riding ducks. Luffy is still eating; Sanji shares that he got some recipes and spices from Terracotta so he can make some native dishes in the future. Chopper looks at Nami, who is feeling down right now. Sanji suspects she's thinking about Vivi. Nami says she's down because she's giving up the 1 billion ransom she originally extorted from Igaram. Everyone is shocked that she's feeling down about giving up the money, as opposed to leaving Vivi behind. Usopp ends up falling off his duck.\nIgaram wants Vivi to ride to the Straw Hats and warn them about their increased bounties, but Vivi knows Karoo will never be able to catch them by now. Vivi insists they'll be alright, and pushes Igaram out of the room so she can sleep. She is due to address the people of Arabasta the next day. Igaram is concerned that she is too calm about it. Before she goes to bed, Vivi notes how quiet it is now that she's away from the Straw Hats.\nEarlier in the day, the Straw Hats got a call over Den Den Mushi from somebody named \"Bon-chan\". They recognize it as Bon Kurei. Luffy wonders what he wants. He claims that he's taken their ship to the upper Sandora River, and that they are now friends. Zoro says they have no choice but to go where he took their ship, and keep a watchful eye on if he has any tricks for them. Vivi gets their attention, and asks what she should do. She is still uncertain whether to stay or go. Nami says they will get their ship and sail to the Eastern Harbor. If Vivi is not there by Noon, they will consider her to be staying, and leave without her. It is at that point that the Straw Hats take their leave. Vivi notes she can leave for the Eastern Harbor at 8am and make it on time if she chooses; the question is, whether to be a pirate or a princess? She asks Karoo what he would like to do.\nBon Kurei greets the Straw Hats as they arrive at the Going Merry. Luffy is leery of Bon's help, since he lied earlier about helping them. But there's no longer a point to Bon for them to be enemies since Baroque Works is history. He says he took the Going Merry to keep it from being captured by the Marines, and alerts them that they have blocked all the ports. Luffy accepts him as a friend, but Zoro thinks Bon's just doing it because he's just as trapped by the Marines as they are. He admits that this is the case, and Bon Kurei's ship appears shortly thereafter to assist.\nThat morning, the Marines find the ship, and Hina prepares to enter the battle.\n"
}