{
  "chapter_number": "Episode 136",
  "title": "Zenny of Goat Island and the Pirate Ship in the Mountains!",
  "short_summary": "After escaping from several Marine ships, the Straw Hat Pirates land on an uncharted island and meet an old man named Zenny. Chopper finds out that, because of his bad heart, Zenny probably only has three days to live.\n",
  "long_summary": "The Straw Hat Pirates are being chased by the Marines and are trying to avoid them, as they are constantly firing cannonballs towards their ship. With the Straw Hat Pirates being low on food supplies, they are all starving, wondering if they are going to starve to death. A huge fog appears, which Nami believes can be used to their advantage to escape from the Marines. The Marine ships starts crashing into each other as they are hitting the barely visible rocks on the surface which just appeared after the fog. Chief Petty Officer Minchey orders his men to turn back because of the danger for the Marines. As the Straw Hat Pirates pass the thick fog and the rocks they see an uncharted island, hoping to find food on it. An old man is sighted with his binocular, counting the Straw Hat Pirates as six humans and an animal.\nAs the Straw Hat Pirates walk up from the shore, they spot a young goat, directly clarifying it as food. As they try to hunt it down, Nami stops them, stating that it shouldn't be eaten. Suddenly, a mob of angry full-grown goats have surrounded the Straw Hat Pirates. When the goats start attacking, Zoro brings out his sword, indicating that he will kill them but Chopper tells him not to due to the fact that they aren't bad, thanks to his ability to speak with animals. Chopper is trying to reason with the goats and finds out that someone ordered the goats to attack. Suddenly, an old man falls out of a tree pointing out the now transformed Chopper as a monster. They found out that this is the man who ordered the goats to attack.  \nThe old man passes out, from the fear of being cut by Zoro's blade as he is trying to free him from the branches that he has gotten stuck in.  They take him to his shed, where Chopper is getting him treated. As the old man is craving them to repay him for what they have done, Luffy finally says to help him out. On Zoro's hunt for food he finds a strange pirate ship, which he later in the evening tells the rest of the Straw Hat Pirates about after he returned with fruits as food. They all go to the ship to investigate it further. Nami states that he was once a pirate who is trying to escape the island with that pirate ship, which is more of a wreck than a ship. She also believes he has a hidden treasure somewhere on the island.\nMeanwhile, at Marine Captain Moore's base, Captain Moore tells Minchey to organize a landing party and to locate and eliminate the Straw Hat Pirates. On the island, Chopper find out that the old man has less than three days to live, due to a disease. Therefore, the next day, Sanji is making him a big dinner because of the few days he has left so that he can enjoy his last moments. At the Marine Base, they find out that the old man's name is Zenny and that he was washed ashore on the island 20 years ago with his believed huge treasure.\n",
  "characters": [
    "Minchey",
    "Nami",
    "Usopp",
    "Monkey D. Luffy",
    "Nico Robin",
    "Tony Tony Chopper",
    "Roronoa Zoro",
    "Sanji",
    "Zenny",
    "Moore"
  ],
  "ssum_frequencies": [
    [
      "an",
      2
    ],
    [
      "zenny",
      2
    ],
    [
      "after",
      1
    ],
    [
      "escaping",
      1
    ],
    [
      "from",
      1
    ],
    [
      "several",
      1
    ],
    [
      "marine",
      1
    ],
    [
      "ships",
      1
    ],
    [
      "the",
      1
    ],
    [
      "straw",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      42
    ],
    [
      "to",
      26
    ],
    [
      "they",
      13
    ],
    [
      "a",
      13
    ],
    [
      "that",
      12
    ],
    [
      "as",
      11
    ],
    [
      "he",
      11
    ],
    [
      "is",
      10
    ],
    [
      "out",
      9
    ],
    [
      "straw",
      8
    ],
    [
      "hat",
      8
    ],
    [
      "pirates",
      8
    ],
    [
      "and",
      7
    ],
    [
      "with",
      7
    ],
    [
      "on",
      7
    ],
    [
      "his",
      7
    ],
    [
      "of",
      7
    ],
    [
      "him",
      7
    ],
    [
      "are",
      6
    ],
    [
      "old",
      6
    ]
  ]
}