{
  "chapter_number": "Episode 202",
  "title": "Breaking Through the Siege! The Going Merry is Recovered!",
  "short_summary": "The crew meets at the docks and are surrounded by Marines. Using Nami as their fake hostage, they trick the Marines into letting them back on the Going Merry.\n",
  "long_summary": "The episode starts with the events prior to the arrival of Nami's group into Dock 88. Drake's men bombard Luffy's group with gun fire but he easily repels the bullets using his Devil Fruit powers. The Marines resort to using what seem like bazookas seeing that their guns are ineffective. They have fired instead, flash bombs to subdue the pirates which stings their eyes. Drake then has his Sword Unit attack the Straw Hats as they are still trying to recover from the effects of the flash bomb. The Crew are able to fight off the attacks. Luffy is then shot with a Seastone net and is instantly incapacitated. Drake demands that they surrender and tells them that while their Marine base policy is to take prisoners alive, he will not hesitate to change this policy if he is met with any resistance. With Luffy in a weakened state, Sanji, Zoro and Usopp seem to be unable to resist the overwhelming number of the Marines in the dock and consider surrendering. \nJust as the Marines are about to capture them, Nami and Dr. Kobato, with Chopper still hidden under the sheets of the hospital bed, arrive at the dock. The Marines notice that Dr. Kobato is with the pirates and hesitate to attack, asking those who just arrived to identify themselves. Dr. Kobato then pretends to be a hostage and screams in feigned terror. She hints at Nami of her plan and in turn, Nami also pretends to be a nurse held hostage by Chopper, now in his Heavy Point form. Chopper acts like a tough and ruthless pirate and demands that the Marines stand down and let them board their ship. \nDrake gives in and orders his men to stand down in return for the release of the \"hostages.\" Zoro releases Luffy from the Seastone net but Luffy remains weak. Mekao, Dr. Kobato's father, watches as this is going on. He says that while he isn't too worried about his daughter being with the pirates since he can tell if she really is upset, he is still worried that the Marines may inadvertently hurt her.\nDrake \"accommodates\" the Straw Hats and lets them board their ship, but Zoro senses another trap. He silently tells Luffy to sling them to their ship on his signal. A Marine covertly rescues Dr. Kobato and another also tries to rescue Nami, but she punches the Marine. This was their signal to rush towards the ship. Luffy slings the Crew onto the Merry. Mekao, with the safety of his daughter in mind, aides the pirates in their escape by releasing the Going Merry from the dock into the bay. Thinking that the Straw Hats are holding the \"nurse\" Nami as hostage, Drake orders them not to shoot at them, but instead to just give them warning shots. As the ship sails away, the Marines scope out the ship and notice Nami giving the crew orders and is in being held hostage. They realize that she is actually part of the Straw Hats. \nInside the base, Robin is leaving the library, as she is finished researching about the base, when she is stopped by marines. She subdues them and then makes her escape to the ship. She swings from the base onto the Merry and the Crew is finally reunited. She gives Nami a map of Navarone Island which she obtained in the library.\nThe Marines start shooting cannons at the Merry and start giving chase using warships. Nami refers to the map and sees the only way out of the base is the Sea Gate, to which they head. She notices that the water is too shallow and that the map doesn't make sense. They head to the Sea Gate anyway and try to think of a plan to open the gate. The Marines continue their barrage on the Merry while the Straw Hats don't have a way to retaliate since the Marines have confiscated all their cannon balls. Luffy devises a plan and catches all the cannon balls shot at them with his Gomu Gomu no Fusen ability and redirects them towards the gate. Just as the gate explodes, Nami realizes that if the Marines took all their cannon balls, they must have also taken the treasure they found on Skypiea.\n"
}