{
  "chapter_number": "Episode 15",
  "title": "Defeat Kuro! Usopp's Tear-filled Determination!",
  "short_summary": "Kuro battles Luffy, Jango pursues a retreating Kaya, and Zoro is faced by the strengthened Buchi. After Zoro emerges victorious, he leaves to aid Kaya, while Kuro explains his background as a pirate captain and his intentions to quit piracy.\n",
  "long_summary": "As the Usopp Pirates come to his aid and beat Kuro as he is down, but Kuro gets up and beats Usopp to the ground. Now knowing his opponent possessed a Devil Fruit ability, he decides to personally focus on Luffy, ordering Jango to pursue and kill Kaya. Although now incapacitated and no longer able to fight, Usopp orders the children to protect Kaya as she evades Jango's pursuit. Although Zoro attempts to aid Luffy, he is stopped by a strengthened Buchi. Although Buchi greatly disrupts the battlefield with his powerful attacks, Zoro uses his three swords to cut him down.\nKuro mocks Usopp for his weakness and determination to become a brave warrior, and his crew joins in the mockery. However, Luffy attacks the crew members with a boulder. With Luffy's permission, Zoro leaves the battlefield to help protect Kaya from Jango.\nLuffy continues his battle against Kuro, but Kuro evades each of Luffy's attacks using his Nukiashi technique. Although his crew members cheer on him as their captain, Kuro denounces the title, explaining his intentions to no longer be a pirate captain.\nWhen he was at sea, Kuro grew tired of being a fugitive under constant Marine pursuit, so he decided to carry out a plan. When his ship was attacked by a Marine ship, Kuro entered the ship and slaughtered every Marine onboard, save for a single soldier. Jango hypnotized the soldier and one of Kuro's own men who resembled him. Under hypnosis, the crewman believed himself to be Kuro, and the soldier turned him into the Marines. Believing him to be Kuro himself, the Marines arrested and executed him. Kuro was now free to live a more peaceful life, now only needing money inherited from Kaya.\nBack to the present day, Kuro resumes his battle with Luffy. Using the boulder from before, Luffy manages to break off all the blades on Kuro's right glove. Luffy declares that as Kuro desired to retire from piracy, his ambition was greater.\n",
  "characters": [
    "Kuro",
    "Jango",
    "Roronoa Zoro",
    "Buchi",
    "Sham",
    "Nami",
    "Monkey D. Luffy",
    "Kaya",
    "Usopp",
    "Tamanegi",
    "Piiman",
    "Ninjin",
    "Nugire Yainu (flashback)",
    "Morgan (flashback)"
  ],
  "ssum_frequencies": [
    [
      "kuro",
      2
    ],
    [
      "a",
      2
    ],
    [
      "kaya",
      2
    ],
    [
      "and",
      2
    ],
    [
      "zoro",
      2
    ],
    [
      "to",
      2
    ],
    [
      "his",
      2
    ],
    [
      "battles",
      1
    ],
    [
      "luffy",
      1
    ],
    [
      "jango",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      18
    ],
    [
      "the",
      17
    ],
    [
      "his",
      13
    ],
    [
      "kuro",
      13
    ],
    [
      "and",
      10
    ],
    [
      "a",
      10
    ],
    [
      "luffy",
      7
    ],
    [
      "him",
      6
    ],
    [
      "as",
      5
    ],
    [
      "he",
      5
    ],
    [
      "usopp",
      4
    ],
    [
      "now",
      4
    ],
    [
      "kaya",
      4
    ],
    [
      "although",
      4
    ],
    [
      "with",
      4
    ],
    [
      "from",
      4
    ],
    [
      "was",
      4
    ],
    [
      "on",
      3
    ],
    [
      "jango",
      3
    ],
    [
      "zoro",
      3
    ]
  ]
}