{
  "chapter_number": "Episode 293",
  "title": "Bubble User Kalifa! Nami Draws Near to the Soap's Trap",
  "short_summary": "Chopper in his Monster Point easily defeats Kumadori. Nami has trouble with Kalifa's Devil Fruit. Meanwhile, Luffy finally catches up with Spandam, Rob Lucci, and Nico Robin.\n",
  "long_summary": "Kumadori stands in awe at Chopper in his Monster form. He wasn’t sure what was going on, but he attempted to defeat him in the name of “Kumadori the Lion”.  However, none of his attacks affected Chopper. Finally, Chopper smashed Kumadori against the floor with a single swing of his arm.\nMeanwhile, Franky had just retrieved the key from Fukurou (who was still unconscious in the hole), only to find that it wasn’t the key needed to unlock Zoro and Sogeking's handcuffs. The key he had was Number 4, and Zoro and Sogeking’s handcuffs were Number 2. He thinks to himself, if the guy he beat has 4, and “that guy” (Kumadori) had 3, then the only person left who has the Number 2 key is “that secretary woman” (Kalifa). He’s ready to go and help.\nMeanwhile, Kalifa is taking a bath within her room, while Nami lies on the floor by the door, soaked in soap. Kalifa taunted her, saying she’s free to attack, but Nami could not move. Nami does realize that Kalifa is a Devil Fruit user, and she says that she should lose her power if her body’s at least half-submerged in water. Kalifa isn’t worried, though, since Nami has lost her power as well; she then proceeds to get out of the tub and dry off/dress up. Nami demands to know what her power is, but Kalifa, somewhat, “dared” her to try and figure it out, saying unraveling the mystery is the best part of fighting a Devil Fruit user. Nami remembers what happened to Sanji, how he became all smooth and shiny. Soon, Nami’s power gradually returned, and once her power was back, she attacked Kalifa with Thunder Charged Climate Tact, but Kalifa simply used Soru to move out of the way. However, what Kalifa didn’t realize was that there was a cloud formed above her. Nami then attacked with Thunderbolt Tempo, and lightening struck Kalifa where she stood.\nHowever, when the dust cleared, Nami only saw a large bar of soap with CP9 labeled on it. Kalifa had encased herself within the soap to protect her. Nami, surprised, wonder how she did it, but Kalifa again, egged her on to try to figure it out. Thinking it through, Nami questioned if she was a “soap-woman” who ate the “Awa Awa no Mi” (Bubble Bubble Fruit), or something like that. Caught off guard, Kalifa stuttered as she said that even if she did know her power, she still doesn’t have a chance of winning (she probably wasn’t expecting her to actually figure it out). She then admitted that she was correct; she did eat that fruit, and she has the power to create bubbles (causing Nami to accidentally blurt out that would like to have Kalifa as her secretary, before remembering they are both women). She then proceeded to show off her power by using the bubbles from the bathtub to form Soap Sheep (using her arms as horns). Then she used Hitsuji-Gumo Relax Awa to attack Nami by shooting the bubbles at her. It was at this time Kalifa brought up why Nami lost her power when she entered the room. It was then Nami realized that the floor was covered with bubbles, and that it was the bubbles that caused her to lose her power. One cloud of bubbles hit Nami, clinging to her as she fell to the floor. She began to lose her strength as Kalifa approached her and kicked her towards the wall. However, this caused the bubbles that were attached to Nami to come off, so she used this opportunity to attack with Thunder Ball. However, Kalifa once again used Soru to sneak up behind her.\nOnce behind Nami, she used Golden Awa (Golden Bubble, “awa” also being a pun on “hour”) and began to rub her legs, producing soap as she did so. This made them smooth and shiny, and caused Nami to collapse. Kalifa explained that she can smooth out anything she touched into a nice shine. Though it frightened Nami, Kalifa acted, though, as if it were a good thing, giving her opponent perfectly smooth skin; she further states that she will not stop until Nami's entirety falls under her power's influence.\nMeanwhile, back in the kitchen, Kumadori was badly beaten and bruised, barely able to stand. Chopper did not have a single scratch on him. Chopper raised his arm for another beating. Kumadori used Tekkai, but it was no use. Meanwhile, on the outside, Franky just scaled the wall and reached the level where the kitchen was. There was a huge bang, and Chopper walked up, dragging Kumadori by the head. Franky was shocked to see Chopper like this, and perhaps just as much to see Kumadori beaten so badly. Chopper then tossed Kumadori all the way over to the Courthouse like a rag doll. Franky didn’t even recognize Chopper at first, but then he saw the hat Chopper always wears. When he asked him if he was the same person, Chopper attacked Franky. Meanwhile, over at the Courthouse, many Marines and Government officials were shocked to see that Kumadori had been tossed all the way from the Tower of Justice. Back at the Tower of Justice, Franky lay flat on the ground, wondering what the hell is going on, while Chopper climbs up the side of the tower.\nMeanwhile, in a long tunnel leading to the Gates of Justice, Robin hears chopper howls and stops for a moment. Rob Lucci stops and looks back at her, then Spandam, who tells Lucci to drag Robin along. Spandam then tells her that there’s no way “those lousy pirates” can save her. They are almost at the Bridge of Hesitation, which leads directly to the Gates of Justice. Once she’s beyond the gates, the only thing she will feel is the pain of her sins; the sin of living until that day. He then proceeds to laugh in her face and continue onward, until Luffy yells out “ROBIN!” so that the entire tunnel could hear him. Robin looked back, smiling that Luffy has come to rescue her. Lucci gave an evil grin, showing that he’s been waiting for Luffy to arrive. Spandam began to panic, sputtering like crazy until Lucci calmed him down. He told Spandam to take Robin and continue to the Gates of Justice. Luffy, in the meantime, arrived at another door, although this one was wooden, unlike the last one. He easily broke through it, and found none other than Lucci waiting for him on the other side. \n"
}