{
  "chapter_number": "Episode 250",
  "title": "The End of the Legendary Man! The Day the Sea Train Cried",
  "short_summary": "Tom's Workers were arrested for the attack on the judicial ship. Franky said that if a ship of his were to be used as a weapon, then it is no longer one of his ships. That enraged Tom and he punched Franky for the first time, telling him he had to take pride in the ships he created. He then told the judge that he would accept the punishment for his previous crime and asked to be pardoned for the recent attack so Franky and Iceburg would not go to Enies Lobby. But Franky got angry and hit Spandam with a gun, disfiguring his face, and ended up wanted anyway. Franky then tried to stop the train to Enies Lobby with his bare hands but ended up getting run over.\n",
  "long_summary": "In the main square of Water 7, Zoro is still seen running across the rooftops but finds himself to be lost. Somewhere else, Luffy can be seen trying to free himself after getting stuck between some walls yet again. Zoro spots the burning building and runs toward it but ends up getting blown down by the wind. Meanwhile, Kokoro can be seen watching the fire from afar.\nBack to eight years ago, Iceburg is still yelling at Franky saying he will never forgive him. Suddenly, Tom speaks up telling Iceburg not to blame Franky as he didn't do this. Franky runs over to Tom and notices a harpoon stuck in him saying that it's one of his special harpoons that is difficult to pull out once it gets stuck in. Franky apologizes to Tom but Tom says not to as it's not a problem to him. Soon, the people of Water 7 spot Tom, Iceburg, and Franky but are shocked to see that they're the ones injured as they think that Tom is the reason for the attack. Spandam with his CP5 agents appear behind them and Spandam says it's the time where all of them come quietly.\nIn town, Tom, Iceburg, and Franky are all handcuffed while Spandam explains that they are the ones that attacked the Judicial Ship and he and his CP5 agents managed to stop it in time. Some people wondered why Tom would do that as the judge would've acquitted his last offensive for building the Oro Jackson for Gold Roger thanks to him building the Sea Train Puffing Tom. Spandam walks up to Jorge where the two shake hands with the latter thanking Spandam for stopping the attack. Spandam says he'll take over the investigation and thinks to himself saying he's close to getting the blueprints for Pluton. Kokoro and Yokozuna are worried for Tom and the others.\nJorge then speaks up thanking Tom for building the Sea Train stating that Water 7 will continue to build but asks why Tom would attack the Judicial Ship. Franky speaks up saying it wasn't Tom but Spandam. However, the people all start laughing thinking that someone from the World Government wouldn't do something like that. Spandam then speaks up saying that the raid ships were created by Franky himself. Franky says that ships that do such a horrible thing aren't his ships anymore. Angry at his comments, Tom breaks free of his handcuffs and punches Franky much to the shock of everyone. Tom tells Franky that when a ship is built, no matter what type, it's neither good nor evil. He continues saying even if the ships hurt someone or could even destroy the world, the one who created them should never deny making them and never place the blame on the ships. Everyone, including Jorge and Spandam, stare in shock at Tom's comments and Tom tells Iceburg and Franky that whatever happens, not to interfere. Tom then violently punches Spandam causing horror to everyone. Tom continues to attack Spandam but Spandam orders the Marines and CP5 to shoot at Tom. Tom kneels down from the pain with Franky worried for him.\nSpandam is pleased that Tom has been shot while Franky wonders why Tom did that. Spandam then orders his CP5 agents to arrest Tom, Iceburg, and Franky saying they'll be going to Enies Lobby. The people are shocked saying they didn't know that Tom would be so dangerous and the other people continue to talk down Tom much to the anger of Franky. Tom calms Franky down and suddenly speaks up saying he would like to confess. Tom then says that the raid on the judicial ship was led by him but requests to be pardoned from that crime. Jorge says that even if that was possible, Tom will be charged again for building the ship for Gold Roger and will receive the maximum penalty (death). Tom agrees to this saying he was proud of building a ship for the King of the Pirates Gold Roger much to the shock and anger of the people. Franky wants to know why and Tom tells Franky it's for the best not knowing the World Government would go to extreme lengths just to get the blueprints. Tom says that Water 7 is alive now saying he was glad to help out the city. Tom says his dream has finally begun to run and passes out from the tranquilizer's effects. In his mind, Tom tells Iceburg and Franky to take care of the blueprints and thanks everyone else (Kokoro and Yokozuna) for everything.\nSpandam is excited to see that the tranquilizers have taken effect and orders his group to capture Tom, Iceburg, and Franky. However, Jorge says that Tom alone will be taken to Enies Lobby much to the annoyance of Spandam. Spandam then orders for Iceburg and Franky to be let go while the Marines are preparing to take Tom away. Kokoro tearfully says that Tom can't be let go as he sacrificed himself to save Iceburg and Franky. She continues on saying that anyone that has been taken to Enies Lobby has never come back and Franky's rage suddenly explodes. Franky grabs a pistol from a Marine and smashes Spandam's face with it. The people are horrified by this and Iceburg, Kokoro, and Yokozuna are shocked by what Franky just did. Franky is then shot by a Marine and Iceburg tells Franky to run away. Franky manages to get away and, on board the Sea Train now, Spandam is angry that Franky got away. Soon, Spandam is notified that Franky is on the tracks and orders the Sea Train to keep going. Franky tells Yokozuna to stay away while he fires at Puffing Tom telling it to not take its creator away. With the blasts having no effect, attempts to stop the Sea Train himself and remembers how Tom let him stay with him. Franky says he wants to continue building ships but can't love ships that hurt people. However, he would want to be a great shipwright like Tom and Franky is soon run over by Puffing Tom. In his mind now, Franky says he will build his own dream ship that will proudly sail upon the waters.\nBack to the present, Rob Lucci says he heard that Tom was a great shipwright but was an uncontrollable Fish-Man with superhuman strength and has asked the citizens if they knew Tom but has gotten blank replies. Franky doesn't want to talk to Lucci anymore (with Usopp trying to calm him down) and Lucci says that many people and Marines were injured just because of Franky. However, due to Franky being confirmed dead after the Sea Train accident, the charges were dropped but now Franky is alive, he will be taken to Enies Lobby. Blueno, with a Den Den Mushi, walks up to Franky while Lucci speaks saying that their superior wants to speak to him. As Blueno tells the \"chief\" to speak, the man says he has spilled coffee on himself. However, he soon gets serious but is surprised to hear from Franky again. The man is surprised to see that Franky is still alive but Franky doesn't recognize the voice. The man continues saying how for eight years, his scars have been hurting but Franky demands to know who is talking to him. The man turns out to be Spandam saying he is the same person who arrested Tom's Workers years ago.\n"
}