{
  "chapter_number": "Episode 223",
  "title": "Zoro Sharpens His Fangs! A Fight With a Wild Beast!",
  "short_summary": "On their way to \"The Palace of the Sea God,\" Robin's group meets an entranced Zoro. It appears that Zoro wants to fight, so Luffy urges the others to keep going without him. They apprehend the boy that they had believed had stolen their memories. However it is revealed that the seahorse was really stealing their memories. Zoro returns, still entranced, but Luffy is nowhere to be seen.\n",
  "long_summary": "The Straw Hats travel through the forest to find the Palace of the Sea God. Usopp and Chopper are chased by a snake. After losing the snake, they become separated from the others. They also run into Zoro, who awkwardly ignores them. However, when Zoro finally sees Luffy, he attacks Luffy using his swords. The Straw Hats believe that Zoro was hypnotized.\nLuffy tells the others to go ahead to the temple, while he stayed behind to battle Zoro. Zoro defeats Luffy with an Oni Giri move. Meanwhile, on the way to the Palace, Nami tells the Straw Hats that Luffy and Robin are lying to them, and that they should go home. However, the Straw Hats decide to stay with Robin, and they leave Nami behind. Nami, however, decides to follow the Straw Hats to reclaim her gold. Back in the forest, Zoro and Luffy continue to engage in the fight.\nUpon arriving at the Palace, Robin explains that there is a legendary monster that would feed on others' memories to survive, and that the monster resided in the island. Nami and Usopp try to reach the Straw Hats, but are approached by the cloaked boy. Sanji leaps into the air and kicks the boy, causing the seahorse horn to release the Straw Hats' memories and also play a sound. Because the boy was briefly unconscious from the kick, he lost his memories. The boy, confused as to where he was, flees.\nRobin explains that the real thief was the seahorse horn. It tries to flee, but is caught by Sanji. Sanji beats the seahorse until it coughed up the Straw Hats' memories. Having regained their memories, they wonder if Zoro has regained his memories. Zoro approaches them, and Sanji is prepared to fight him. The seahorse communicates via Chopper that it still had its last resort.\n"
}