{
  "chapter_number": "Episode 155",
  "title": "Sacred Ground!The Island Where God Resides and Heaven's Judgment!",
  "short_summary": "Nami finds out what will happen to anyone who enters the forest. Meanwhile, the rest of the gang are waiting for the wind to change but are rudely assaulted by Skypiea's police who are going to carry out Heaven's Judgment.\n",
  "long_summary": "Conis begins by explaining that since Skypiea is also known as God's Land, it is ruled by almighty God Enel. She further says that God Enel knows everything that goes on in the world by always watching them. The Straw Hats are surprised when Conis tells them that God is watching them at the present time. Zoro comments on how he does not believe in the entity called - God and he holds nothing against those who believe. Sanji asks Conis if she has ever seen the God and Conis replies saying that she has never seen the God because Upper Yard is forbidden to enter.\nNami arrives at a place and comments with surprise that there is \"earth\" even on Sky Island. Luffy becomes excited when he hears that the Upper Yard is a place that is forbidden. He goes on to ask Conis if the God would forgive anyone who goes in there and Conis responds that she does not know. Robin asks for the consequences of visiting the Upper Yard and Pagaya states that they are sure such a person would not come back alive. Pagaya then asks if they were worried about Nami and Luffy responds in an excited manner that they would have to go to Upper Yard to get Nami. Meanwhile, Nami is amazed at the size of the trees seen at where she is currently located. She then hears voices talking about how they were going to get some treasure. Nami indicates to herself that people are present there and follows the trail of the voice.\nThe rest of the crew decide to go in search of Nami. While Luffy is trying to consume as much food as he can, Sanji inquires from Conis how to get to the Upper Yard. Conis responds that they aren't sure Nami went there and by going there they could receive the wrath of God Enel. On reaching the trail of the voice she heard, Nami arrives at a place and sees a waver. While looking around, a bird flies on a shell and presses it down before flying away. At that point, voices come out of the shell and Nami understands that the shell could record voices. After listening to the event that had been recorded by the voices, Nami understands that the people were killed by the God. She tells herself that she needs to go back and the farther away she got from her current location will be the best.\nAt that instant, she hears a loud noise and sees a man running while being chased by someone else. The Straw Hats have boarded their ship to go in search of Nami. The man running is seen to be chased by one of the priests of the Upper Yard. As he is about to be eaten by the dog belonging to the priest, another priest flying on a bird kicks the dog and goes after the man. A third priest joins the pursuit and the man now has three priests chasing after him. Nami, back on her waver, tells herself that there is something going on in the forest. Luffy decides to take the old waver to go in search of Nami since Pagaya told them they cannot sail because the wind is not favorable. Luffy ends up sinking and is rescued by Zoro. Pagaya examines the waver the Straw Hats brought and offers to fix it if it is fixable while being a dial ship engineer.\nWhile Nami is watching, the priests are arguing amongst themselves who gets to kill the man when a man in a mask and bazooka appears behind Nami and fires it towards the priests. While before Nami, the man being chased appears and begs to join her on her waver. She responds that only one person could fit, but he threatens to kill her and get the waver. At that point, he got struck by a mass of lightning and he cries \"God\". Nami then overhears the priests talking about illegal entrants and she remembers Amazon telling them to pay the immigration toll. She hurries back to tell the rest of the crew about the event that occurred.\nJust as Luffy is imploring Pagaya to fix their waver, they see some men telling them to wait and later crawling towards them. Usopp says they may be crawling because they are perverts and Chopper states so that is what a pervert is like. While the White Berets exchange greetings with Conis and her father, Luffy is still baffled as to what they are speaking. McKinley, Captain of the White Berets then tells the Straw Hats that they are there to bestow the Heaven's Judgment on them.\n",
  "characters": [
    "Monkey D. Luffy",
    "Tony Tony Chopper",
    "Conis",
    "Sanji",
    "Nico Robin",
    "Usopp",
    "Roronoa Zoro",
    "Nami",
    "Pagaya",
    "Ohm",
    "Zabo",
    "Holy",
    "Fuza",
    "Shura",
    "Satori",
    "Wyper",
    "Gedatsu",
    "McKinley",
    "Amazon (flashback)",
    "Su"
  ],
  "ssum_frequencies": [
    [
      "the",
      4
    ],
    [
      "to",
      3
    ],
    [
      "are",
      3
    ],
    [
      "out",
      2
    ],
    [
      "who",
      2
    ],
    [
      "nami",
      1
    ],
    [
      "finds",
      1
    ],
    [
      "what",
      1
    ],
    [
      "will",
      1
    ],
    [
      "happen",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      57
    ],
    [
      "to",
      29
    ],
    [
      "and",
      26
    ],
    [
      "that",
      25
    ],
    [
      "is",
      21
    ],
    [
      "nami",
      17
    ],
    [
      "a",
      16
    ],
    [
      "of",
      15
    ],
    [
      "she",
      14
    ],
    [
      "they",
      12
    ],
    [
      "by",
      11
    ],
    [
      "on",
      11
    ],
    [
      "god",
      10
    ],
    [
      "conis",
      9
    ],
    [
      "in",
      9
    ],
    [
      "he",
      9
    ],
    [
      "them",
      8
    ],
    [
      "at",
      8
    ],
    [
      "are",
      7
    ],
    [
      "there",
      7
    ]
  ]
}