{
  "chapter_number": "Episode 87",
  "title": "Against Wapol's Army Corps! The Abilities of the Baku Baku no Mi!",
  "short_summary": "Wapol is determined to bring down Hiriluk's flag, and to do that, he engages Sanji, Luffy, and Chopper in a fight.\n",
  "long_summary": "Chess lets Wapol know of the flag on top of Drum Castle. Luffy uses Gomu Gomu no Pistol on Wapol, sending him flying, but he is rescued by his subordinates just when he is about to fall down the mountain. As Luffy goes into the castle to find warm clothes, Sanji protects Kureha from an afro thrown by Kuromarimo. Kuromarimo keeps throwing afros at Sanji, even though they pose no apparent danger, they stick to their foes by static, so when Chess fires an incendiary arrow, the afros start a fire. Luffy borrows Nami's jacket and with the help with Sanji, they throw an attack at Wapol. The former king, displeased, turns himself into Baku Baku Factory and eats Chess and Kuromarimo. He then releases Chessmarimo and shoots the Jolly Roger of Hiriluk. Luffy is able to catch the flag and raises it again with the help of one of the sleeves of Nami's coat. Wapol shoots him again but he does not flinch, leaving the flag waving.\nIn this episode, the importance and the symbolism of the Jolly Roger is emphasized, at least from an idealistic perspective. Luffy protects Hiriluk's flag, saying it is a symbol of faith and a pledge to risk one's life.\n",
  "characters": [
    "Monkey D. Luffy",
    "Chess",
    "Wapol",
    "Kuromarimo",
    "Robson",
    "Tony Tony Chopper",
    "Kureha",
    "Sanji",
    "Hiriluk (flashback)",
    "Dalton (flashback)",
    "Nami",
    "Chessmarimo"
  ],
  "ssum_frequencies": [
    [
      "to",
      2
    ],
    [
      "and",
      2
    ],
    [
      "wapol",
      1
    ],
    [
      "is",
      1
    ],
    [
      "determined",
      1
    ],
    [
      "bring",
      1
    ],
    [
      "down",
      1
    ],
    [
      "hiriluks",
      1
    ],
    [
      "flag",
      1
    ],
    [
      "do",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      14
    ],
    [
      "of",
      8
    ],
    [
      "and",
      7
    ],
    [
      "luffy",
      5
    ],
    [
      "is",
      5
    ],
    [
      "to",
      5
    ],
    [
      "wapol",
      4
    ],
    [
      "flag",
      4
    ],
    [
      "he",
      4
    ],
    [
      "an",
      4
    ],
    [
      "chess",
      3
    ],
    [
      "by",
      3
    ],
    [
      "sanji",
      3
    ],
    [
      "kuromarimo",
      3
    ],
    [
      "at",
      3
    ],
    [
      "they",
      3
    ],
    [
      "a",
      3
    ],
    [
      "with",
      3
    ],
    [
      "on",
      2
    ],
    [
      "castle",
      2
    ]
  ]
}