{
  "chapter_number": "Episode 62",
  "title": "The First Obstacle? Giant Whale Laboon Appears",
  "short_summary": "Upon entering the Grand Line, the Straw Hat Pirates, helpless because of their broken helm, are promptly swallowed by a giant whale named Laboon. Luffy gets separated from the rest of the crew, and the Straw Hats find some very odd structures inside the whale, as well as that they are not alone in their predicament.\n",
  "long_summary": "The episode opens with the Straw Hat Pirates riding down Reverse Mountain into the Grand Line, when they are suddenly engulfed in a fog, but they didn’t seem to mind. Just then, Zoro hears a strange noise, though Nami says it’s probably just the wind. Then Sanji claims he sees a mountain at the end of the path they were heading down. However, when the fog clears, they find out that it wasn’t a mountain; it was a huge whale! At the rate they were going, they’d hit it straight on and crash. Zoro tells them to try to head for an opening off to the left, but Usopp says that the helm is still broken from before they arrived at the mountain. Zoro heads over to help, but then Luffy gets a \"good\" idea, and heads down below deck. Meanwhile, Zoro, Usopp, and Sanji are all trying to pull the helm in the direction they want to, but it won’t budge. They were all about the crash… When suddenly, Luffy fires a cannon! While everyone is shocked, Luffy asked if they stopped. While it did slow down, the ship still crashed into the whale, but the only thing broken was the head, to which, Luffy was outraged (it was his special seat).\nAll the while, the whale didn’t react at all. Zoro yelled out to make a run for it while it still didn’t notice them. While they were rowing past its eye, Luffy, in a burst of fury, punched it directly in the eye. After a few seconds, the whale finally looked down at them. Luffy kept shouting out how he’ll kick its ass, the rest of the crew kept telling him to shut up. The whale then began to suck in the water around its mouth, and with it, the Straw Hats. Luffy fell overboard, but grabbed onto one of the whale’s teeth before he could hit the water. He then began to climb up the whale, as the rest of the crew was swallowed alive. Luffy, who was now sitting on top of the whale, began pounding it and telling it to let his friends go, but the whale was beginning to submerge underwater. Luffy began yelling louder and louder, until he finally noticed a door on top of the whale…\nMeanwhile, the rest of the crew found themselves… in front of a small island in the middle of green waters, with a clear blue-sky overhead. Suddenly, a giant squid pops up out of the water, but someone (or something) that was apparently living on the small island quickly killed it. Nami wanted to go home, and Usopp wished Luffy were there; \"he’d know what to do\". Nami then began to wonder what happened to him; at the same time, Luffy found himself in some sort of passageway, very confused. Back at the small island, someone walked out of the house on the island, and revealed himself to be an old man.\nThe Straw Hats stared at the old man, and the old man stared back, as he pulled in the giant squid and started to walk over to a chair and began to read the newspaper. Sanji yelled at him, telling him to say something. Usopp then spurted out that they'd give him a fight he wanted. Suddenly, a few dramatic shots are shown, and then the old man suggests not to fight, otherwise someone would have died. Nami and Usopp panicked at this, though Zoro and Sanji looked calm. Then Sanji questioned who would be the one dying, and the old man simply replied that he would be the one. Sanji started getting very frustrated with the old man, but Zoro calmed him down, and tried talking to the old man, himself. He asked him where they were and who was he. Suddenly, the same dramatic sequence happened again, and the old man replied by saying if they want to know something about someone, it’s only proper to introduce one’s self first. However, before Zoro could introduce himself the old man already said his name was Crocus, he is the keeper of the Twin Capes Lighthouse, he’s 71 and a half years old, a Gemini, and his blood type is AB. With this, Zoro got frustrated, too.\nCrocus then goes on to say that this is his \"one-man resort\", and that they were saying such rude things to him. Usopp, again, questions if they are really in a whale’s belly. Nami begins to panic, again, for worry of being digested. Crocus then begins to go through the dramatic sequence, again, but the Straw Hats tell him to stop doing that, and Crocus ask them to appreciate a good running gag. He then points out an exit doorway, to which, the Straw Hats find strange; what is a giant door doing in a whale’s stomach? And why is it on the sky? It was then that they realized that the scenery was painted on. Crocus admitted that was his doing, and he liked having fun, to which Usopp started getting annoyed with him.\nThen suddenly, everything started to shake and rock around, with Crocus saying that \"it\" started. It was then Nami noticed that the island was actually made of iron, and chained down. Usopp asked what started and Crocus replied that the whale, Laboon, has started to ram against the Red Line. Nami then came to the realization that the whale is in pain, remembering that it has many scars on it, and it bellowed into the sky. Usopp and Nami then came to the conclusion that Crocus might be trying to kill the whale from the inside out, Zoro, however, says that they should just get out of there, before the ship dissolves. Meanwhile, elsewhere inside the whale, two mysterious individuals were sneaking around carrying guns…\nThe Straw Hats tried to reach the doorway, but the waves were too big. Just then, Crocus dived into the liquid, and began swimming off deep into the stomach. Meanwhile, Luffy was beginning to get knocked around with the whale ramming into the mountainside. He then fell into a tunnel, with possibly the same liquid flowing between two walkways. While Luffy was questioning what it could be, the tunnel slanted downward, and Luffy fell, yet again. Meanwhile, back with the two individuals from before, who revealed themselves to be Mr. 9 and Miss Wednesday, Mr. 9 commented that their infiltration so far has been a complete success. They stand on the other side of the same doorway, Mr. 9 saying that they need to eliminate the \"old geezer\", for the whale’s sake. Miss Wednesday agreed, saying that their town needs the whale.\nMeanwhile, on the other side of the door, Crocus emerged from it, and began climbing up the side of the whale’s stomach. Back on the other side, Mr. 9 and Miss Wednesday were about to get through, when Luffy fell on top of them, and they flew through the doorway and fell into the digestive juice. Meanwhile, Crocus walked off to the disclosed area, where he kept a gigantic needle filled with sedative, and injected some into the whale in order to make him stop. While he says this, he \"talks\" to the whale, saying no matter how hard he hits the wall, he won’t break through it.\nMeanwhile, back with the Straw Hats, they saved Luffy, along with the two individuals, and Zoro asked who they were. Crocus then entered the stomach again, telling the two that they won’t lay a finger on Laboon (the whale). The two said that killing the whale was their mission, and they won't let him interfere anymore. They immediately shot two cannonballs from their bazookas, in order to rip a hole in the whale's stomach, but Crocus ran over and took the cannonball dead on. The two began to laugh at him, saying that they’ll kill the whale to feed their town, when Luffy suddenly knocked them both out cold, saying he just had to hit them.\nLater on, Crocus thanked Luffy for helping him, but Luffy said he didn’t help; he just didn’t want to see that happen. Nami asked who those two were and what they were doing inside the whale. Crocus explained that the two were from a nearby town, and they want the whale’s meat, saying that Laboon (the whale) could feed their town for two to three years. He also explained that Laboon is an Island Whale, which inhabit the West Blue and are the largest species of whale in the world. He also says there’s a reason why he keeps bashing his head against the Red Line, and why he bellows at the mountain. He explains that he is a whale with a heart like a person, and the episode ends with him has been waiting for a certain group of pirates for 50 years…\n",
  "characters": [
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Nami",
    "Sanji",
    "Usopp",
    "Laboon",
    "Crocus",
    "Miss Wednesday",
    "Mr. 9"
  ],
  "ssum_frequencies": [
    [
      "the",
      6
    ],
    [
      "straw",
      2
    ],
    [
      "of",
      2
    ],
    [
      "their",
      2
    ],
    [
      "are",
      2
    ],
    [
      "whale",
      2
    ],
    [
      "as",
      2
    ],
    [
      "upon",
      1
    ],
    [
      "entering",
      1
    ],
    [
      "grand",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      123
    ],
    [
      "to",
      54
    ],
    [
      "and",
      45
    ],
    [
      "a",
      34
    ],
    [
      "that",
      29
    ],
    [
      "he",
      27
    ],
    [
      "they",
      26
    ],
    [
      "whale",
      24
    ],
    [
      "of",
      23
    ],
    [
      "it",
      23
    ],
    [
      "then",
      20
    ],
    [
      "luffy",
      19
    ],
    [
      "was",
      18
    ],
    [
      "in",
      16
    ],
    [
      "on",
      16
    ],
    [
      "with",
      15
    ],
    [
      "him",
      15
    ],
    [
      "crocus",
      15
    ],
    [
      "were",
      14
    ],
    [
      "but",
      13
    ]
  ]
}