{
  "chapter_number": "Episode 174",
  "title": "The Vanished City! The Magnificent Ruins of Shandora!!",
  "short_summary": "While Robin is exploring the ruins, she comes in contact with Yama, the Chief Enforcer, who attacks her but is defeated. Later, Robin discovers the legendary city, Shandora.\n",
  "long_summary": "Conis, Pagaya and Aisa are aboard the Going Merry and Pagaya has given Nami the refurbished Waver which Nami test drove and commented on it being power-packed. Pagaya questioned what to do since some of the crew members were not aboard, so they could not be led out of Skypiea by Pagaya and Conis. Nami stated she needed to take the ship to their point of rendezvous and since the four are together, she is not so worried. Aisa then told her that there is no group bigger than two at Upper Yard or else she would know. Nami attributed the response to Aisa's ability of Mantra.\nLuffy is still attempting to make his way out of the \"cave\" and is very much hungry. He wondered if the rest of the exploration crew had found their way to the City of Gold. Zoro decided to take a break and eat lunch when a Skypiean Southbird arrived. The bird was interested in Zoro's meal and although he finishes the meal without offering the bird any, the bird continued to follow him. Enel, still in the survival game, is determined to ensure that only five people are remaining by his predicted time of three hours.\nRobin and Yama are engaged in battle. Robin, trying very hard to ensure the monument in the ruins are kept intact, protects it using Veinte Fleur: Calendula. However, Yama knowingly wants them destroyed. Robin chastised Yama for knowingly destroying the ruins which only angered him more. As a result, Robin decided to lead him out of the ruins, then she can counterattack. Once out of the ruins, Robin informed Yama she would battle freely with him without any obstacle. Yama launched his Drop Mountain which Robin countered with Treinta Fleur: Pound. Yama enraged, then tried to attack with axe Mountain but Robin turned the dials inward and trapped him, making him take on his own attack. Robin then chastises him and uses the Cien Fleur Delphinium: Clutch to attack and defeat Yama. Robin continued on her exploration of the ruins and had a flashback of the past events that took place at Arabasta.\nRobin continues to explore the ruins and finds that it had a lower level hidden beneath. As she went further, Robin discovered that the City of Shandra, thought to have been destroyed 800 years back, still has some intact parts of it within the lower level hidden beneath the upper ruins. Alas, Robin found the City of Gold, Shandra, and started walking further only to find a Poneglyph. Robin then commented that all scholarly books were eradicated which also meant the history of Shandra as well.\nNami is still worried about the exploration crew, wondering if they are alright. Zoro is still being followed by the Skypiea Southbird and Luffy is still trapped in the \"cave.\" Robin then stated that the City of Gold, Shandra, must have fought to protect the Poneglyph and was destroyed. She then indicated that the Great Belfry between the four altars could tell the True History; it may be the Rio Poneglyph.\n"
}