{
  "chapter_number": "Episode 173",
  "title": "The Invincible Ability! Enel's True Nature Revealed",
  "short_summary": "Enel has joined in the survival game and defeats Kamakiri, several Shandia and his own Divine Soldiers alike with his power. Nami and Gan Fall defeat Hotori and Kotori. Conis and Pagaya rescue Aisa and make contact with Nami.\n",
  "long_summary": "Kamakiri and another Shandia warrior are seen getting close to the Shandra Ruins and the Giant Stalk when suddenly, Enel appears. Enel commented on Kamakiri's thoughts about him being there. Kamakiri responded, attributing it to Enel's Mantra. Enel disproved saying it is written all over Kamakiri's face and normally he would not be there but he is also a participant of the Survival Game. Enel then challenged Kamakiri telling Kamakiri he would not fight him for five minutes, and Kamakiri is free to do what he pleases to Enel. However, once the five minutes is up, he would fight Kamakiri. On that, Kamakiri began his attack on Enel.\nNami and Satori's brothers have began their fight aboard the Going Merry. The brothers were kicking about the unconscious Sanji and Usopp which got Nami very angry. She went ahead to hit one of them with her staff and was attacked with a Flavor Dial with the flavor of farts. Gan Fall after observing the brothers was able to tell the number of dials they were fighting with. On knowing that, Gan Fall began his attack on them, so did Nami. Gan Fall was attacked with a Breath Dial which he dodged and went ahead to fight and defeat Kotori. Nami then knocked Hotori away using the Cyclone Tempo. Gan Fall instructed Nami to fetch and use his gauntlet, which has an Impact Dial embedded in it to fight Hotori because he will be returning. Nami launched a Cool Ball on Hotori, to which he got upset and used his flame dial as a counterattack which only helped foster Nami's attack. Nami then launched Fog Tempo to obscure herself and launch an Impact on Hotori, which defeated him.\nConis, Aisa and Pagaya are on their way to the Straw Hat Pirates ship. Aisa is very scared commenting that voices of people keep disappearing. Gan Fall decides to go after Enel and Nami is upset he is leaving her alone on the ship. Just as Gan Fall left, Nami was about to begin first-aid treatment on Sanji and Usopp when Conis and her father arrived. Pagaya explained to her that they need to escape using his Milky Dial onto the White-White Sea and leave Skypiea. Pagaya also gave her the waver they had brought with them, all refurbished. \nThe battle continues between the Shandia warriors and the Divine Soldiers and Kamakiri is still on his five minute allowable time to fight Enel without Enel counterattacking. Kamakiri eventually realizes and tells Enel that he cannot defeat Enel. Enel went on to explain that he is that referred to as God since his powers cannot be explained, therefore he is feared. Kamakiri decides to flee and warn Wyper about Enel's abilities, however, Enel cornered him stating that his five minutes are up and now he can counterattack. Enel then defeated Kamakiri using the 1,000,000 volts Vari. The attack traveled through the Milky Road and defeated 20 other fighters, Shandia warriors and Divine Soldiers alike. Enel then summarized that after two hours of battle at the Upper Yard with 81 people beginning the battle, 56 have been defeated, 13 remain from his army, 5 from the Straw Hat crew and 7 Shandia warriors making a total of 25 people remaining, per his calculation. He then wondered, who would be accompanying him.\nLuffy found a necklace made out of gold and wondered if the City of Gold was in the \"cave\" where he was at. He threw the necklace away after his stomach grumbled indicating his hunger. Still, unable to make out his current environment, he asked himself \"Where am I?\"\n"
}