{
  "chapter_number": "Episode 181",
  "title": "Ambitions of Fairy Vearth - The Ark, Maxim!!",
  "short_summary": "Enel defeats Zoro and Wyper. Upon seeing this, Nami follows him to a cave where his ark, Ark Maxim, is. Luffy finally gets out of the python, along with Aisa, only to find out the outcome of the fight against Enel. When Aisa tells him that she knows where he is, he asks her to take him there.\n",
  "long_summary": "In a flashback, the Shandia Chief is shown talking to a young Wyper and other young warriors telling them about the words inscribed on the Poneglyph and how the Shandia fought hard to protect the Poneglyph. Wyper was able to use the Seastone and Reject to attack Enel, which stopped Enel's heart. However, moments later, Enel was able to use his ability to reset the electrical waves in his heart thereby reviving himself. Enel indicated he warned Wyper initially, calling him Warrior Wyper several times which only angered Wyper who told Enel not to call his name without a reason. He told Enel that after 400 years of fighting to get to their homeland of Shandia, they are finally here and Enel is in the way. Enel commended Wyper for putting on a good fight but told him, he chose his opponent \"poorly.\" With that, Enel struck one of his drums with his staff, and got an electrical discharge of 30,000,000, which appeared in the form of a bird and attacked Wyper with Uroquois, which defeated Wyper. Zoro used the opportunity to pick up the Seastone, however, Enel attacks and also defeats Zoro using Kiten.\nEnel walked towards Nami who was the only unhurt person around and realized Wyper has got back on his feet. He questioned why Wyper still wants to fight after he's been sorely defeated. Wyper responded that he fights for his ancestors. Noting that he was hoping for a better answer, Enel struck Wyper using El Thor. With Nami left, she told Enel she would like to go with him to the Land of Dreams. Nami, taking her waver along, went along with Enel and had in mind to escape once the opportunity arises. Reaching their location, Nami was amazed by what she saw and Enel told her the flying ship is the first of its kind in the world. He told her he had used the gold from the City of Gold to build the Ark - Maxim. With the ark, he told her they would travel to a place with boundless land - Fairy Vearth.\nLuffy, Aisa and Pierre finally made it out of the snake's stomach only for Luffy to run up the ruins and yell at the top of his voice that he made it out. Aisa upon seeing their current location, came to a conclusion that where they are at could be their homeland, Shandora. Looking around, Luffy spotted his crew and ran towards them only to realize that they have been defeated, including Zoro. Luffy questioned who must have done such a deed after seeing that even Wyper, who is strong, is defeated. Aisa mentioned that it was only Enel who could do something like that. Since her Mantra was ineffective while stranded in the belly of the snake, she was unable to tell what was occurring on the outside. Just then, Robin regained consciousness and told Luffy of Enel's intention in destroying all of Skypiea. Luffy inquired about the Golden Belfry and Robin told him the possibility of Enel getting to it. Aisa then told Luffy she knows their location as she is able to \"hear\" two voices on the island of their location. Luffy then told Aisa to take him to the location of the voices.\n"
}