{
  "chapter_number": "Episode 191",
  "title": "Chop Down Giant Jack! The Last Hope of Escaping",
  "short_summary": "Nami finds a way to get to Enel by cutting down Giant Jack. Wyper finds out from Nico Robin that Mont Blanc Noland has a descendant that is searching for the Gold City, and that's the reason why Luffy wants to ring the Golden Bell.\n",
  "long_summary": "Enel, being the first one to come across the great Belfry, calls it magnificent even though it is covered in vines and slightly tilted. Meanwhile Luffy, is trying to climb the vine but slips. Nami tries to convince him that he can't make it. Determined, Luffy takes Nami's waver and drives it up the bean stalk. Luffy falls but his will doesn't waver. Down where the others are, they get a message written on a leaf telling them to cut down the beanstalk from the west. The people from Skypiea tremble in fear as they look up at the ark surrounded in clouds. It focuses on Enel where he is talking to himself about destroying the land with Raigou so he can set out for the Fairy Vearth.\nRobin, Usopp, Gan Fall, and Zoro look in wonder at the thunderclouds Enel has created that are even bigger than the last one, doubting that they will get off the island in time. Then Nami, staring at the thunderclouds with Luffy, decides she won't leave because Luffy can't steer the waver. Usopp explains their plan as if it's crazy. Lightning strikes where they are and Wyper gets Aisa out of the way just in time. Usopp grabs Sanji with the help of Robin and they run before the next bolt hits them. Zoro then makes the decision that they should get away from the beanstalk in which everyone agrees non-verbally. When they are on the vearth, Zoro runs towards the beanstalk dodging bolts while the others wonder if he will make it. Being Zoro, he makes it and slices one part of the beanstalk down with one sword. Unfortunately, he gets struck down with lightning before he can cut the other part leaving both parts still standing.\nWyper complains about them getting in the way and protests that he, not Luffy, should ring the bell because it is the Great Warrior's will. Usopp decides that with his powers he can knock down the rest of the bean stalk and tells Robin to look after their fallen comrades. Robin then tells Wyper the story of Noland and the reason Luffy wants to ring the bell. Wyper starts to cry and asks for the descendant and the ancestor's name. Nola, the snake tries to help topple it down, but it doesn't work. Then Wyper, pushing Usopp aside starts to climb the beanstalk, then uses his Reject Dial on the beanstalk.\nLuffy and Nami use full speed on the falling beanstalk to get to the Ark. Wyper is still alive, Usopp and Aisa cheer Luffy and Nami on. Enel launches lightning at the two on the waver, they dodge it, and he starts to laugh. Shooting random shots of lightning at the ground. The forest catches on fire as Enel shoots random bolts of lightning.\n",
  "characters": [
    "Amazon",
    "Enel",
    "Kalgara (flashback)",
    "Monkey D. Luffy",
    "Nami",
    "Usopp",
    "Roronoa Zoro",
    "Nico Robin",
    "Tony Tony Chopper (K.O.)",
    "Aisa",
    "Wyper",
    "Gan Fall",
    "Pierre (K.O.)",
    "Sanji (K.O.)",
    "Nola",
    "Seto (flashback)"
  ],
  "ssum_frequencies": [
    [
      "to",
      3
    ],
    [
      "the",
      3
    ],
    [
      "finds",
      2
    ],
    [
      "a",
      2
    ],
    [
      "that",
      2
    ],
    [
      "nami",
      1
    ],
    [
      "way",
      1
    ],
    [
      "get",
      1
    ],
    [
      "enel",
      1
    ],
    [
      "by",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      45
    ],
    [
      "and",
      15
    ],
    [
      "to",
      13
    ],
    [
      "it",
      11
    ],
    [
      "he",
      10
    ],
    [
      "luffy",
      9
    ],
    [
      "in",
      8
    ],
    [
      "they",
      8
    ],
    [
      "on",
      8
    ],
    [
      "beanstalk",
      7
    ],
    [
      "of",
      7
    ],
    [
      "that",
      6
    ],
    [
      "down",
      6
    ],
    [
      "with",
      6
    ],
    [
      "usopp",
      6
    ],
    [
      "wyper",
      6
    ],
    [
      "enel",
      5
    ],
    [
      "is",
      5
    ],
    [
      "at",
      5
    ],
    [
      "then",
      5
    ]
  ]
}