{
  "chapter_number": "Episode 258",
  "title": "A Man of Mystery Appears!? His Name is Sogeking!",
  "short_summary": "Sogeking makes his grand appearance. Franky and Sanji aren't fooled by his costume but they try to humor him. They devise a plan first, then detach the last two cars and fight their way through the rest. Back in the Rocketman, Luffy, Zoro, Nami, and Chopper get an outfit change; Nami shows off the weapon Usopp upgraded for her while he was still with them.\n",
  "long_summary": "Sogeking introduces himself to Sanji and Franky and his theme song plays. Sogeking continues singing his theme song but Sanji and Franky aren't fooled by Usopp's disguise. Franky wonders why Usopp is dressed up like that and Sanji says that Usopp has too much pride to show his face to the rest of the crew but still wants to help save Robin. Franky tells Sogeking to come over and Sogeking does. Sanji then begins a meeting for a plan to save Robin. Sanji says that they must find out which train car Robin is in while Sogeking asks if they want to know where he's from. Sanji asks Franky if he's strong and Franky says of course even stating he's been stronger lately. Sanji says that the objective is to save Robin and everyone agrees. Sanji then says he has a plan and tells it to Franky and Sogeking.\nOn board Rocketman, Tilestone, Peepley Lulu, and Zambai all witness Nami changing her clothes in front of them. Paulie angrily tells Nami to cover herself better and tells Mozu and Kiwi to do the same. However, they tell Paulie that he is too shy and Paulie seethes in anger. Kokoro offers to change as well but Tilestone, Lulu, and Zambai quickly reject the offer. Luffy is seen trying to stuff meat into his new black shorts but Nami tells him not to. Kokoro believes that they can pull it off and Luffy says he has a reason to beat them now. Zoro notices that Nami has a new weapon and Nami says that it's the Perfect Climate Tact that Usopp modified before he left. Nami and Luffy sigh in disappointment from Usopp's last work and Zoro angrily tells them not to get depressed.\nBack on the Puffing Tom, Sanji, with Franky and Sogeking, prepares to put his plan into motion and Corgi informs Rob Lucci that there is an intruder on board. Lucci says it's an embarrassment that they allowed someone to sneak on-board but that person cannot get off once the train has started moving. Lucci tells Corgi that the intruder and the missing prisoners are still somewhere on the train and they must look for him. In train car 6, T Bone and the other Marines are still trying to look for Sanji, Franky, and Sogeking. Suddenly, a knock is heard on the door and Sanji, Franky, and Sogeking all say \"Good evening\" before closing the door again. The Marines hurry to open the door while Sogeking tries to hammer nails into it to slow them down. T Bone suddenly speaks up saying he will handle the door. T Bone uses his technique Chokkaku Senko: Bone Soir to slice up at the door.\nThe door flies off from the attack but Sanji, Franky, and Sogeking already have escaped. T Bone suspects they head up the roof and climbs up to see that they are already on top of train car 5. T Bone knows what they are about to do and tells the Marines to get onto the other side quickly. However, it is too late as the door is locked and the train cars are detached. Sanji is glad that the plan work and Sogeking wonders if Luffy and the others will run into the detached train car. Sanji says that they will come up with something and, before heading into the next train car, opens it and a government agent comes flying out. Sanji, along with Franky and Sogeking, enter inside and some World Government agents confront them. Sanji takes out some of them with Frit Assorti while Sogeking fires his Gunpowder Star at some of them and Franky uses Strong Right on more of them. A couple of agents fire at Franky but it doesn't go through him. Franky then throws a long chair at the agents knocking them out. Sanji and Sogeking are surprised that the gun shots didn't go through him and wonder what he is. Franky tells them that he is a cyborg and Sanji is surprised to hear they existed. Sogeking, excited, pokes Franky in the back with a needle and Franky yells in pain waiting to know why Sogeking did that. Sogeking is surprised to see that gun shots don't affect him but needles hurt. Franky says that his back isn't the same as his front due to him doing the operation on himself. Franky then shows his fridge which impresses Sanji and Sogeking. Sanji says that they must continue on.\nSanji, Franky, and Sogeking reach train car 4 and they are greeted by an erratic cook named Wanze. Wanze speeds in and offers to make them some ramen by eating flour then spreading out the noodles from his nostrils. Wanze offers it to them but Sanji, Franky, and Sogeking quickly reject. Sanji says that they must continue on but Wanze gets in his way saying they must go through him first. Wanze says that Robin is an important prisoner and, to rescue her, must defeat his Ramen Kenpo. Sogeking questions Ramen Kenpo but Wanze mocks him angering Sogeking. Sanji tells him to calm down and Franky tries firing at Wanze. However, his shots missed and Franky is shocked to see that Wanze easily dodged the shots and is even smiling about it. Wanze says he thought his heart was going to leap out of his chest and this annoys Franky. Franky and Sogeking both want to fight Wanze but Sanji calms them down and tells Wanze that if he as a real chef, he would conduct himself with more dignity. Wanze mearly looks the other way and an annoyed Sanji attempts to kick him. Sogeking comments how Wanze dodged the kick and even is smiling about it. Wanze says he thought he was going to die and both Franky and Sogeking tell Wanze to stop making that face. Having enough, Sanji tells Franky and Sogeking to go on ahead while he deals with Wanze.\n"
}