{
  "chapter_number": "Episode 17",
  "title": "Completely Infuriated! Kuro vs. Luffy, Final Battle!",
  "short_summary": "Luffy defeats Kuro and Usopp defeats Jango, expelling the Black Cat Pirates from the island. The crew receive a new ship from Kaya, accept Usopp as a new crew member, and set sail for their next destination.\n",
  "long_summary": "Kuro attempts to use Shakushi on Luffy once again, but this time Luffy uses his rubber body to restrain him and prevent him from moving. Stretching his neck back, he uses Gomu Gomu no Kane, a powerful headbutt knocking Kuro unconscious and destroying his glasses. Concluding the battle, Luffy orders the remaining Black Cat Pirates to leave the island, taking Kuro with them.\nSimultaneously, Zoro and Usopp arrive to protect Kaya from Jango. Zoro cuts down a tree branch, clearing the way for Usopp's Hissatsu: Kayaku Boshi, a fired pellet that explodes in Jango's face, defeating him. As he did not want to be known as the village hero, Usopp asks the children not to disclose his deeds to the townspeople.\nAfter meeting with the crew to thank them for their help, Usopp meets with the children. Explaining his desires to leave the village to become a real pirate, Usopp disbands the crew, telling each child to pursue their individual ambitions.\nTo thank them for their heroic deeds, Kaya gifts the crew with the Going Merry, a full-sized caravel designed by Merry. Gratefully accepting the ship, the crew prepare to depart, also deciding to take Usopp along as a new permanent member of the crew.\nKaya meets with Merry at the coast, where Merry explains Usopp's past. In his childhood Usopp's father, Yasopp, set sail with Shanks to become a pirate, leaving behind his son and wife. Usopp's mother passed away from illness soon after Yasopp's departure. Now lonely, Usopp became the town liar, hoping that his lies would come true and his father would someday return.\nIn the present day, the children assume Usopp's role as the town liar, claiming an incoming pirate invasion.\n",
  "characters": [
    "Monkey D. Luffy",
    "Kuro",
    "Jango",
    "Kaya",
    "Piiman",
    "Tamanegi",
    "Ninjin",
    "Roronoa Zoro",
    "Usopp",
    "Nami",
    "Merry",
    "Banchina (flashback)"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "defeats",
      2
    ],
    [
      "and",
      2
    ],
    [
      "usopp",
      2
    ],
    [
      "from",
      2
    ],
    [
      "crew",
      2
    ],
    [
      "a",
      2
    ],
    [
      "new",
      2
    ],
    [
      "luffy",
      1
    ],
    [
      "kuro",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      21
    ],
    [
      "to",
      15
    ],
    [
      "his",
      9
    ],
    [
      "a",
      7
    ],
    [
      "with",
      6
    ],
    [
      "usopp",
      6
    ],
    [
      "and",
      5
    ],
    [
      "usopps",
      5
    ],
    [
      "crew",
      5
    ],
    [
      "as",
      4
    ],
    [
      "merry",
      4
    ],
    [
      "kuro",
      3
    ],
    [
      "luffy",
      3
    ],
    [
      "him",
      3
    ],
    [
      "from",
      3
    ],
    [
      "them",
      3
    ],
    [
      "kaya",
      3
    ],
    [
      "for",
      3
    ],
    [
      "in",
      3
    ],
    [
      "children",
      3
    ]
  ]
}