{
  "chapter_number": "Episode 58",
  "title": "Duel in the Ruins! Strained Zoro vs Eric!",
  "short_summary": "Zoro is left fighting with Eric while Luffy and the other Straw Hat Pirates run to the ship in order to get to Lost Island, but only find more problems.\n",
  "long_summary": "The Straw Hat Pirates reach the top of the mountain and the dome-shaped building. The ground beneath them crumbles, leaving them in an underground area. Luffy notices a piece of collapsed ceiling that features a painting of a Sennenryu. At first, Apis believes that the Dragon's Nest was located on this island, but upon further inspection of the ceiling paintings, Nami deduces that the Dragon's Nest was located back at Warship Island, but sank into the sea. They are convinced that the island was actually the royal court mentioned in Bokuden's story.\nApis asks Ryu where the Dragon's Nest was. After watching a flock of birds flying in the building, Ryu finally remembers that the Dragon's Nest was indeed located east of the summit at Warship Island.\nEric appears. It is revealed he had been listening to the Straw Hat Pirates' conversation and now knows where the Dragon's Nest is. Luffy attempts to break out of the building, successfully breaking a hole into the wall. However, Eric leaps into the building and fights Zoro, while the rest of the Straw Hat Pirates, along with Ryu and Apis, escape and ride on Ryu's cart.\nAfter battling Zoro, Eric flees the building to chase Ryu. Zoro chases Eric.\nEric tries to leap off a building onto the cart, but is struck on the legs with a stick that Zoro threw. Eric finally agrees to battle Zoro. Meanwhile, the cart finally lands near the Going Merry. Luffy extends his arm, grabs Zoro, and pulls him to the ship. They set sail as Eric swears that he will not let the Straw Hat Pirates escape.\nThe Going Merry emerges out of the invisible barrier, much to the surprise of the Marines. Eric boards the Marine ship, and Lieutenant Commander Hardy commands the fleet to chase after the Going Merry.\nThe Straw Hat Pirates continue to sail towards Warship Island, only to be caught by Nelson Royale and his fleet. Nelson commands his ships to fan out, connecting the ships with chains and making an impenetrable barrier to block the Going Merry. So, the Straw Hat Pirates decide to board the ships, kick the Marines out, and cut the chains. \nLuffy once again demonstrates his ability to hear the \"voice of all things\" when he is able to understand Ryu.\n",
  "characters": [
    "Monkey D. Luffy",
    "Usopp",
    "Roronoa Zoro",
    "Nami",
    "Sanji",
    "Apis",
    "Ryu",
    "Eric",
    "Nelson Royale"
  ],
  "ssum_frequencies": [
    [
      "to",
      3
    ],
    [
      "the",
      2
    ],
    [
      "zoro",
      1
    ],
    [
      "is",
      1
    ],
    [
      "left",
      1
    ],
    [
      "fighting",
      1
    ],
    [
      "with",
      1
    ],
    [
      "eric",
      1
    ],
    [
      "while",
      1
    ],
    [
      "luffy",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      44
    ],
    [
      "to",
      15
    ],
    [
      "of",
      11
    ],
    [
      "and",
      10
    ],
    [
      "eric",
      8
    ],
    [
      "a",
      7
    ],
    [
      "that",
      7
    ],
    [
      "straw",
      6
    ],
    [
      "hat",
      6
    ],
    [
      "pirates",
      6
    ],
    [
      "building",
      6
    ],
    [
      "zoro",
      6
    ],
    [
      "dragons",
      5
    ],
    [
      "nest",
      5
    ],
    [
      "was",
      5
    ],
    [
      "island",
      5
    ],
    [
      "ryu",
      5
    ],
    [
      "luffy",
      4
    ],
    [
      "is",
      4
    ],
    [
      "out",
      4
    ]
  ]
}