{
  "chapter_number": "Episode 229",
  "title": "Running Sea Train! The City of Water, Water 7",
  "short_summary": "Going Merry narrowly escapes being hit by a \"Sea Train\", the crew meets an old woman, Kokoro, and her granddaughter, Chimney. Kokoro gives Luffy a map to Water 7. Luffy, Nami, and Usopp buy boats driven by sea monsters called \"Yagara\".\n",
  "long_summary": "After being defeated by Aokiji, the Straw Hat Pirates have fully recovered and have managed to return sailing to the sea. But, along their way, Zoro sees a giant frog swimming crawl stroke and he informs the crew. He asks them to turn back and see it.Luffy orders his crew to make the Going Merry follow it. Nami with her telescope looks around and wonders why there was a lighthouse on the island. She thinks there are people there. The frog is flying up left the ship and Luffy orders his crew to corner the frog. But, they feel the ship hit something and heard a sound around them. The Traffic light is seen and suddenly heard a sound of a train move to them. Nami warns the crew to turn back one hundred eighty degrees while Luffy is surprised after being hit.\nThe train moves inches past them and Sanji surprised to see it. Usopp is surprised with the iron thing that moves in the sea but Nami is the most surprised that there are trains that move in the sea with that shape. Luffy warns the frog to go away from the train rail but the frog ignores him and gets hit by train and faints. Luffy, Usopp and Chopper are surprised.\nA child sees the pirates and calls her grandma because there are pirates near their house. The Grandma orders the child to take Den Den Mushi falling to the left side. The child hands Den Den Mushi over to her grandma. She begins to call but she forgets to call whom.\nStraw Hat Pirates and two become friendly. They introduce themselves as Chimney, her rabbit Gonbe and Kokoro. Kokoro asks if the crew train thieves. Luffy introduce himself and Nami asks how the train moves at the sea. Chimney answer that the crew had been not seeing them. Chimney also said that this is only one train in the world where they can't find. That train is called \"Puffing Tom\". It moves with the steam and walks along the sea trail. It transports people from the island to another island with the trail underwater and walks with the same trail everyday. It transports foods and things too. It is dangerous to enter the trail with sign and signal. Usopp recommend Chimney to put the signal near the traffic light because he and his crew nothing know about it. Luffy says a frog was hit and Chimney asks if Luffy is talking about Yokozuna. She said that Yokozuna will not die, and it is the biggest problem for the station. Chimney explains that the frog takes a test of strength against the train and Luffy exclaims that Yokozuna is really brave. Chimney becomes angry and scolds Luffy to stop joking because it is really disturbing. She says it causes a lot of problems for her. Luffy says he will not eat it who had been hard-working. Nami said Luffy wasn't even thinking about it before. Kokoro asks where the crew will go. She says that if the crew ride that train, it will take the crew to St. Poplar, Pucci and San Faldo which are all fun places.\n"
}