{
  "chapter_number": "Episode 131",
  "title": "The First Patient! Anecdote of the Rumble Ball",
  "short_summary": "After their adventures in Arabasta, the Straw Hat Pirates come across a pineapple-shaped island and split up tasks amongst themselves. Chopper is left in charge of guarding the ship, and he reminisces about the day he first made the rumble ball and his first patient, Dr. Kureha, while spending some time with the newest crew member: Nico Robin.\n",
  "long_summary": "The scene opens on an early dawn, where all of the Straw Hat Pirates are asleep. Nami, who is above deck, wakes up and discovers an island in the distance. She calls out to the others, and after a humorous fight between Zoro and Sanji, Luffy awakens and climbs up onto the deck, sees the island, and gives a howl of joy.\nUpon landing on the island, Sanji notices that it's abundant with fruit. He suggests that they gather fruit as surplus, therefore, Nami has the remaining crew draw straws to see who gets to stay behind and watch the Going Merry. Luffy takes three, thinking that would make him smarter (which it did not), and in the end, Chopper ended up drawing the longest straw, so he got to stay behind. And so, Luffy, Zoro, and Usopp go to gather fruit while Nami goes to survey the island and draw a map of it, and Sanji follows her, swooning.\nThinking he's all alone on the ship, Chopper decides to play captain, giving out pretend orders to his fellow crew members. For a while, he has fun doing it until he discovers that the newest member of the crew, Nico Robin, was below him the whole time, reading a book. Chopper immediately gets freaked out remembering she was once a Baroque Works Officer Agent and that her specialty is assassination. He tells her he does not trust her and runs off into the ship (though Robin didn't seem to be paying attention). Once inside the ship, Chopper forgets about Robin for a bit and decides to make more Rumble Balls.  While he does so, Robin enters and begins to make more coffee, though Chopper does not notice. Instead, he remembers the first time he made a Rumble Ball.\nA flashback occurs to before Chopper met the Straw Hat Pirates, back to when Chopper was still learning medicine. He was experimenting with some of Dr. Kureha's medicine until he heard her coming and accidentally dropped a few of them in. Acting quickly, but not exactly thinking, he pressed the ingredients together and tossed the ball in his mouth and swallowed it. His body then went under an unusual change as his arms suddenly became muscular and grew larger without him doing so on his own.\nThe flashback ends and Chopper begins to wonder how Dr. Kureha is doing. Then he finally noticed Robin was in the room the whole time and panics again. Thinking she was trying to learn the Rumble Ball's secrets and assassinate him he quickly eats a Rumble Ball and attacks breaking a barrel of water. He changes back into his Brain Point form and uses his Scope move to try to find Robin's weakness. Robin just laughs and uses her Devil Fruit power to tickle Chopper. She also says he's funny and cute to which Chopper insults her while doing a happy little dance. Then Robin hands him an empty barrel saying that since he broke the other barrel he should refill this barrel with more water. Chopper agrees and heads off into the island.\nMeanwhile, Luffy goofs around with monkeys and Usopp acts as though he was dying trying to gather fruit for this crewmates, making a dramatic scene. Zoro, while grumbling about being ordered by a woman (especially Nami), does what he is told and gathers lots of fruit by cutting them down from trees using his Three Sword Style. Nami, in the meantime, is busy surveying the island as Sanji showers her with compliments and expresses his love. Nami says he's in the way, and knocks him out of the way.\nWe then go back to Chopper, who, along with Robin go to gather water. When Chopper wonders why she came along she simply says it has been a while since she has gone for a walk like this.  They finally reach a lake on the island and Chopper proceeds to fill the barrel. Robin sits in a nearby field of flowers. Chopper asks if she was really wanted by the Marines and all alone ever since she was 8, to which Robin replies \"Yes\". She goes on to say she survived by working for various pirates. She then asks Chopper about the person he was talking about before. Chopper describes Dr. Kureha as \"a woman who dresses like a pirate who is a doctor\". \nHe starts by saying he has spent 6 years learning how to be a doctor from her. In another flashback he is seen yet again messing with medicine when Dr. Kureha shows up. She asks if he's finished reading the pages he was supposed to read but Chopper complains, asking when he is going to do stuff doctors actually do. He then goes on to say he's already memorized all 200 of the books she gave him. Then suddenly, Dr. Kureha collapses. Chopper runs over to her, asking what's wrong. Dr. Kureha mentions that she might have gotten sick from one of her patients.  She then says that he will have to treat her as a test and if he fails, she will die.\nChopper immediately puts her to bed and runs some tests. After checking several books and mixing medicine, he gives her a green sphere-shaped ball which Dr. Kureha takes. Chopper wonders if she's going to ask what's in it and she explains that there is no patient who has room in his/her heart to ask such a question; illnesses cannot be cured unless the patient completely trusts their doctor. She then eats the medicine. Chopper asks if she's any better, but Dr. Kureha says medicine does not work that fast and that she needs her rest. Later that night when Chopper was about to go out to get more water Dr. Kureha tells him he did a good job for someone like him.\nBack in the present, Chopper continues to say that was the only compliment he had gotten from Dr. Kureha in all those 6 years. So instead of acknowledging him as a doctor, she trusted him with her life; that's the kind of person Dr. Kureha is. Then Chopper realizes he's said too much but Robin had already gotten up and was ready to head back for the ship. Before she goes she tells Chopper she wishes she had someone to write to like he did. They went back together with Chopper carrying a full barrel of water (still in Brain Point).\nLater that night all the Straw Hats were eating the fruit Zoro gathered. Nami was disappointed with Luffy and Usopp, but congratulated Zoro on a job well done and said he'd get to collect fruit through the night. Sanji swooned but Zoro tells him to shut up. Before they got into a fight Nami holds them both back saying she was just kidding. While everyone laughs Luffy asked how Chopper's day was. Chopper said nothing special happened, then looks over at Robin, reading her book, and then added, \"...But it's been a great day!\"\n"
}