{
  "chapter_number": "Episode 260",
  "title": "Duel on the Roof! Franky vs. Nero!",
  "short_summary": "Franky's fight with Nero continues. Nero discovers that Franky's weak spot is his back, so Franky lies down flat so he cannot get to it. Nero demands Franky to fight seriously, so Franky gets up to perform his Centaur form. Sogeking talks with Robin and tells her that the Straw Hat Pirates know about her reasons for leaving. Those on the Rocketman encounter the discarded cars, and Zoro slices through them so they can pass.\n",
  "long_summary": "In train car 4 of the Puffing Tom, Sanji taunts Wanze and Wanze comments how Sanji sliced up his ramen suit. Wanze comments how he is CP7's \"ace\" and says he will do everything to ensure Robin isn't saved. Wanze then attacks with Menkui Knocker but Sanji easily cuts up the attack using the kitchen knives. Sanji gets in close and manages to cut up the ramen suit upsetting Wanze. Sanji comments on how even though Wanze is a cook that makes ramen from his nose, he knows how to take care of his kitchen knives.\nOn the rooftop, Nero is seen trying to attack Franky but he puts up his Star Shield to block the attack. Nero is wondering what is with Franky's body knowing a real human cannot do that. Nero notices that Franky is breathing in air again and thinks it's fire but it turns out to be a bunch of nails (Master Nail). Nero uses Geppo to dodge the attack and says that even though he hasn't mastered the Shigan, he still has another plan. Nero then takes out two pistols but Franky attempts to run away and Nero follows. However, Franky quickly turns around and fires Weapons Left but Nero dodges it saying he saw the attack coming. Nero then fires his pistols at Franky's back and it causes harm to him. Nero smirks and attempts to attack Franky from behind with Rankyaku but Franky barely dodges it. Nero then tells Franky he knows that his back is his weakness but Franky says he has something to block his weakness. Franky lays flat on the ground using Franky Invincible but Nero comments how ridiculous the move is.\nIn train car 1, Sogeking enters and Robin wants to know why he is there. Sogeking sits across from her and introduces himself to her. Sogeking then tells Robin that he is here to save her and Sanji and Franky are helping out. Sogeking also tells Robin that Luffy and the others are following behind shortly on another Sea Train with a small army. Sogeking, knowing the agents in the train car behind them are strong, attempts to flee with Robin without having to confront them. Sogeking then asks Robin to come with him but Robin refuses. Sogeking gets up and says that the situation changed saying they know what is really happening after being informed by Iceburg, he is also encircled in a metaphoric blue flame,  representing the dying merry. However, it dies down very quickly. Robin still says she isn't going with him but Sogeking (now talking in his Usopp voice) says that the Straw Hats wouldn't let this go. Sogeking tells Robin that know they know what really happened, they will follow her to the depths of Hell if they have to, making the blue flame larger and more vehement. Robin angrily tells Sogeking that even if she could be saved that she wouldn't go with them, making the fire disappear. Suddenly, Corgi enters the room telling Robin to calm down. Sogeking has secretly hidden himself within Robin's coat and Robin tells Corgi she is fine (while Sogeking comically makes rabbit ears and other goofy hand gestures). Corgi is shocked to see Robin's reaction and comical goofy-ness, but think he's imaging things. Back on the roof, Nero yells at Franky to get up and fight fairly. Franky says he isn't quitting and tells Nero it's bad luck for him. Franky tells Nero that he is \"super\" this week and it's not a good time to make him angry. Franky then asks Nero if he has ever heard of a creature known as a Centaur and Nero says he has. Franky then modifies his body and converts to the Centaur Mode. Nero yells at Franky saying it's backwards but Franky says he will beat him up.\nIn Rocketman, Luffy asks where is \"Bashing Tom\" but Nami corrects him saying it's Puffing Tom. Nami tells Luffy to come inside as he is getting wet but Luffy wants to remain up there. Meanwhile, the others are messing around while Zoro yells at them to stop screwing around. Tilestone and Zambai tell Zoro that they are bored and Zoro tells them to do something else. Paulie says he tried to tell them the same thing earlier but they wouldn't listen to him. Suddenly, Luffy speaks up saying that there is another train in front of them. Everyone prepares for a fight and Kokoro comments saying it's a bit early. In the abandoned train cars, the Marines and World Government agents are hoping help will come. They are surprised to see another Sea Train and Zambai spots the discarded train car. Paulie tells Kokoro to stop the train but Kokoro says she cannot stop Rocketman. Luffy decides to take a look and uses Gomu Gomu no Rocket to launch himself onto the train car. The Marine and World Government agents identify Luffy and being shooting at him. However, the bullets don't work on his rubbery body and the bullets get deflected back at them. Luffy asks a Marine if he has seen Sanji but the Marine doesn't know who that is. Luffy informs everyone else that Robin and the others aren't in the train car. Luffy then tells Zoro to cut up the train car and Zoro agrees to. Zoro then slices up the train car (Two Sword Style Iai: Rashomon), greatly surprising everyone. Luffy and the others then move on leaving the other Marines and government agents stranded. However, a Marine says that there is still one guy that can stop them. Zoro then notices something up ahead and it turns out to be a Sea King that is cut in half. Everyone is shocked to see this and Luffy sees the opportunity for a meal. Zoro then puts on a headband saying there is someone out there strong enough to cut up a Sea King.\n"
}