{
  "chapter_number": "Episode 251",
  "title": "The Truth Behind the Betrayal! Robin's Sorrowful Decision!",
  "short_summary": "Chopper escapes the burning building with Paulie and Iceburg on his back and collapses outside. Iceburg clarifies it for Nami that Robin wanted the Straw Hats, excluding herself, to leave the island safely. To do so, she turned herself in to the government to help them recover the blueprints and then to be executed. Nami rushes to tell Chopper, so they can go look for the rest of the crew. Elsewhere, the foremen let go of the Going Merry, so she would be destroyed at sea.\n",
  "long_summary": "At his base, Franky finally recognizes Spandam's voice and Spandam is eager to see Franky at Enies Lobby to teach him a lesson. Spandam then slashes at a nearby lamp with his sword but the candle ends up burning him and he hangs up the Den Den Mushi. Kaku then has Blueno tie up Franky and Rob Lucci leads the other CP9 agents out. However, before they can go any further, Usopp suddenly speaks up and demands the agents to let Franky go. Lucci simply turns to Usopp with a defying stare and Usopp quickly apologizes much to Franky's disappointment. Kaku then remembers Usopp from the Straw Hat Pirates. Outside the Galley-La Company, the shipwrights are seen trying to put out the fire. Inside, Paulie and Iceburg are seen tied up and unconscious and Chopper is seen grabbing a nearby sword.\nAt the Sea Train station, two men are discussing about the Sea Train's departure before Aqua Laguna hits. One of the men notices that the people boarding the Sea Train are secret agents for the World Government. They continue talking about how they might know the undercover agents and how they are rich. One of the men says that the agents will board the Sea Train soon and will know their true identities. Back at the Galley-La Company, the people are still trying to put out the fire to little success. Suddenly, Chopper rushes out of the building with both Iceburg and Paulie on his back and puts them down gently. Chopper then notices Nami injured and attempts to help her but passes out. The people then tend to the aid of Iceburg and Paulie and then agree to help Chopper since he save Iceburg and Paulie's lives.\nBack at Franky's base, Kaku has just easily defeated Usopp much to Franky's disappointment and embarrassment. Kaku then hears that even though Usopp has left the Straw Hats, he is still living his life as a pirate. Kaku then states that Usopp also has to go to Enies Lobby and orders Kalifa to tie him up. Kaku then turns his attention to the Going Merry upset that Usopp hasn't disposed of it yet. Usopp angrily tells Kaku to stay away but Kaku knocks the Going Merry off of the chain and onto the water. Kaku then says that even though it was a temporary disguise, they are still respected as shipwrights and he opens the doors leading to outside. Usopp says that it's his ship and he can do whatever he wants to it but Kaku pulls down on the lever which causes the Going Merry to move closer into the sea. Usopp attempts to stop him but Kalifa ties him up with her thorny rose and the Going Merry crashes into the sea badly damaged now. Usopp tearfully screams out Merry's name.\nBack at the Galley-La Company, the people continue to struggle to put out the fire with the building itself starting to fall into pieces. Suddenly, Iceburg starts to wake up much to the shock and excitement of the people. The people then notice Nami also starting to wake up but are confused on what to do with her. Iceburg is now seen standing and he asks the other people that he needs to speak with Nami alone. Iceburg and Nami are now seen sitting alone and the other people wonder what they could be talking about. However, they continue to focus on putting out the fire as the other foreman are still trapped inside. Iceburg then apologizes to Nami for falsely accusing her and the rest of the Straw Hats and promises to clear it up. Iceburg, however, wants to talk about Nico Robin and asks Nami that when they first came to Water 7 did Robin started acting strangely. Nami agrees saying Robin went into town and never came back and that the next morning, she was the prime suspect in Iceburg's attempted murder. She continues saying that as soon Sanji and Chopper saw her, Robin said it was goodbye and wouldn't return to the crew. Nami then says that she and the others broke into his mansion in hopes of finding out the truth and recalls Robin saying she did it to make her wish come true. Nami then wonders what wish will force Robin to give up her friends and Iceburg says that he may know the answer. Iceburg says it may have happened as soon Robin got separated from the rest of the crew and says there is a good reason she did what she did. Iceburg then tells Nami that he and Robin have the plans to revive an ancient weapon that has the means to destroy the world much to Nami's shock.\nIn a flashback, Iceburg, still held down, has just told Robin that the blueprints that the other CP9 agents just found are fake and says he will rather die than hand over the real blueprints. Iceburg says if Robin is still searching for the Poneglyphs, then he has to do everything to stop her. Robin says she is only studying the Poneglyphs to learn more of the history of the world and doesn't care about the ancient weapon. Iceburg yells at Robin to take responsibility briefly remembering telling Franky eight years ago that weapons are made to hurt people. Iceburg then says that if Robin is still doing this, then she is better off dying right there and now and mentions Ohara. Robin angrily responds to Iceburg saying he knows nothing of Ohara and continues saying he knows nothing how the World Government has warped her life. Iceburg wonders if Robin hates the World Government so much, then why is she helping them. Robin says it's to make her wish come true and lets go of Iceburg. Robin then tells Iceburg that as soon she came to Water 7, CP9 presented her with two conditions: The first being to pin his assassination on the Straw Hats and leave their crew and the second being to turn herself over to the World Government and follow their every word. Iceburg tells Robin that the World Government won't let her live and wonders why, for escaping them for over twenty years, help them now. Robin then says that the World Government gave CP9 permission to activate a Buster Call against the Straw Hats. Iceburg is confused on the term Buster Call and Robin explains it's an emergency action that summons five Vice Admirals and ten battleships to the same location. She says that no matter how strong you are, nobody is able to survive a Buster Call and says that Admiral Aokiji gave CP9 the right to make the call. She says that as soon she heard his name, she surrendered saying if she hadn't, she and the rest of the Straw Hats would have been annihilated. Robin says she cannot turn her back on the Straw Hats as they helped her out which is why she hasn't run away. Iceburg then wonders what Robin's wish is and Robins says excluding her, the rest of the Straw Hats will be able to leave safely. Iceburg says that as long she has that, she doesn't care what happens to the rest of the world and Robin confirms this. Iceburg then picks up the nearby pistol and prepares to shoot.\nThe flashback ends with Iceburg telling Nami he couldn't pull the trigger saying he couldn't criticize her. Nami suddenly falls to the ground and tells Iceburg that she is happy that Robin hasn't betrayed them. Nami is eager to tell the rest of the Straw Hats the news saying now that Robin needs saving, she and the rest of the crew will not give up. Nami attempts to roughly wake up Chopper much to the horror of the other people. Meanwhile, at the Train Station, Robin can be seen and an agent is eager to see Robin has finally turned herself in. Not to far away, Sanji can be seen and finally is able to locate Robin again.\n"
}