{
  "chapter_number": "Episode 27",
  "title": "The Cold-headed Demon: Pirate Fleet Battle Commander Gin",
  "short_summary": "Gin knocks out Pearl before personally battling Sanji. After Gin refuses to eliminate Sanji, Krieg unleashes MH5, a poison gas bomb.\n",
  "long_summary": "After Luffy destroys the Baratie's fin, Krieg orders Gin to kill Sanji. Gin hesitates, as Sanji was the staff member who fed his crew. Pearl attempts to kill Sanji himself, but is attacked by Gin, who destroys his front shield and knocks him out. Gin decides to personally battle Sanji as a thanks for his generosity, while Krieg focuses on Luffy.\nGin, dubbed the \"Man-Demon\" for his extreme cruelty, uses his Man-Demon tactics against Sanji, armed with two weighted tonfa. Despite Sanji initially striking Gin to the ground, he quickly recovers, cruelly beating Sanji and gravely injuring him. However, after pinning Sanji to the ground, he is unable to finish him off out of remorse and guilt. Because of Sanji's hospitality, he begs Krieg to stop the attack, but Krieg denies this request, denouncing Gin for his insubordination.\nKrieg decides to unleash MH5, a lethal poison gas bomb. Krieg's men wear gas masks to protect themselves, the chefs dive underwater, and Zeff retreats to the restaurant's interior. Luffy takes masks off two Krieg Pirates and gives them to Sanji and Gin to protect them. However, he is unable to find a mask for himself before the bomb is launched.\n",
  "characters": [
    "Monkey D. Luffy",
    "Sanji",
    "Gin",
    "Zeff",
    "Don Krieg",
    "Carne",
    "Patty",
    "Pearl"
  ],
  "ssum_frequencies": [
    [
      "gin",
      2
    ],
    [
      "sanji",
      2
    ],
    [
      "knocks",
      1
    ],
    [
      "out",
      1
    ],
    [
      "pearl",
      1
    ],
    [
      "before",
      1
    ],
    [
      "personally",
      1
    ],
    [
      "battling",
      1
    ],
    [
      "after",
      1
    ],
    [
      "refuses",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      13
    ],
    [
      "the",
      9
    ],
    [
      "sanji",
      9
    ],
    [
      "gin",
      8
    ],
    [
      "krieg",
      6
    ],
    [
      "his",
      6
    ],
    [
      "and",
      6
    ],
    [
      "is",
      4
    ],
    [
      "for",
      4
    ],
    [
      "he",
      4
    ],
    [
      "luffy",
      3
    ],
    [
      "him",
      3
    ],
    [
      "a",
      3
    ],
    [
      "after",
      2
    ],
    [
      "destroys",
      2
    ],
    [
      "kill",
      2
    ],
    [
      "as",
      2
    ],
    [
      "who",
      2
    ],
    [
      "himself",
      2
    ],
    [
      "but",
      2
    ]
  ]
}