{
  "chapter_number": "Episode 148",
  "title": "The Legendary Family! 'Liar Noland'",
  "short_summary": "The Straw Hat Pirates meet with Mont Blanc Cricket on another part of Jaya. Cricket is a descendant of Mont Blanc Noland, an infamous \"liar\" who told of a gold city on Jaya and Cricket was ostracized for looking for artifacts of the gold city. He may be the only person who knows how to get to Skypiea. The episode ends with Mihawk looking at Zoro's and Luffy's new bounties.\n",
  "long_summary": "Usopp tries repairing the damages from the sonar attack but the crew keeps talking about replacing the ship. Usopp gets mad, asking them if they remember how they got the ship in the first place. Luffy tells Usopp not to complain and that the ship is part of the crew and that it needs to be fixed. That was before he hit a hole in the ship, making Usopp angry again. Nami looks at the map explaining that they are headed east by circling the island on their way to visit Mont Blanc Cricket. Luffy and Usopp are shocked to see a huge carnival palace looking house. However, it's revealed that the magnificent looking palace is just a cutout with a much smaller house behind it. Nami asks why he was outcast, and Robin explains that it might have something to do with him suggesting finding gold. Nami is thrilled by the idea of finding gold and puts Chopper to work by digging around. Luffy goes into the house to find no one there. Nami finds a very old children's book titled \"Noland the Liar\" from the North Blue. Usopp likes the title and Sanji reveals that he is from the North Blue but grew up in the East Blue, stating how the book is famous in the North. He also says that the book was based on a man who existed a long time ago. \nStory: 400 years ago, there lived a man named Mont Blanc Noland who lived in a North Blue country. As an explorer, he talked about his adventures even though the villagers couldn't decide whether to believe him or not. One day, he reported to the king after his travels and told him that he found a mountain of gold on an island in the middle of the sea. The king set sail to see if the story was true, taking 2,000 soldiers and Noland. After harsh waves and battling monsters, only the King, Noland, and 100 soldiers remained. But all that was on the island was a jungle. The king sentenced Noland to death for lying, with his last words being \"The mountain of gold must have sank into the sea!\", but no one believed him. \nBack at the pub, the pirates are laughing at the fact that Mont Blanc Cricket is a descendant of Mont Blanc Noland, saying that he must not be right in the head if he wants to clear his 400-year ancestors name by finding a few pieces of gold. Back with the Straw Hats, Luffy sees bubbles coming from the water, but is disappointed when nothing happens. Nami teases Usopp by saying that Noland died before he became \"a great warrior of the sea\". Luffy is suddenly dragged into the sea as a large man with little blond hair and a \"Maroon\" tattoo jumps out of the water. Sanji runs towards the mysterious fellow while telling Usopp to get Luffy out of the water. The man, who we believe to be Mont Blanc Cricket, shoots Sanji in the face, but it actually missed. Just as Zoro is about to enter the fight, the Cricket drops his pistol and falls to the ground. Usopp gets Luffy up to the surface while he explains what happened. The crew takes the man into his house while Chopper doctors him up. Chopper explains that he has Caisson Disease, which is something divers get, but it's not long-lasting, however it can become fatal if the person exerts themself too much. In the background there is a picture of the man and the two monkey pirate brothers smiling.\nThe two monkey brothers, both in good health, come bursting into the home asking if the \"old-timer\" is ok. Usopp and Chopper freak out when the brothers ask what they're doing to him, but Luffy says they are taking of care of him and that they should leave. The brothers are glad that the Straw Hats are nice. The brothers reveal that the house is the headquarters of the Saruyama Alliance. Cricket comes to and apologizes for assuming they were after the gold. Luffy asks him about Sky Island but gets laughed at instead. He explains that no one knows for sure if it's there, except for the man everyone calls a liar. Luffy keeps looking at Usopp, but he says that it's not him. It's revealed that Cricket is indeed a Mont Blanc descendant, and that Noland was actually an extremely honest person who was very sad that the people didn't believe him. Usopp guesses that he was diving to find the gold and clear his ancestors name, but he shoots at him, missing of course, and explains that what his ancestor did has nothing to do with him and because of him he had a rough childhood. But over the past 400 years, many relatives have tried to clear the Mont Blanc name but have disappeared instead. So Cricket ran away from home and became a pirate to escape Noland's reputation. He managed to get his own ship and crew and entered the grand line. However, they accidentally came across an island, which is the one they are on now. He believed that it was fate, that he, who hated the Mont Blanc name so much, would find the island his ancestor had found long ago. He decided to search for the gold, but his crew decided to leave instead of helping him search. Rather than feel obligated to find the gold, Cricket thinks of it as a duel between the man who made his life hell and himself. Usopp bawls and Luffy asks how the monkeys fit into the picture. Turns out, the monkeys love the picture book and believe the gold really exists. Luffy presses the man about sky island, yelling that he wants to go there. Cricket says that it's not confirmed that Noland ever went there but tosses Nami Noland's log book from 400 years ago. Nami reads about his adventure and how they saw skyfish. The gang gets really excited to hear Nami read about Sky Island. Cricket goes outside to see the Monkey Brothers fighting and convinces them to help the Straw Hats get to Sky Island. \n"
}