{
  "chapter_number": "Episode 141",
  "title": "A Longing for Home! The Inescapable Pirate Graveyard!",
  "short_summary": "Henzo, his friends, and the others try to find a way out of the ship graveyard. Meanwhile, the Mayor and his men let the information about the Rainbow Mist slip to the remaining Straw Hat Pirates still on Ruluka.\n",
  "long_summary": "The episode starts with a scene in which the Pumpkin Pirates went swimming when suddenly Rapanui Pasqua told them that the treasure of the island is on the top of the rock where their flag stands. When all of them swam very quickly, Henzo was left behind trying to tell them to wait. Rapanui Pasqua turned back and shouted he can't because he is an adult. Henzo's body suddenly turned to the present old appearance he has and the background went hallucinating until Henzo woke up and realized it was all just a dream. Nico Robin saw him awake and figured out that he was dreaming about his friends because he was shouting their names while asleep.\nMeanwhile, Luffy and the others are on the outside and Zoro asked Luffy if they are travelling in the right direction. They soon realized they once again passed a statue that they already passed a while ago, they thought they were travelling in circles but in shooting a cannon made all of them realize the space was distorted. Luffy obviously didn't know what it meant so he dared to test it by flying forward to the sky and then came falling back from behind the ship. Luffy told them he gets it and said that it was a \"Mystery Mist\", obviously not understanding it himself. None of the crew knew how to get out of Ape's Concert, so Robin suggested to ask a boy hiding behind some wreckage, how they might get out by going to the Pumpkin Pirates hideout.\nIn a Marine ship wreckage, Ian is seen eating in a prison cell with Rongo and Akibi talking to him about how to get out of Ape's Concert as well. Ian tries to convince them that he knows how to get out of Ape's Concert but they should give him the key to his cell first. Isoka knew he was lying and reminded the two how cruel he was to them by forcing them to let him be their leader when previously a Sea King was attacking them he was so afraid that he threw Rongo to fight it. Nearly eaten, Rongo was rescued by Rapanui and after the attack, Ian boasts that they wouldn't be alive if it weren't for him. Their ship got lost because the Sea King smelled the food they kept and they were left on a small boat. In the Marine ship, the buzzer rang and Isoka asked Rapanui what's the danger. Rapanui saw a pirate ship and managed to see Pukau thinking he is being held hostage.\nRapanui immediately went to rescue him and threatened Luffy and the others by swaying his sword until Zoro threw it out. Pukau told Rapanui that he was not a hostage and that they just asked him where their secret hideout is. Rapanui wouldn't believe when Usopp went out holding plates of food attracting both Luffy and Pukau until all of them except Rapanui started eating. In an attempt to offer food, Henzo was denied by Rapanui because he doesn't believe in adults who suddenly appear. Henzo asked for forgiveness because he worked hard to find them but now they are of different ages. Henzo's Den Den Mushi started ringing but Luffy grabbed it and answered it receiving Wetton's voice. On the other side, Sanji grabbed the Den Den Mushi from Wetton and asked if it was Luffy. Upon discovering they talked to each other, Henzo knew the Rainbow Mist and the Outside World wass connected.\nHenzo got the phone back and when Rapanui heard Wetton's name he told Henzo that he was not the true Henzo they knew. He said that true Pumpkin Pirates don't work for Wetton. When Nami, Chopper and Sanji decided to go to the Rainbow Mist, Wetton forbid it and said they must pay 10,000,000 beli to be able to be permitted. They didn't want to pay so Wetton told them they would instead work hard labor in the Rainbow tower until their deaths. Nami asked for the safety device and Lake, gullible enough, gave it up and they started running. While Sanji wished that it would be a romantic getaway, Nami's desire for the treasures made her eyes turn into Beli symbol. The 2 prepared to fight when suddenly a Sea King appeared before them and Nami  screamed \"What?\" ending the episode.\n",
  "characters": [
    "Akibi",
    "Isoka",
    "Rongo",
    "Pukau",
    "Rapanui Pasqua",
    "Henzo",
    "Nico Robin",
    "Monkey D. Luffy",
    "Usopp",
    "Roronoa Zoro",
    "Ian",
    "Wetton",
    "Lake",
    "Tony Tony Chopper",
    "Nami",
    "Sanji",
    "Flip"
  ],
  "ssum_frequencies": [
    [
      "the",
      6
    ],
    [
      "his",
      2
    ],
    [
      "and",
      2
    ],
    [
      "to",
      2
    ],
    [
      "henzo",
      1
    ],
    [
      "friends",
      1
    ],
    [
      "others",
      1
    ],
    [
      "try",
      1
    ],
    [
      "find",
      1
    ],
    [
      "a",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      37
    ],
    [
      "to",
      27
    ],
    [
      "and",
      27
    ],
    [
      "he",
      19
    ],
    [
      "they",
      19
    ],
    [
      "a",
      15
    ],
    [
      "was",
      15
    ],
    [
      "it",
      15
    ],
    [
      "them",
      13
    ],
    [
      "that",
      12
    ],
    [
      "rapanui",
      11
    ],
    [
      "of",
      11
    ],
    [
      "in",
      10
    ],
    [
      "henzo",
      8
    ],
    [
      "luffy",
      8
    ],
    [
      "when",
      7
    ],
    [
      "him",
      7
    ],
    [
      "out",
      7
    ],
    [
      "their",
      6
    ],
    [
      "asked",
      6
    ]
  ]
}