{
  "chapter_number": "Episode 244",
  "title": "The Secret Bond! Franky and Iceburg",
  "short_summary": "Rob Lucci tells Iceburg their hypothesis and has Kaku check his pulse to tell if the things he told him were true. They suspect that Iceburg's friend from the past, Cutty Flam, is really Franky and it is revealed to be true. Therefore, Franky has the real blueprints. The Straw Hat Pirates and Paulie break into the room where they find Iceburg and CP9.\n",
  "long_summary": "Franky is shown watching Usopp fix the Going Merry from afar with Mozu and Kiwi. Usopp is then shown remarking about the weather becoming rough as he patches the ship. Franky then remembers Usopp's determination in getting the 200,000 belly to fix his ship, as he does so Mozu mentions that the ship must be what he needed the money for and Kiwi notes Usopp's ignorance in the weather. Which causes Franky to say that Usopp's plight in fixing the ship is a lost cause. As Franky approaches the ship he repeats his comment about it being useless loud enough for Usopp to hear in order to reveal his presence. After realizing who Franky is Usopp asks why he is here and Franky says that he will just have to take him and the ship hostage due to the storm saying that he has some business with Straw Hat Luffy and has come to kidnap Usopp.\nIn the Galley-La building courtyard, Zoro is fighting the shipwrights attempting to protect Iceburg, thinking that it is okay because he used the back of his swords to defeat them all. Nami then yells at him for taking them all out when it wasn't necessary while Chopper fauns over Zoro's strength. Nami and Chopper then lead the way through the building while yelling at Zoro for getting lost multiple times claiming it's a miracle. Luffy is shown escaping the metal constraints that the masked men put him and Paulie in while Paulie is amazed at Luffy's devil fruit powers. Once he gets out Luffy starts to work on Paulie's constraints as well.\nLucci is then shown unmasked explaining to Iceburg that the World Government has intelligence agencies named Cipher Pol-1 though Cipher Pol-8 referred to as CP1 or CP8 by most people and that they can dig up any information the World Government needs. Once Iceburg says he is aware of these organizations Lucci goes on to explain that they are actually part of a unit that is supposedly non-existent and is called CP9 saying they are special because they have authorization to kill people who impede the governments wishes in the name of justice. Lucci continues saying that the world government has changed their tactics and decided that rather than living in fear of the weapon that they have decided to take possession of it and use it to end the great pirate era which Iceburg responds with mistrust towards the government and that it will only cause more damage if the weapon is restored saying that he knows human nature. After Lucci kicks Iceburg in the face for still acting like his boss Kaku goes to check his pulse as Lucci begins to lay out their hypothesis saying that Iceburg's pulse will tell them if it's true. \nIn a street, Kokoro, Chimney and Gonbe are seen walking as Chimney asks if they are going back yet. Which Kokoro says that since the wind is good for sobering up they will take the long way as she drinks more alcohol which Chimney finds odd and asks if you can get sober while drinking. Kokoro just laughs and says that she can because she has been drinking for several decades. As Chimney and Gonbe run ahead into the fierce wind repeating how weird that is, Kokoro corrects herself and says she has only been drinking for 8 years.\nBack in the room with CP9, Robin and Iceburg, Lucci starts telling Iceburg his hypothesis and the thinking behind it. Which starts with him explaining that they have doubts about the fake blueprints that he gave them saying that Iceburg knew that they were from the government, so he gave them a fake but if indeed the person had just come to kill him that the real blueprints would then be lost to the world. So in order to keep the protection of the weapon he had to pass them on to someone else but since he hadn't done it that night he had already entrusted them to someone else or that he doesn't have them with him. Then explaining that this is all a theory and has no proof, he continues his theory by saying that the person entrusted must have reasonable skills as a shipwright, he then pulls out the fake blueprints and notes that the architects had signed their names, them being Tom, Iceburg and Cutty Flam, otherwise known as Tom's Workers. Lucci continues saying that to anybody else this would have passed inspection and they would have believed that they were the real blueprints but because CP9 had been so close to Iceburg they knew about Tom's workers and along with their information from the World Government knew that Tom had had two disciples and that one was confirmed dead. However Lucci recalled the name Cutty Flam from someone who met with Iceburg just after they had started their undercover work. It then shows a flashback of Kalifa telling Iceburg of the man named Cutty Flam but Iceburg tells them to turn him away but that this proves that Cutty Flam is still alive and has actually changed his name to Franky. At which point Iceburg's pulse quickens rapidly, It then shows another flashback of Iceburg meeting Franky with Franky exclaiming that this is a weird way of meeting. Iceburg then gives him the plans for Pluton and tells Franky to no longer use the name Cutty Flam and that Franky should leave with the plans in case that he or Iceburg is targeted. Back in the present Kaku verifies the truth of Lucci's statements with Iceburg's quickened pulse and exclaims that he would have never made that connection. Lucci then says that they were never able to prove Franky's identity but because of his odd behavior and profession they didn't pay attention to him. After commending Iceburg for his smart thinking and explaining how they had the opportunity to meet and exchange the blueprints he then explains that since he doesn't have the blueprints and none of them were entrusted with them then it must have been entrusted with his fellow disciple and that while it may have been speculation Iceburg's pulse confirmed their theory as fact.\nIn the hallway, Nami, Chopper and Zoro are shown running past injured people, Chopper especially taking notice, Nami finds the correct room and slows down, along with Chopper, to have Zoro cut it down. Which he gets mad at them for ordering him around. Luffy is shown breaking into a room with Paulie yelling at him that it is the wrong room. Back in Iceburg's room Lucci tells Iceburg it really wasn't his fault for giving it up and that he is only human at which point both Luffy and Zoro crash through the walls of the room yelling where is Robin. Both Zoro and Robin are surprised while Lucci shows his annoyance. Luffy says he found Robin while Zoro asks where Luffy has been. Chopper expresses joy at seeing Robin again while both Nami and Paulie ask what is going on. \n"
}