{
  "chapter_number": "Episode 40",
  "title": "Proud, Tall Warriors! Dramatic Battle of Sanji and Usopp!",
  "short_summary": "Sanji battles Kuroobi underwater and defeats him on land. Usopp also braves Chew, evades his attacks, and defeats him. Nami arrives at Arlong Park to confront Arlong.\n",
  "long_summary": "Having an advantage underwater, Kuroobi battles Sanji in the pool. Restraining him with his hair, he beats Sanji with his Fish-Man Karate, preventing him from resurfacing. He then grabs Sanji and dives underwater, causing the water pressure change to crush his body. Sanji then blows air into Kuroobi's gills, harming him and returning to the surface.\nOn land, Sanji gains an advantage over Kuroobi. Despite Kuroobi threatening to use his signature move, Sanji uses a series of rapid attacks against him before Mouton Shot, defeating him and sending him crashing through the building.\nMeanwhile, Usopp pretends to be dead to avoid Chew, but decides not to evade him and confront him. He hides in the forest and Chew uses water from the paddy fields to spit at the forest as bullet-like projectiles. Despite this, having covered Chew with flammable wine, Usopp sets him on fire with an incendiary projectile, then strikes him with his hammer. Usopp repeatedly beats Chew with his hammer until he is knocked unconscious.\nAt the base, Nojiko and Genzo switch places, with Nojiko now being underwater. Arlong attacks Zoro and Sanji by throwing water at them like projectiles, but Nami arrives to their aid, declaring battle against Arlong.\nThe 4Kids version of this episode was dubbed \"Arms Against Arms\" and aired on June 11, 2005 and \"The Comeback Kid\" that aired on June 18, 2005. 4Kids combined Japanese episodes 39 and part of 40 to make 4Kids episode 37. They then combined the rest of Japanese episode 40 with Japanese episode 41 and part of Japanese episode 42 to make 4Kids episode 38.\n",
  "characters": [
    "Roronoa Zoro",
    "Arlong",
    "Kuroobi",
    "Monkey D. Luffy",
    "Genzo",
    "Sanji",
    "Nojiko",
    "Usopp",
    "Chew",
    "Johnny",
    "Yosaku",
    "Nami"
  ],
  "ssum_frequencies": [
    [
      "and",
      2
    ],
    [
      "defeats",
      2
    ],
    [
      "him",
      2
    ],
    [
      "arlong",
      2
    ],
    [
      "sanji",
      1
    ],
    [
      "battles",
      1
    ],
    [
      "kuroobi",
      1
    ],
    [
      "underwater",
      1
    ],
    [
      "on",
      1
    ],
    [
      "land",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      11
    ],
    [
      "and",
      11
    ],
    [
      "him",
      10
    ],
    [
      "to",
      10
    ],
    [
      "with",
      8
    ],
    [
      "sanji",
      7
    ],
    [
      "his",
      6
    ],
    [
      "episode",
      6
    ],
    [
      "of",
      5
    ],
    [
      "he",
      4
    ],
    [
      "then",
      4
    ],
    [
      "on",
      4
    ],
    [
      "chew",
      4
    ],
    [
      "4kids",
      4
    ],
    [
      "japanese",
      4
    ],
    [
      "an",
      3
    ],
    [
      "underwater",
      3
    ],
    [
      "kuroobi",
      3
    ],
    [
      "water",
      3
    ],
    [
      "against",
      3
    ]
  ]
}