{
  "chapter_number": "Episode 80",
  "title": "A Doctorless Island? Adventure in the Country Without a Name!",
  "short_summary": "The Straw Hat Pirates manage to gain the trust of the people that attacked them, and are taken to the village, except for Zoro and Karoo, who guard the ship. Luffy and Sanji must take Nami to the island's sole doctor who lives on a mountain-top. Vivi and Usopp discover from Dalton, the past of the island and about the pirate Wapol.\n",
  "long_summary": "After Vivi has been shot by a villager on Drum Island, Luffy enrages and prepares to attack the inhabitants. Vivi quickly hugs Luffy and tells him he is not qualified to be a captain because not everything need to be resolved with fighting. Karoo is watching over Nami. Luffy calms down and apologies to the people on the island. Dalton empathizes with the crew and orders them to follow him. Vivi smiles to Luffy because the people understood and Luffy compliments her.\nUsopp, Vivi, Sanji (carrying Nami), and Luffy are following Dalton and the inhabitants of the island when they encounter a hiking bear and Usopp tells everyone to play dead. Everyone in there simply passes along the hiking bear after bowing. In the Going Merry, Zoro comments how his legs are fully healed now. Later, he is seen without a shirt talking about training while Karoo is amazed.\nDalton introduces Bighorn to the visitors and tells to everyone that whoever is not a guard can return to his house. Negikuma Maria asks how things went after she heard there were pirates. Dalton invites the visitors to his house and tells them to use a bed, after that, Nami is seen laying on it while Vivi covers her. Dalton introduces himself as the captain of the security squad of the island. He feels like he has seen Vivi before, but Vivi (nervously) answers by telling him is probably just his imagination. She changes topic by asking him to tell them more about the witch, since Nami's temperature is around 42 °C. Dalton talks to the visitors about the Drum Rockies and how on the top of the tallest mountain is the Drum Castle, where there is no longer a king, but is where Kureha lives. Luffy decides to wake up Nami because he is going to climb the mountain while carrying her. After hearing him, Nami agrees with the idea.\nAfter Sanji decides he is coming too and everything is set, Dalton advice the two to climb the mountain by the \"other\" side because there are lapahns in the main course. After Luffy and Sanji have departed, Usopp and Vivi watch them leaving and stay outside. Dalton, after seeing their concern, decides to join them. He then talks about the country and how they were known as an advance medical nation because the skilled doctors that inhabited in there. It turns out that the country was attacked by 5 pirates months ago. The captain of the crew called himself \"Blackbeard\". Some people thought that the country being destroyed was better for its sake, as it contributed to the destruction of the Drum Kingdom and his king, Wapol. Luffy and Sanji are seeing running through the slope of the mountain while they are chatting, but a lapahn keeps attacking them because they keep dodging his attacks. Sanji gets annoyed at this and kicks him, sending him flying.\nSanji and Luffy encounter a big herd of lapahns. Dalton keeps talking about the past situation of the kingdom. The Bliking is seen and Chess is on top while he sights Drum Island and notifies the captain of the Bliking Pirates.\n",
  "characters": [
    "Nefertari Vivi",
    "Monkey D. Luffy",
    "Roronoa Zoro",
    "Usopp",
    "Sanji",
    "Karoo",
    "Nami",
    "Dalton",
    "Negikuma Maria",
    "Kureha",
    "Blackbeard Pirates (flashback and shadowed)",
    "Wapol",
    "Chess"
  ],
  "ssum_frequencies": [
    [
      "the",
      9
    ],
    [
      "and",
      5
    ],
    [
      "to",
      3
    ],
    [
      "of",
      2
    ],
    [
      "who",
      2
    ],
    [
      "straw",
      1
    ],
    [
      "hat",
      1
    ],
    [
      "pirates",
      1
    ],
    [
      "manage",
      1
    ],
    [
      "gain",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      41
    ],
    [
      "and",
      22
    ],
    [
      "to",
      19
    ],
    [
      "is",
      16
    ],
    [
      "luffy",
      10
    ],
    [
      "of",
      10
    ],
    [
      "a",
      9
    ],
    [
      "dalton",
      9
    ],
    [
      "after",
      8
    ],
    [
      "vivi",
      8
    ],
    [
      "he",
      8
    ],
    [
      "him",
      7
    ],
    [
      "because",
      6
    ],
    [
      "them",
      6
    ],
    [
      "sanji",
      6
    ],
    [
      "his",
      6
    ],
    [
      "by",
      5
    ],
    [
      "on",
      5
    ],
    [
      "drum",
      5
    ],
    [
      "island",
      5
    ]
  ]
}