{
  "chapter_number": "Episode 89",
  "title": "When the Kingdom's Rule is Over!The Flag of Conviction Lasts Forever",
  "short_summary": "After trying several tricks inside the Drum Castle, Wapol is finally hunted down by Luffy. The villagers, Zoro, Vivi, and Usopp are ascending to the castle via the Drum Ropeway.\n",
  "long_summary": "As Luffy races back into Drum Castle to fight Wapol, Chopper tells Kureha that Luffy said he was his friend.\nInside the castle, Nami gets a coat and prepares to escape while Kureha is occupied, wanting to get back on the sea and get Vivi back to Arabasta. She walks out of the room only to catch sight of Wapol, who immediately suspects she is one of the Straw Hats. He chases her along the ledge but gets stuck in a stairway. He uses Baku Baku Factory: Slim-up Wapol to \"eat himself\" and become slim. However, the moment he tackles Nami to consume her, he gets a kick to the face from Luffy. Nami conks Luffy over the head for damaging her jacket as it cost her 28,800 after bargaining. She tells him that now he has to pay her 100,000 for it.\nWapol reaches the doorway to the castle armory, which only he has a key for. His plan is to eat all the weapons with Baku Baku Factory to become a human weapon, but when he reaches for his key, he finds it is gone and runs up the column stairway with Luffy chasing him. Nami is disappointed as she swiped that key hoping it opened a treasury. Sanji, still debilitated by his re-injured back, crawls back to Nami, realizing she is not injured. Wapol is determined to retake his kingdom and get his revenge. He gets to the top dome of the castle and uncovers his ultimate weapon: the Royal Drum Crown Seven-Shot Bliking Cannon. Luffy arrives and Wapol tries to fire the cannon at him. It makes some noises, but shoots nothing. Wapol tries the trigger lever several times, but it appears the cannon is empty. All that comes out are snowbirds that were nesting inside.\nAs Chopper waits outside for the battle's final outcome, villagers have assembled at the base of the Drum Ropeway, which is also Dr. Kureha's house. A gondola is transporting some soldiers along with Zoro, Usopp, Vivi, and Dalton. Usopp wonders if Dalton should have come at all since he is still recovering from his injuries and hypothermia, but he is determined to see Wapol defeated and his kingdom destroyed. Back at the castle, Luffy grabs Wapol, saying the battle is over and what he is does not matter, since he is a pirate. Wapol says assaulting him is a crime against the World Government, which Drum Kingdom is a part of. He opens his mouth wide to eat Luffy, but Luffy's rubber fingers stretch around it. Wapol turns his tongue into Bero Cannon to shoot Luffy.\nOn the Drum Ropeway, Dalton recalls how Wapol captured most of Drum's doctors, and his ministers claimed that government did not need to be good to its people. Dr. Hiriluk changed that opinion for him. He reveals he has dynamite, which he will use to destroy the castle once they get there. Dr. Kureha asks Chopper if he is worried about Luffy. Chopper responds that he does not need to be, since Luffy is a pirate. Sure enough, Luffy is unharmed by Wapol's cannon and uses Gomu Gomu no Bow Gun to fire Wapol upward, getting him stuck in the top of the dome. He sees Hiriluk's flag on another spire of the castle where Luffy replanted it after he tried to shoot it down. Kureha tells Chopper that the end of the Drum Kingdom has finally come.\nAs Chopper remembers Dr. Hiriluk, Luffy tells Wapol not to mess with the flag if he is not prepared to suffer the consequences. Ignoring pleas from Wapol, including an offer to make him the vice-king, Luffy uses Gomu Gomu no Bazooka to launch Wapol far away from the island. The Drum Ropeway gondola arrives at the castle. Luffy pounces Zoro and Usopp from the top of the castle, at first thinking Zoro was one of Wapol's men because he was wearing one of their coats. He then tells Vivi that Nami and Sanji are fine. As Dalton makes his way off the gondola, Luffy says he was \"beating up the king\" and Dalton realizes Wapol has been defeated. He also adds that \"the reindeer\" beat up Wapol's minions. Dalton notices Chopper, who is \"hiding\" behind a tree, and remembers him from the ambush on Dr. Hiriluk. Realizing Chopper has always been fighting for them, he bows to the reindeer, thanking him and vowing that the kingdom will be reborn.\nThe other villagers arrive and identify Chopper as a monster. Dalton tries to stop their fear as Usopp also cries out that he is a monster. Luffy tells him not to call Chopper a monster as he is their new crewmate. Chopper runs off and Luffy gives chase.\nThe anime added a few scenes not found in the manga. The part where Nami and Sanji meet up in the castle is extended, as well as Dr. Kureha and Chopper's interaction outside the castle.\n",
  "characters": [
    "Nami",
    "Wapol",
    "Monkey D. Luffy",
    "Sanji",
    "Tony Tony Chopper",
    "Dalton",
    "Nefertari Vivi",
    "Usopp",
    "Roronoa Zoro",
    "Kuromarimo (flashback)",
    "Chess (flashback)",
    "Kureha",
    "Hiriluk (flashback)"
  ],
  "ssum_frequencies": [
    [
      "the",
      4
    ],
    [
      "drum",
      2
    ],
    [
      "castle",
      2
    ],
    [
      "after",
      1
    ],
    [
      "trying",
      1
    ],
    [
      "several",
      1
    ],
    [
      "tricks",
      1
    ],
    [
      "inside",
      1
    ],
    [
      "wapol",
      1
    ],
    [
      "is",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      51
    ],
    [
      "to",
      32
    ],
    [
      "he",
      30
    ],
    [
      "is",
      25
    ],
    [
      "and",
      22
    ],
    [
      "luffy",
      19
    ],
    [
      "wapol",
      17
    ],
    [
      "a",
      16
    ],
    [
      "that",
      13
    ],
    [
      "his",
      13
    ],
    [
      "of",
      13
    ],
    [
      "as",
      11
    ],
    [
      "castle",
      11
    ],
    [
      "chopper",
      11
    ],
    [
      "him",
      10
    ],
    [
      "it",
      9
    ],
    [
      "not",
      8
    ],
    [
      "drum",
      7
    ],
    [
      "nami",
      7
    ],
    [
      "for",
      7
    ]
  ]
}