{
  "chapter_number": "Episode 259",
  "title": "Cook Confrontation! Sanji vs. Ramen Kenpo",
  "short_summary": "Kalifa updates CP9 on the situation with Franky, Sanji, and Sogeking. Sanji tells Franky and Usopp to go on without him so he can fight Wanze and his Ramen Kenpo. Franky begins to fight Nero, CP9's Weasel, and Sogeking meets with Robin. The episode ends with Sogeking's theme song being cut off before it starts.\n",
  "long_summary": "Kalifa and the rest of CP9 has just been informed by a government agent that the rear two cars have been detached. Kalifa asks how could they let that happen but the agent tries to defend himself saying even T Bone has been beaten. Kalifa wants a status report and the government agent says that there are still five cars left but the Marines and World Government agents have been taken out in the fifth car. He says that Wanze is guarding the fourth car, Nero in the third car, Nico Robin in the first car, and everyone else in the second car. Rob Lucci suddenly speaks up saying their enemy shouldn't be taken likely but Lucci says that the only problem now is that Franky is running loose. Lucci says that Robin and Franky will be delivered securely to Enies Lobby and he doesn't care how many men they will lose. Kalifa asks if the intruders were identified and the agent says that two of them were the prisoners but one of them is now wearing a strange mask. He also says that there is a blonde guy in a suit that he has never seen before. Kaku concludes that the intruder is a member of the Straw Hat Pirates knowing he is trying to rescue Robin and that Franky is helping them out. Blueno offers to watch over Robin but Lucci says it isn't necessary and that they should focus on recapturing Franky. Lucci then says that rescuing Robin will not happen.\nIn train car 4, Sanji tells Sogeking and Franky to go on as rescuing Robin is the top priority. However, Wanze isn't about to let them go so easily and eats a bunch of flour. Sogeking fears more nose noodles but Wanze fires a bunch of sharp noodles (Ramen Beam) toward Sogeking and Franky who both barely dodge. Sanji attempts to attack Wanze but the noodle cook dodges it. Sogeking and Franky then move on to the next train car but Wanze says that Nero will be waiting for them. Sanji attempts to attack Wanze with Flanchet Shoot but Wanze continues dodging his attacks. Meanwhile, Sogeking's theme plays again and he is standing on top of Franky trying to figure out how to get to Robin's car quickly. Franky, annoyed, tells Sogeking to go and calls him a \"Stupid Slimy Squid King.\" Sogeking yells back at him but gets an idea from hearing \"slimy squid\" and tells Franky he has a plan. Sanji and Wanze continue their fight but Sanji grows annoyed by Wanze dodging all of his attacks. Wanze then activates his Men-Kiri Hono Hocho and attempts to attack Sanji with a fiery kick but Sanji blocks it with some kicks. Wanze suddenly screams in pain after being hit twelve times by Sanji. Wanze wonders if Sanji is strong but says that Sanji's swirly eyebrows made him dizzy. Wanze then eats a bunch of more flour and uses Ramen Kenpo Ogi: Men's Formal Suit to make a fighting suit out of ramen. Sanji is angry at Wanze for using food to fight but Wanze says he is a lot stronger now. Sanji promises to make Wanze eat all those noodles.\nOn top of the Puffing Tom, Franky is seen being confronted by Nero. Franky asks why Nero is waiting on the roof as he would've come inside instead. However, Nero knew that Franky would just skipped past the car. Franky knows that Nero must keep his guard up and suddenly tells Nero to look the other way. Nero does so and Franky attacks him from behind with a punch. Nero says that was a dirty trick and Franky says he isn't the king of Water 7's Underworld for nothing. On the Rocketman, Luffy once again gets onto the top of it. Nami wonders where Luffy went and Zoro is clueless as well. Nami, Zoro, and Chopper wonder what happened to him while Luffy continues going further onto the Sea Train. Luffy eats a piece a meat and says that they're coming for Robin (as Usopp too).\nSanji and Wanze prepare to begin their fight and Wanze attacks with Tonkotsu Spank. Sanji dodges and says it's just the same weak punch but bigger. Wanze attacks again but when Sanji attempts to kick the attack, his foot gets stuck in the noodles. Wanze begins to slam Sanji around in the room and taunts Sanji saying how his noodles are effective. Wanze becomes dazed from staring at Sanji's eyebrows but quickly snaps out of it and viciously slams Sanji to the ground. Wanze then crushes Sanji with Men Soul Press and continues slamming across the room. Sanji is free of the noodles but Wanze continues taunting him and closes in. Wanze attempts to attack Sanji with Ramen Gyoza Set - Clapping but Sanji moves out of the way. Sanji knows the only part to attack Wanze and aims for Wanze's head with Escalope but Wanze fires his Ramen Beam to knock Sanji back. Wanze then prepares to finish Sanji off using Fukumen Spank but Sanji pick up a couple of kitchen knives to chop away at the attack. Wanze is angry that Sanji has chopped up his noodles. Sanji says that a chef must fight without using their hands or knives but Sanji says that since he and Wanze are in a kitchen and that Wanze is using food to fight, the rules change. Wanze attempts to attack Sanji with Senmen Muchi but Sanji dodges it and Wanze yells at him. Sanji apologizes but tells Wanze he is going to show how a real chef handles his kitchen knives.\nBack on the roof of the Puffing Tom, Franky and Nero continue their battle. Nero gets in close using Soru but as Franky attempts to attack him with his Strong Hammer, Nero dodges it using Kami-e. Nero uses Rokushiki/Rankyaku on Franky but it seems to have not affected him much surprising Nero. Franky strikes back using Fresh Fire but Nero dodges it by jumping toward the sea but uses Geppo to get back on the Sea Train. Franky wonders how Nero jumped in the air like that and Nero is wondering how the Rankyaku didn't affect Franky. Franky and Nero then charge in at another and both want to know what the other is. Meanwhile, Sogeking is seen on the other side of the Sea Train wearing octoshoes. Sogeking then taps on Robin's window and Robin, seeing Usopp through the disguise, is surprised to see him and wants to know why he is there. Sogeking smiles as his theme plays off.\n"
}