{
  "chapter_number": "Episode 77",
  "title": "Farewell to the Giants' Island! On to Arabasta!",
  "short_summary": "After having a chat with Mr. 0 and encountering the Unluckies, Sanji retrieves an Eternal Pose for Arabasta. The giants are alive and well, and their friendship secure as the Straw Hats are about to leave Little Garden. The crew leaves Little Garden and sets sail for Arabasta, with a little help from their giant friends in escaping the island's strange guardian, a large fish.\n",
  "long_summary": "Once Sanji realizes that he is talking to Mr. 0, he pretends being Mr. 3 and convinces the Warlord that he has eliminated Vivi and her Straw Hats escort. During the conversation, Crocodile's messengers, the otter, and its partner, the vulture, called the Unluckies, arrive to deliver an Eternal Pose, leading to Arabasta, to Mr. 3. They attack Sanji, but he kills them. To justify the noisy interruption, Sanji tells Mr. 0 that one of the Straw Hats was still alive. Crocodile tells him to return to Arabasta and after the conversation, he orders Miss All-Sunday to order Mr. 2 to intercept and eliminate Mr. 3 en route. While Brogy mourns the apparent death of Dorry, creating a rainfall of tears, Dorry suddenly wakes up, much to the shock of everyone. Dorry concludes that, after a hundred years, Brogy's axe had gotten dull and only blacked him out. Using the Eternal Pose to guide them, the crew sets sail. Dorry and Brogy see them off, and, to thank them, they use their worn out weapons to kill the Island Eater as it attempts to feed on the Going Merry.\n",
  "characters": [
    "Brogy",
    "Nami",
    "Roronoa Zoro",
    "Usopp",
    "Karoo",
    "Monkey D. Luffy",
    "Nefertari Vivi",
    "Dorry",
    "Sanji",
    "Mr. 0/Crocodile (unclearly seen)",
    "Mr. 13",
    "Miss Friday",
    "Miss All Sunday",
    "Island Eater"
  ],
  "ssum_frequencies": [
    [
      "the",
      5
    ],
    [
      "and",
      4
    ],
    [
      "a",
      3
    ],
    [
      "little",
      3
    ],
    [
      "with",
      2
    ],
    [
      "for",
      2
    ],
    [
      "arabasta",
      2
    ],
    [
      "are",
      2
    ],
    [
      "their",
      2
    ],
    [
      "garden",
      2
    ]
  ],
  "lsum_frequencies": [
    [
      "to",
      14
    ],
    [
      "the",
      14
    ],
    [
      "and",
      8
    ],
    [
      "mr",
      6
    ],
    [
      "he",
      5
    ],
    [
      "that",
      4
    ],
    [
      "them",
      4
    ],
    [
      "of",
      4
    ],
    [
      "dorry",
      4
    ],
    [
      "sanji",
      3
    ],
    [
      "3",
      3
    ],
    [
      "0",
      2
    ],
    [
      "straw",
      2
    ],
    [
      "hats",
      2
    ],
    [
      "conversation",
      2
    ],
    [
      "eternal",
      2
    ],
    [
      "pose",
      2
    ],
    [
      "arabasta",
      2
    ],
    [
      "they",
      2
    ],
    [
      "tells",
      2
    ]
  ]
}