{
  "chapter_number": "Episode 124",
  "title": "The Nightmare Draws Near! Secret Base of the Suna Suna Clan",
  "short_summary": "Luffy fights Crocodile by using the blood on his fists in order to be able to hit Crocodile. Meanwhile, Vivi finds the bomb, and calls the Straw Hat Pirates together.\n",
  "long_summary": "Vivi and Usopp are together and Vivi has an idea of where the cannon is hidden. Usopp had signaled the other member of The Straw Hat Pirates (in the previous episode) with one of his sling shot bombs. But Billions from the Baroque Works had found them instead. To distract them, Usopp uses a chalkboard and drags his nails down it to make a loud noise; he grabs Vivi and runs away.\nMeanwhile, Luffy finds where Crocodile, Nefertari Cobra, and the critically injured Nico Robin is. Crocodile is upset that Luffy is still alive, no matter how many times he defeats Luffy. Cobra is baffled by who the strange boy is (Luffy). Luffy demands that Crocodile give him back Vivi's country, so Vivi can smile again. Luffy punches Crocodile twice and Crocodile is confused about how he is doing it without water. Luffy was using his blood to touch Crocodile preventing Crocodile from using his powers from the devil fruit. Crocodile takes off a covering from his hook that reveals he has poison in it.\nZoro runs to where the smoke bomb was shot by Usopp. But finds a group of Marines who were with Tashigi. They berate him for having a poor sense of direction and then give him orders on where to go to find the center of the city of Alubarna.\nVivi and Usopp are still running with Baroque Works members chasing them. Tashigi and a few Marine members attack the men chasing Vivi and Usopp. Nami and Tony Tony Chopper find Vivi and Usopp with two minutes left before the bomb kills the Royal Army and Rebel Army and everyone in the center of Alubarna. Pell is shot from the sky by a mysterious frog woman hidden in the Clock Tower who is later revealed to be working for Baroque Works.\nLuffy and Crocodile continue their fight and Luffy dodges Crocodile's attacks made by his hook. Cobra notices that Crocodile is struggling in the fight.\nVivi is looking for Pell thinking he's their only hope to reach the cannon in time. Sanji and Zoro are in the Clock Tower. With 30 seconds left, the Clock Tower opens with Mr. 7 and Miss Father's Day inside laughing.\n"
}