{
  "chapter_number": "Episode 243",
  "title": "CP9 Unmasked! Their Shocking True Faces",
  "short_summary": "It is assumed by the Galley-La Company that both Rob Lucci and Kaku are deceased, and Tilestone was defeated by the masked bear man. Robin is still speaking with Iceburg inside his room. The World Government is revealed to know that Robin can read the Poneglyphs - and it seems Iceburg is the one who has the blueprints to one of the Ancient Weapons, Pluton. The true enemies are revealed to be Iceburg's own allies. Elsewhere, Luffy is tied up with Paulie and Paulie tells some members of the mysterious CP9 that the blueprints he has are fake.\n",
  "long_summary": "At the Galley-La Company, more shipwrights are being massacred by the bear-masked CP9 agent. The area soon becomes eerily quiet as another group are shipwrights noticed the bear-masked agent has killed off more shipwrights. Tilestone runs to the scene and notices that the bear-masked agent has not only killed off more shipwrights but has seemingly killed Lucci and Kaku as well. Tilestone is visibly shocked and angry at the sight he has just seen and the bear-masked agent says he's getting tired of dealing with all of the shipwrights. Tilestone, in a rage, charges at the masked CP9 agent with his mallet but the agent hardens his body to completely block the attack (Tekkai). The agent then grabs Tilestone's arm and viciously punches him to the ground knocking him out. The other shipwrights attempt to get away but the masked-bear agent quickly runs after them and takes them out as well.\nJust outside, Zoro, Nami, and Chopper are running from a mob of shipwrights who are shooting at them. Nami wonders if Luffy isn't there, then where is he. Zoro doesn't know himself but decides to go on the offensive. Chopper says that the shipwrights aren't the enemy but Zoro says he will use the back of his swords to fight. Zoro charges at the group of shipwrights and starts to knock them away with the ends of his swords (with Nami and Chopper informing him that he can still kill the shipwrights that way.\nIn Iceburg's room, Robin is still watching over an injured Iceburg who is actually glad to meet her face to face. Iceburg suddenly pulls out a gun and Robin responds by pulling out multiple guns using her power. Robin notices that he wanted to kill her and Iceburg demands why she is looking for the Poneglyphs. Iceburg informs her that the World Government has made it illegal to continue research on them and knows that Robin can decipher them. He concludes that, despite being 8 years old at the time, this is why the bounty on her head is so high. Robin confirms his theory and Iceburg admits he didn't believe CP9 exists and notices that Robin left the Straw Hats to help out. Iceburg then says that weapon would never bring peace to the world, only destruction. He then tells Robin to abandon the idea and let it die. Robin simply tells him not to tell her what to do with her research and Iceburg says that they both have a lot in common. Iceburg then says that he has the blueprints for the ancient weapon known as Pluton much to Robin's surprise. Iceburg continues saying how Pluton was a battleship build on the island many years ago and the shipwrights that had the blueprints passed it down fearing that another battleship of equal power would fall into the wrong hands. Iceburg notices that the World Government wants to revive Pluton as there in no force to oppose it. Iceburg as that a man named Tom trusted the blueprints to him and how there was a young girl that could decipher the blueprints. Iceburg attempts to shoot Robin but she quickly pins him down and holds him at gunpoint. Robin says that the government doesn't need her to steal the blueprints as they have already accomplished that. However, Iceburg tells her that they have fallen for his trap.\nBack outside close to the Galley-La Company, Luffy is still struggling to get himself free. Luffy manages to grab onto a high pole and pull himself out. Luffy is still determined to find Robin and grabs onto the roof of the Galley-La Company and shoots himself forward toward it (Gomu Gomu Rocket). Inside of a room, Paulie is seen with several holes in his body with blood pouring out and he falls to the ground. The bull masked agent, with the skull masked agent, demand Paulie to hand over the blueprints. Paulie says that he should've run instead of fight and falls to the ground and the blueprints slip out of his hands. The bull masked agent picks up the blueprints and Paulie reveals that they're fakes much to the CP9 agent's shock. Paulie taunts them saying their plan is a failure but both CP9 agents move in for the kill. Suddenly, Luffy comes crashing at the wall but gets stuck in the process. He notices Paulie on the ground injured but then turns his attention to the masked agents demanding them to give back Robin. The skull masked agent kicks away at the wall (Tempest Kick) nearly hitting Luffy but dodges at the last second. However, the bull masked agent kicks him down and pins him to the ground. The skull masked agent does the same with Paulie and asks the other agents not to kill Iceburg yet and to all meet in his room.\nJust outside, the soldier agent is seen fighting Peepley Lulu who easily takes him out. She then jumps into the sky and leaves. Back in the room, Paulie asks if Luffy is okay and also apologizes for thinking he tried to kill Iceburg. Luffy accepts his apology saying that they are pirates. Paulie wonders why Luffy came back and Luffy says that the masked people took Robin. Paulie is still willing to fight as he doesn't want Iceburg to die saying he is more than his boss. Back in Iceburg's room, all the agents surround him and Hattori suddenly lands on the bull masked agent's shoulder. The bull masked agent takes off his mask revealing himself to be none other than Lucci while the skull masked agent reveals himself to be Kaku. It turns out that they weren't killed earlier and it was other people disguised as them. The solider reveals herself to being Kalifa and the bear masked agent is Blueno much to Iceburg's shock and horror. Lucci demands to know where the real blueprints for the ancient weapon Pluton are.\n"
}