{
  "chapter_number": "Episode 170",
  "title": "Fierce Sky Battle! Pirate Zoro vs Fighter Braham",
  "short_summary": "Zoro fights the Shandia warrior Braham and defeats him with Ittoryu (One Sword Style) 36 Pound Cannon technique. Luffy and Wyper have begun their battle and Chopper has arrived at the ruins. Meanwhile, Enel visits the Going Merry and knocks out Sanji.\n",
  "long_summary": "Chopper was running around scared and Robin is seen in what appears to be the ruins. Zoro is seen talking to himself about his Flying Blade attack and he tried it out on a bird attempting to attack him, but he said the attack wasn't ready, thus searching for another thing to test this attack on. Chopper, running scared, is actually being chased by the Divine Soldiers, but they encounter a Shandia and ignore Chopper and fight one another. Robin, still at the ruins, is approached by a Divine Soldier who tells her to go this route leading to God's shrine. Robin, upset at the Divine Soldier for breaking some part of the ruins, defeats him.\nZoro, still making his way through the forest, is attacked by a Shandia warrior and Zoro punches him, knocking him out. In that moment, Braham defeats a Divine Soldier and proceeds to fight Zoro. Zoro initially tried to ignore the fight since Braham was not a priest. However, when Braham's attacks continued, Zoro prepared to fight him saying that he is glad Braham is not a second-rate flunkie. The Shandia and the Divine Soldiers are now engaged in battle and so are Braham and Zoro. Zoro was initially having problems fighting Braham because of the Jet Skis and Flash Guns that Braham has, thus making it a long-range battle. As the battle continues, Zoro decides to try his new technique. With Ittoryu - Sanjuroku Pound Ho, Zoro was able to defeat Braham and commented to himself about accepting the survival game.\nChopper, wailing about being left by the others, finds himself at the ruins and congratulates himself on being smart. Meanwhile, Gedatsu was in the same area and Chopper did not notice him. Luffy and Wyper continue their face-off and Wyper was shooting cannons at Luffy which Luffy rebounded using his Gomu Gomu no Mi abilities. Enel has visited the Straw Hats' ship and Sanji attempted at attacking but was defeated by Enel's Goro Goro no Mi abilities. Enel stated he had come without the intention of fighting and referred to Sanji as a foolish man. Gan Fall asked what his purpose of visit was, but Enel just told him it's been a long time since they met, and said that that is a cold-hearted way of greeting him.\n",
  "characters": [
    "Monkey D. Luffy",
    "Wyper",
    "Tony Tony Chopper",
    "Nico Robin",
    "Roronoa Zoro",
    "Braham",
    "Gedatsu",
    "Usopp",
    "Nami",
    "Sanji",
    "Gan Fall",
    "Pierre",
    "Enel"
  ],
  "ssum_frequencies": [
    [
      "and",
      4
    ],
    [
      "the",
      3
    ],
    [
      "zoro",
      1
    ],
    [
      "fights",
      1
    ],
    [
      "shandia",
      1
    ],
    [
      "warrior",
      1
    ],
    [
      "braham",
      1
    ],
    [
      "defeats",
      1
    ],
    [
      "him",
      1
    ],
    [
      "with",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "and",
      18
    ],
    [
      "the",
      18
    ],
    [
      "to",
      13
    ],
    [
      "a",
      11
    ],
    [
      "zoro",
      10
    ],
    [
      "was",
      8
    ],
    [
      "is",
      8
    ],
    [
      "him",
      8
    ],
    [
      "braham",
      7
    ],
    [
      "chopper",
      5
    ],
    [
      "his",
      5
    ],
    [
      "by",
      5
    ],
    [
      "divine",
      5
    ],
    [
      "at",
      5
    ],
    [
      "of",
      5
    ],
    [
      "that",
      5
    ],
    [
      "in",
      4
    ],
    [
      "ruins",
      4
    ],
    [
      "himself",
      4
    ],
    [
      "attack",
      4
    ]
  ]
}