{
  "chapter_number": "Episode 179",
  "title": "The Upper Ruins Crumble! The Quintet Finale!!",
  "short_summary": "Enel appears only to reduce the group to as close to his prediction as he can. Nami and Gan Fall escape the belly of Nola.\n",
  "long_summary": "Enel used his lightning heaven's judgment on the Divine Squad member who escaped while Pagaya was with him. Conis remembering the words of the man on Enel's plan for Skypiea resolved to leave for Angel Island to warn the inhabitants. She left Su behind telling her to watch over the unconscious Usopp and Sanji. Upon defeating Ohm, Zoro commented on needing more training with the attack that he used. Just then, Holy came intending on punching Zoro and missed. Zoro yelled \"down\" while dodging the attack and the dog obeyed leading Zoro to say that the dog obey's anyone. Zoro then told the dog to hit itself on the head and take a nap and the dog did. Zoro then went on to attack the python, but was not having much success because of the snake's hard scales. However, the party in the belly of the snake are having a tough time staying still, which is related to the attack the snake is receiving from the outside.\nRobin, surprised at Enel's action asked him what he had done and he told her he showed mercy to a \"maggot\" in pain justifying that it is the duty of the god. Robin seeing all this commented on how powerful Enel's Logia Devil Fruit is. Enel then used the attack Sango which sent lightning waves to the upper ruins. He told Robin this was an invitation to summon her comrades to Shandora. This caused the upper ruin ground to be destroyed. Nami decided to use the Waver to escape the inside of the snake while it's mouth was open. She started the waver however, Luffy and Aisa fell behind. Upon getting out, Nami realized they were falling and Gan Fall, who also made it out with Pierre, told Pierre to go back in to help Luffy and Aisa.\nOn falling to the lower ruins, Zoro meets Robin. He asked where they were and she told him the place where they were to find the gold. She went on to tell Zoro, after he asked where the treasure is, that there is no gold. Pierre arrived back inside the snake and found Luffy and Aisa. He motioned for them to climb on him and took on his horse form. Luffy stretched and got onto the back of the horse. Aisa was petrified at what she saw and hung on to the horse as told by Luffy. Upon landing, Nami and Gan Fall wondered about their location and Gan Fall comments to himself that he never knew such a place existed in the Upper Yard. After landing, Wyper realized that he has landed on Shandra. Nola appeared to be looking for something and later began to cry. Enel asked what the snake was fussing about and attacked Nola with Elthor. Zoro lamented that he is unable to save Nami from such an attack and on hearing that, Nami appeared from hiding. She went on to tell them that she escaped, however Luffy was still in the snake's stomach.\nWyper commented on how he blasted the python with many attacks of burn bazooka with no effect and the snake got knocked out from Enel's attack. Enel then appeared before Wyper telling him that the game is not over. Enel greeted Zoro, Robin, Wyper and Gan Fall telling them about the number of people that began the survival game including himself and that in three hours, there shouldn't be six people left (he was aware of Nami's presence). He gave the choice for them to either fight themselves or for him to pick an opponent. All four refused Enel's choice and told him he would be the one disappearing. Enel went on calling them \"insolence\".\n",
  "characters": [
    "Conis",
    "Pagaya (flashback)",
    "Moyle (flashback)",
    "Enel",
    "Su",
    "Sanji (flashback)",
    "Usopp (flashback)",
    "Ohm (K.O)",
    "Roronoa Zoro",
    "Holy",
    "Nola",
    "Wyper",
    "Nami",
    "Pierre",
    "Aisa",
    "Gan Fall",
    "Monkey D. Luffy",
    "Nico Robin",
    "Tony Tony Chopper (K.O)",
    "Kamakiri (flashback)",
    "Genbo (flashback)",
    "Braham (flashback)",
    "Raki (flashback)"
  ],
  "ssum_frequencies": [
    [
      "to",
      3
    ],
    [
      "the",
      2
    ],
    [
      "as",
      2
    ],
    [
      "enel",
      1
    ],
    [
      "appears",
      1
    ],
    [
      "only",
      1
    ],
    [
      "reduce",
      1
    ],
    [
      "group",
      1
    ],
    [
      "close",
      1
    ],
    [
      "his",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      47
    ],
    [
      "to",
      28
    ],
    [
      "and",
      24
    ],
    [
      "on",
      17
    ],
    [
      "he",
      15
    ],
    [
      "that",
      12
    ],
    [
      "zoro",
      10
    ],
    [
      "of",
      9
    ],
    [
      "was",
      8
    ],
    [
      "is",
      8
    ],
    [
      "him",
      7
    ],
    [
      "she",
      7
    ],
    [
      "attack",
      7
    ],
    [
      "told",
      7
    ],
    [
      "enel",
      6
    ],
    [
      "with",
      6
    ],
    [
      "for",
      6
    ],
    [
      "in",
      6
    ],
    [
      "snake",
      6
    ],
    [
      "luffy",
      6
    ]
  ]
}