{
  "chapter_number": "Episode 169",
  "title": "The Life-Threatening Reject! War Demon Wyper's Resolve",
  "short_summary": "Wyper takes out Shura and tells his goal to the Shandia. Enel speaks up about how many people will be alive by the end of Survival game, claiming that only 5 of all 81 will be left standing.\n",
  "long_summary": "Aboard the Going Merry, Gan Fall begins to explain Sky Warfare to Sanji, Nami and Usopp. He demonstrated this by having Sanji hit the Impact dial with a large hammer, to no avail. Gan Fall tells Sanji to press the tip of the dial, causing a blast to be emitted from the shell. Gan Fall further explained how some other dials are used for warfare. When asked about Mantra, Gan Fall told them it is difficult to explain, however he was able to explain some of the basics, and told them what the hearing capabilities of the priests and Enel were.\nEnel is seen at his shrine, counting the total number of people in his survival game as totaling 81. He asked one of his advisers to predict the number of people that will be left in three hours, and the man says that he is underestimating the power of people in the battle. Enel predicts that five people will be left after three hours.\nThe Shandia warriors have made their way into the Upper Yard forest and found themselves trapped in Shura's Ordeal of String. Just as Shura was explaining to the warriors how they got tangled, he felt the presence of Wyper and both began battle. Just as Shura began his attack, Wyper threw his weapon and shield away to take Shura's hit. After enduring the attack to lure Shura in, he defeated Shura using the Reject Dial. Enel's commenting indicates that Shura was defeated as a result of underestimating Sky Weapons. Meanwhile, Divine Soldiers have also been mobilized by Yama.\nLuffy making his way through the forest was attacked by a Divine Soldier, who he easily bested. He then encountered Wyper, who decided to eliminate Luffy because he refused to leave the Island. Both of them then prepare to fight each other.\n",
  "characters": [
    "Sanji",
    "Gan Fall",
    "Nami",
    "Usopp",
    "Monkey D. Luffy",
    "Satori (flashback)",
    "Pierre",
    "Tony Tony Chopper (flashback)",
    "Shura",
    "Fuza",
    "Enel",
    "Gode",
    "Yama",
    "Braham",
    "Kamakiri",
    "Wyper",
    "Genbo",
    "Raki"
  ],
  "ssum_frequencies": [
    [
      "the",
      2
    ],
    [
      "will",
      2
    ],
    [
      "be",
      2
    ],
    [
      "of",
      2
    ],
    [
      "wyper",
      1
    ],
    [
      "takes",
      1
    ],
    [
      "out",
      1
    ],
    [
      "shura",
      1
    ],
    [
      "and",
      1
    ],
    [
      "tells",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      21
    ],
    [
      "to",
      14
    ],
    [
      "of",
      11
    ],
    [
      "he",
      9
    ],
    [
      "and",
      7
    ],
    [
      "his",
      6
    ],
    [
      "in",
      5
    ],
    [
      "shura",
      5
    ],
    [
      "gan",
      4
    ],
    [
      "fall",
      4
    ],
    [
      "a",
      4
    ],
    [
      "was",
      4
    ],
    [
      "people",
      4
    ],
    [
      "as",
      4
    ],
    [
      "that",
      4
    ],
    [
      "explain",
      3
    ],
    [
      "sanji",
      3
    ],
    [
      "by",
      3
    ],
    [
      "dial",
      3
    ],
    [
      "be",
      3
    ]
  ]
}