{
  "chapter_number": "Episode 107",
  "title": "Operation Utopia Commences! The Wave of Rebellion Begins to Move",
  "short_summary": "Baroque Works' plan to take over Arabasta is set in motion. Crocodile begins explaining to Vivi what Operation Utopia is. The king is kidnapped and replaced by Bentham who announces that he must eliminate the town of Nanohana and all of its inhabitants to prevent word of the Dance Powder incident that occurred earlier in the same city from reaching the Marines. By Koza's order the Rebel Army begins to move.\n",
  "long_summary": "Baroque Works' plan to take over Arabasta is set in motion. Crocodile begins explaining to Vivi what Operation Utopia is. The king is kidnapped and replaced by Bentham who announces that he must eliminate the town of Nanohana and all of its inhabitants to prevent word of the Dance Powder incident that occurred earlier in the same city from reaching the Marines. But as soon as Bentham gives the order to destroy Nanohana, Koza arrives to confront him. After a brief exchange, Koza attempts to attack Bentham, but is stopped by two royal guards and then shot, allowing the royal army to attack Nanohana. Koza, badly wounded, wonders why the rebel army fought. In the midst of the fight Mr. 1 and Miss Doublefinger crash into Nanohana on a giant pirate ship they had commandeered by killing everyone on board. The ship then causes massive collateral damage, forcing the city's inhabitants to flee. Bentham then announces that his part of the mission is complete and tells the royal army to burn the city.\nWhile fleeing, it is shown that the royal soldiers in Nanohana were actually Billions under Bentham's command. Meanwhile, the citizens of Nanohana admit they cannot put out the fire. Koza, still badly wounded, is dragged out of the fire by two rebel army soldiers. The same two rebel soldiers find a boy, who after discovering that someone had impersonated Cobra, was attacked by Mr. 1 and Miss Doublefinger. The boy tries to tell them that the king wasn't responsible but is too wounded to speak and the rebels are framed for the crime. Koza orders the rebel army to move.\nWhen one of the rebel soldiers says they don't have enough weapons, another soldier says that the ship that just crashed was an armory ship. Koza proclaims that is like \"divine guidance\". Back at the palace, Chaka is astonished at the Nanohana incident, and is told by a royal soldier that all of Arabasta is headed towards the palace. Back at Rainbase Crocodile has just finished explaining his plan to Vivi, who is shocked into silence. Eventually, Vivi regains some spirit and attempts to escape with her hands still tied. \n"
}