{
  "chapter_number": "Episode 118",
  "title": "Secret of the Royal Family! The Ancient Weapon, Pluton",
  "short_summary": "Crocodile reveals to Vivi about the ancient weapon, Pluton. Nami defeats Miss Doublefinger with her most powerful attack: the Tornado Tempo and Zoro meets and begins to clash with Daz Bones \"Mr. 1\".\n",
  "long_summary": "Crocodile reveals his true motive and explains the details of Pluton. After hearing of this for the first time, King Cobra informs Crocodile that even the existence of the weapon is in doubt. Crocodile affirms that even he cannot confirm its existence but reveals his back-up plan.\nCrocodile informs Vivi and Cobra that he has planted a bomb to explode in the Palace Square at 4:30, one and a half hours after the Rebel Army and the Royal Guard clash at the Square. \nCrocodile then instead asks for the location of the Poneglyph from Cobra, who agrees to go with Crocodile and take him to the location. Enraged, Chaka prepares to attack Crocodile.\nElsewhere, Nami attempts to further understand the Clima-Tact and reads Usopp's instructions on the special Tornado Tempo attack as Miss Doublefinger continues her attack. Nami considers the options ahead of her and uses many of the features of the Clima-Tact, to the amusement of Miss Doublefinger, who continues to attack Nami as she tries to buy more time for her strategy.\nOutside Alubarna, Sanji meets up with Usopp and Chopper and returns Usopp's goggles that he took from Mr. 2. They all meet up with Matsuge and decide to continue towards the palace to help Vivi. \nAt the Alubarna North Block, Miss Doublefinger continues to attack Nami, leaving her injured and bleeding but Nami buys enough time to create a thundercloud and launches an electric shock on Miss Doublefinger. Angry and injured, Miss Doublefinger again attacks Nami at which point Nami reveals her Mirage Tempo ability which manipulates the humidity of the atmosphere to create mirages. This allows Nami to go behind Miss Doublefinger and remember the information from Usopp that warns her that Tornado Tempo is a one-time attack only. Nami remembers the dangers the crew has been through and resolves to continue fighting for Vivi's sake, but her injured leg is causing her to falter. Seeing an opportunity, Miss Doublefinger attacks with her Sea Urchin Stinger, and Nami stops the attack with her leg.\nNami launches the Tornado Tempo, which initially does not do anything, but then wraps around Miss Doublefinger and launches her through buildings, ending the fight in Nami's victory.\nIn another location, Zoro and Mr. 1 are clashing, and Zoro recalls that Mr. 1 used to be a famous assassin in West Blue. They clash, and Zoro realizes that Mr. 1's body is as hard as steel, exclaiming that he can not yet cut still but has been waiting for an opportunity like this to grow stronger.\n",
  "characters": [
    "Chaka",
    "Nefertari Vivi",
    "Crocodile",
    "Nefertari Cobra",
    "Nico Robin",
    "Nami",
    "Miss Doublefinger",
    "Usopp",
    "Tony Tony Chopper",
    "Sanji",
    "Matsuge",
    "Monkey D. Luffy (flashback)",
    "Roronoa Zoro",
    "Mr. 1"
  ],
  "ssum_frequencies": [
    [
      "to",
      2
    ],
    [
      "the",
      2
    ],
    [
      "with",
      2
    ],
    [
      "and",
      2
    ],
    [
      "crocodile",
      1
    ],
    [
      "reveals",
      1
    ],
    [
      "vivi",
      1
    ],
    [
      "about",
      1
    ],
    [
      "ancient",
      1
    ],
    [
      "weapon",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      27
    ],
    [
      "and",
      20
    ],
    [
      "to",
      18
    ],
    [
      "nami",
      11
    ],
    [
      "her",
      11
    ],
    [
      "of",
      9
    ],
    [
      "that",
      9
    ],
    [
      "miss",
      8
    ],
    [
      "doublefinger",
      8
    ],
    [
      "crocodile",
      7
    ],
    [
      "attack",
      7
    ],
    [
      "for",
      5
    ],
    [
      "in",
      5
    ],
    [
      "but",
      5
    ],
    [
      "a",
      5
    ],
    [
      "with",
      5
    ],
    [
      "is",
      4
    ],
    [
      "he",
      4
    ],
    [
      "at",
      4
    ],
    [
      "tempo",
      4
    ]
  ]
}