{
  "chapter_number": "Episode 93",
  "title": "Coming to the Desert Kingdom!The Rain-Calling Powder and the Rebel Army",
  "short_summary": "Luffy separates from the rest of the crew right after arriving at Arabasta's port city of Nanohana. The crew members disguise themselves while Luffy learns about Dance Powder.\n",
  "long_summary": "As the Straw Hats arrive at Arabasta, Nami expects everyone to be on their best behavior. However, Luffy immediately runs off to get food, separating from his crew. The crew then notices that Mr. 3's ship is docked nearby and Vivi remembers that the ship moves by the means of Mr. 3's Doru Doru no Mi. Vivi says that she and Karoo cannot go onto the streets since most of the citizens would immediately recognize her, so Usopp comes up with an idea to walk through the streets while hiding under a blanket. After walking through the streets being concealed under a blanket, they manage to get to a safe place. Vivi says that she plans on going to Yuba where the rebel's base is but the only way for them to travel is crossing the desert so they decided to stock up on supplies. Sanji and Chopper are the only ones who Mr. 3 has not seen so they go off to buy the supplies.\nIn the middle of a desert, Luffy finds himself lost but then sees smoke in the distance and thinks that the smoke is coming from a restaurant. Sanji and Chopper are buying the supplies they need but Chopper notices a strange smell which makes him feel uncomfortable and Sanji tells him that it is called perfume. Sanji is distracted by the beautiful women in Arabasta and Chopper cannot bear the aroma, so Sanji tells him that he would take care of the shopping and runs off, yelling for the women. Chopper is exhausted by the heat so he decides to rest in a truck with enough shade to cool down. He decides to take a nap inside until Sanji returns, but after he falls asleep, the truck starts to travel with Chopper inside.\nLuffy stands in front of the building that had smoke coming out, but much to his disappointment, he thinks it does not look anything like a restaurant. Luffy sees a pile of bags filled with green powder and comments that it tastes awful after trying a little. He then puts all the bags into the incinerator thinking it must be poison. When the bags are being burnt, Luffy notices the smoke coming out of the chimney turning into a faded green color and then dark clouds start to appear. Rain starts falling from the clouds and a man inside the building realizes the rain and rushes outside. The man starts getting upset since the powder was his great ambition. Luffy apologizes and says that he could simply buy it again but the man says that it is very difficult to get and accidentally reveals that the sale is prohibited, making Luffy realize that the old man is a criminal.\nWhen Chopper wakes up, he is confused and panics because the truck is moving. After that, the truck stops as it arrives to where Koza is. Inside a room, a man coming to Koza has a short talk and Koza says that he and the rebel army will change Arabasta. While Chopper is nervous, Matsuge helps Chopper escape. Chopper asks the camel why he helped him escape and it replies by saying that it makes him look cool. Chopper thinks that the camel is weird but fun. Chopper then goes back to Nanohana by following the aroma of perfume.\nLuffy is sitting along with Kamonegi, whose face is swollen. Luffy asks the man what the powder was for and he replies that the green powder is called Dance Powder, also known as Rain-Calling Powder. It goes through a complicated process to artificially make rainfall. He then goes on saying that Arabasta has fought against drought since ancient times, but they were not able to use Dance Powder since it is prohibited by the World Government and that the rebellion is one of the outcomes of the drought.\nSanji and Chopper come back from shopping and they now plan on going to Yuba. Vivi says that this will be a scorching, hot journey and they put all their strengths into the journey. However, they suddenly remember that Luffy is missing.\n",
  "characters": [
    "Nefertari Vivi",
    "Karoo",
    "Nami",
    "Roronoa Zoro",
    "Usopp",
    "Sanji",
    "Monkey D. Luffy",
    "Tony Tony Chopper",
    "Matsuge",
    "Kamonegi",
    "Koza"
  ],
  "ssum_frequencies": [
    [
      "the",
      3
    ],
    [
      "luffy",
      2
    ],
    [
      "of",
      2
    ],
    [
      "crew",
      2
    ],
    [
      "separates",
      1
    ],
    [
      "from",
      1
    ],
    [
      "rest",
      1
    ],
    [
      "right",
      1
    ],
    [
      "after",
      1
    ],
    [
      "arriving",
      1
    ]
  ],
  "lsum_frequencies": [
    [
      "the",
      51
    ],
    [
      "and",
      23
    ],
    [
      "to",
      22
    ],
    [
      "that",
      22
    ],
    [
      "is",
      21
    ],
    [
      "a",
      19
    ],
    [
      "chopper",
      13
    ],
    [
      "he",
      12
    ],
    [
      "it",
      11
    ],
    [
      "luffy",
      10
    ],
    [
      "of",
      10
    ],
    [
      "they",
      8
    ],
    [
      "but",
      8
    ],
    [
      "sanji",
      7
    ],
    [
      "powder",
      7
    ],
    [
      "then",
      6
    ],
    [
      "by",
      6
    ],
    [
      "says",
      6
    ],
    [
      "man",
      6
    ],
    [
      "on",
      5
    ]
  ]
}