{
  "chapter_number": "Episode 86",
  "title": "Hiriluk's Cherry Blossoms and Inherited Will",
  "short_summary": "More of Chopper's past is revealed, including the fate of Doctor Hiriluk and Wapol's cruelties as the king. Meanwhile, Wapol reaches the castle where the Straw Hat Pirates are residing.\n",
  "long_summary": "Luffy is locked down in a room by Chopper, but he steals the key and is able to get out. After Luffy starts chasing Chopper again, he suddenly stops because he smells Wapol is nearby.\nKureha continues telling the story of Chopper's past. Chopper is running through the woods when he suddenly crashes into a tree, he then remembers about when he heard Wapol's soldiers talking about a mushroom that could cure all diseases, requested by the Isshi-20. He proceeds to enter Hiriluk's place in search for the book where the mushroom is depicted. After finding the book, he goes on a journey to find the Amiudake. In his voyage, he encounters a herd of reindeer. One of the reindeer bumps him with his head, after standing up again, Chopper fights back. Later, he finally finds the fungus, but the herd has followed him. Hiriluk is experimenting in his laboratory when the door opens, he is amazed as Chopper enters extremely beaten up. With an eye closed and a broken leg, he delivers the saprophyte to his friend. The quack kneels down to him and hugs him as he cries, telling him he will become a great doctor because of his kind heart. After the quack doctor eats the mushroom soup, he goes to the town and orders Chopper to rest. In the town, soldiers are restricting access to Drum Castle because Wapol ordered to say that all the doctors at the castle where sick. Kureha arrives at Hiriluk's cave where Chopper shows the mushroom he fed. A horrified Kureha beats Chopper and tells him that the mushroom was poison. The reindeer tries to deny her claims but Kureha assures him of her claims and tells him that there is no medicine that can work for all diseases and that is why doctors exist and being kind is not enough to save people. Kureha further explains that Chopper needs medical skills and the training to use them. Realizing what he did, Chopper starts crying hysterically as a saddened Kureha calls him a poor fool.\nHiriluk arrives in town and throws two bombs at the guards. He then orders a guard to take him to the top of the mountain where the castle is. When he reaches the castle, Wapol reveals that he lied about the Isshi-20 being sick, because it was just a trap for him, so he could be executed. Meanwhile, Chopper is running towards the mountain in order to save Hiriluk, but he arrives after the doctor made himself explode. Dalton stops an enraged Chopper, because if he fights, he would only end up dead. Dalton affirms he would carry on with Hiriluk's legacy. Because he rebels in front of Wapol, Dalton is locked up.\nBack in the present, Luffy spots Wapol and the others at the top of the mountain. Chopper also lets Kureha know of their arrival.\n"
}